{
    "id": "string(optional)",
    "title": "Market Strategy Manager, Capital Markets",
    "slug": "marketing_chainlink-market-strategy-manager-capital-markets",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "Marketing",
    "tags": [
        "DeFi",
        "Finance",
        "Web3"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "",
    "applyLink": "https://jobs.lever.co/chainlink/b7abcfd2-cb2c-4ad1-ae44-8eacdcf937a9?lever-origin=applied&lever-source%5B%5D=Cryptocurrencyjobs.co",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "    <p>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST). We encourage you to apply regardless of your location.</p><h2>About Us</h2><p>Chainlink is the industry-standard Web3 services platform that enables developers to build feature-rich Web3 applications with seamless access to real-world data and off-chain computation.</p><ul><li>Chainlink has helped enable $8T+ in transaction value since the start of 2022.</li><li>Over 1,700 Web3 projects have integrated Chainlink services.</li><li>Chainlink is live on 15+ blockchains with many having joined the Chainlink SCALE program.</li><li>Chainlink is relied upon by industry-leading protocols like Aave, Compound, Paxos, Synthetix, and ENS.</li><li>Chainlink has delivered 7.4B+ data points on-chain and onboarded 900+ decentralized oracle networks.</li><li>Chainlink has established collaborations with Associated Press, Accuweather, AWS, Google Cloud, Meta, and Twilio.</li><li>The world-class Chainlink Labs research team has won various awards for its work on distributed systems, security, and more.</li></ul><h2>Who we&rsquo;re looking for:</h2><ul><li>You&rsquo;re focused on what matters most and ignore unimportant industry distractions. </li><li>You take extreme ownership and deliver outstanding results. </li><li>You have a growth mindset, seek out feedback and engage in constructive dialogue with others to help them grow.</li><li>You move fast and evolve with rapidly advancing technologies. </li><li>You want to be part of a team that excels and is committed to building the Chainlink Network and growing the Web3 ecosystem over the long term. </li><li>You are welcoming toward a diverse network of participants joining an open, global standard.</li><li>You&rsquo;re excited about the future of Web3 and building a world powered by cryptographic truth. </li></ul><p>The Product Team at Chainlink Labs is dedicated to delivering cutting-edge solutions for the rapidly evolving world of DeFi, on-chain finance, gaming, NFTs, and other major verticals. Our team of experienced product managers, designers, and engineers work together to create innovative products and services that enable smart contracts to securely access off-chain data and systems.</p><p>With a focus on user-centered design, we strive to create intuitive and seamless experiences for developers and end-users alike. We are constantly pushing the boundaries of what is possible in the blockchain space, and our products are used by some of the most innovative and forward-thinking organizations in the industry.</p><p>Whether it&rsquo;s building new features for the Chainlink Platform decentralized oracle network, creating new tools and integrations for developers, or exploring new use cases for blockchain technology, the Product Team at Chainlink Labs is at the forefront of innovation in the blockchain space. Join us on our mission to create a more decentralized world.</p><p>Chainlink Labs is seeking a highly skilled and motivated Market Strategy Manager, Capital Markets (MSM) to join our team. As a Market Strategy Manager, you will play a crucial role in driving the growth and success of our Capital Markets market segment. This position requires a unique blend of technical expertise, industry knowledge, strategic thinking, relationship management, and coordination skills. </p><p>The ideal candidate will have a deep understanding of Capital Markets, traditional finance (TradFi), decentralized finance (DeFi), and blockchain technology. You will collaborate with cross-functional teams, including Enterprise, Go-To-Market, Product, Marketing, and Engineering, to develop and execute market strategies, strengthen partnerships, and ensure the seamless delivery of our products. This is an exceptional opportunity for a talented professional to make a significant impact on the future of blockchain integration in the financial industry.</p><h2>Objectives of this Role</h2><ul><li>Own, drive, and expand the relationship with key financial institutions, establishing and nurturing a strong partnership.</li><li>Collaborate with our Enterprise Go-To-Market team to foster deeper relationships with financial institutions and key stakeholders.</li><li>Coordinate and align all stakeholders, ensuring an outcome-driven approach and successful execution of market strategies.</li><li>Contribute to the cross-product vision for Capital Markets, shaping the future direction and growth of our relevant product lines.</li><li>Stay up to date with industry trends, competitor analysis, and user feedback to inform decision-making, product roadmaps and drive continuous improvement.</li><li>Embody and uphold the core values of quality, delivery, and integrity of the Market Strategy Managers.</li></ul><h2>Skills &amp; Qualifications</h2><ul><li>Strong understanding of Capital Markets and TradFi, including industry trends and standards related to digital assets, business processes, real-world asset tokenization and regulatory expectations. </li><li>Deep understanding of and interest in DeFi and Blockchain, enabling you to provide valuable insights and guidance.</li><li>Possess analytical capacity akin to that of Strategy consulting best practices, demonstrating a high level of critical thinking and problem-solving skills.</li><li>Show high engagement and commitment to upholding the highest standards of performance and professionalism.</li><li>Background in DeFi and blockchain, showcasing your passion and understanding of the industry&rsquo;s potential and challenges.</li><li>Programming or architecture experience or technical studies in computer science, equipping you with a solid foundation for technical discussions and decision-making.</li><li>Ability to think strategically and present to C-level executives.</li><li>Genuine enthusiasm for blockchain technology and its transformative impact on Capital Markets.</li></ul><h2>Preferred Qualifications</h2><ul><li>Preference for experience with Solidity, enabling you to contribute to smart contract development and integration.</li><li>Previous work experience with DeFi protocols, providing valuable insights into the decentralized finance landscape.</li><li>Preference for candidates located in European timezones</li></ul>",
    "createdOn": "2023-08-18",
    "companyId": 20
}