{
    "id": "string(optional)",
    "title": "Strategic Finance Manager",
    "slug": "operations_chainlink-strategic-finance-manager",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "Operations",
    "tags": [
        "Economist",
        "Finance",
        "Risk Management"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "",
    "applyLink": "https://jobs.lever.co/chainlink/b3de1995-8e96-480f-ab4d-e5939db7b351?lever-origin=applied&lever-source%5B%5D=Cryptocurrencyjobs.co",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "    <p>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST). We encourage you to apply regardless of your location.</p><h2>About Us</h2><p>Chainlink is the industry-standard Web3 services platform that enables developers to build feature-rich Web3 applications with seamless access to real-world data and off-chain computation.</p><ul><li>Chainlink has helped enable $8T+ in transaction value since the start of 2022.</li><li>Over 1,700 Web3 projects have integrated Chainlink services.</li><li>Chainlink is live on 15+ blockchains with many having joined the Chainlink SCALE program.</li><li>Chainlink is relied upon by industry-leading protocols like Aave, Compound, Paxos, Synthetix, and ENS.</li><li>Chainlink has delivered 7.4B+ data points on-chain and onboarded 900+ decentralized oracle networks.</li><li>Chainlink has established collaborations with Associated Press, Accuweather, AWS, Google Cloud, Meta, and Twilio.</li><li>The world-class Chainlink Labs research team has won various awards for its work on distributed systems, security, and more.</li></ul><h2>Who we&rsquo;re looking for:</h2><ul><li>You&rsquo;re focused on what matters most and ignore unimportant industry distractions.</li><li>You take extreme ownership and deliver outstanding results.</li><li>You have a growth mindset, seek out feedback and engage in constructive dialogue with others to help them grow.</li><li>You move fast and evolve with rapidly advancing technologies.</li><li>You want to be part of a team that excels and is committed to building the Chainlink Network and growing the Web3 ecosystem over the long term.</li><li>You are welcoming toward a diverse network of participants joining an open, global standard.</li><li>You&rsquo;re excited about the future of Web3 and building a world powered by cryptographic truth.</li></ul><p>The Finance team is focused on enabling Chainlink Labs to operate as a financially healthy and responsible business, building for speed and scale while avoiding unnecessary friction. We manage our capital resources carefully, surveying the road ahead to anticipate and prepare for any turn, and ensure the right resources are allocated for maximum returns. We analyze the business and report on key performance indicators, partner closely with other teams across the company, and ensure that we drive the right business outcomes, proper compliance, and accountability.</p><p>Chainlink Labs is seeking a highly skilled and motivated Strategic Finance Manager to join our dynamic team. As a Strategic Finance Manager, you will play a crucial role in assessing the financial viability and commercial risks of Chainlink products and services as well as its effect on the overall ecosystem. Your expertise will be instrumental in collaborating with various teams to develop innovative financial solutions and drive strategic decision-making.</p><p>The ideal candidate will possess a deep understanding of blockchain technology, various financial products, risk management, and possess a broad knowledge base across economics, portfolio theory, derivatives, treasury operations, accounting and tax</p><h2>Objectives of this Role</h2><ul><li>Demonstrate deep understanding of Chainlink products via partnering with GTM / Product / BizOps and providing tangible value in assessing commercial viability &amp; financial risks in each respective areas (Pricing &amp; Deal Structuring, Product Design, Commercial Viability Modeling &amp; Ecosystem Economics). </li><li>Become a thought leader on the latest trends in Blockchain financial products and its effects on Chainlink products and ecosystem by partnering with Portfolio Management, Treasury and GTM</li><li>Become a &ldquo;connective tissue&rdquo; within Finance (FP&amp;A, Controllership, Tax and Treasury) and BizOps/ Product / GTM to understand and solve complex cross-functional problems. </li></ul><h2>Skills &amp; Qualifications</h2><ul><li>Deep understanding and interest in Blockchain financial products, including how it actually works from the financial theory standpoint </li><li>Demonstrated ability to quickly understand unique problems and find creative solutions</li><li>Good understanding of a vast variety of subjects (Economics, Modern Portfolio Theory, Derivatives, Econometrics, Treasury Operations, Accounting, Tax) and ability to ask the right questions and steer subject matter experts to the right outcomes. </li><li>Deep understanding of risk management, both from the product / financial instrument risk management and enterprise risk management standpoint</li><li>Prior experience working on complex and novel cross-functional problems with GTM, Product, Finance and BizOps with demonstrated measurable success</li><li>&ldquo;Roll up the sleeves&rdquo; attitude with no problem being too small to solve</li></ul><h2>Preferred Qualifications</h2><ul><li>Located within AMERS time zones (preferably ET). </li><li>Data Science and Coding (Python) experience. </li><li>Quantitative Finance / Econometrics background</li></ul>",
    "createdOn": "2023-08-18",
    "companyId": 20
}