{
    "id": "string(optional)",
    "title": "Business Development Internship",
    "slug": "sales_gelato-network-business-development-internship",
    "jobType": [
        "INTERN"
    ],
    "role": "Remote",
    "tags": [
        "Internship",
        "Sales",
        "Business Development"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "",
    "applyLink": "https://apply.workable.com/gelato-digital/j/59FC29A69F/?ref=cryptocurrencyjobs.co",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "    <p>Gelato is Web3&rsquo;s decentralized backend empowering builders to create augmented smart contracts that are automated, gasless &amp; off-chain aware.</p><p>Leading Web3 projects rely on Gelato to power the execution of millions of transactions across DeFi, NFT and Gaming.</p><p>Join our team and work directly with the founders to build the future of web3 infrastructure. Enjoy a lot of perks, travel with us to cool events, and participate in amazing off-site retreats with the team!</p><h2>Our mission</h2><p>Gelato&rsquo;s mission is to accelerate the adoption of web3 technology to create a more transparent &amp; democratic digital life for humanity. Our impact is measured by the time saved to achieve global adoption of web3 applications.</p><p>Watch a <a>short summary</a>.</p><h2>What you&rsquo;ll accomplish:</h2><ul><li>Scanning the web3 market for new partners and establishing the first point of contact</li><li>Qualifying existing business development opportunities</li><li>Conducting research on new ways on how to use Gelato products for our existing partners</li><li>Work closely with the business development and marketing team on new ways of driving growth</li></ul><h2>What we offer:</h2><ul><li>A fully remote team with team members in Zug, Paris, New York, Berlin, and many other cool places</li><li>Join the &ldquo;Gelato Legendary Member Club&rdquo; and work directly with the founders</li><li>Participate in building the infrastructure that aims to become the glue between all crypto networks and power the most promising dapps on Ethereum and beyond</li><li>Chance to participate in shaping the future of web3 by working together with the biggest projects in this space, such as MakerDAO, Connext, Quickswap, etc.</li><li>Worldclass Investors - We are backed by top class VCs and Angels including Dragonfly, Galaxy Digital, ParaFi, Gnosis, Stani Kulechov and many more</li></ul><h2>Requirements</h2><ul><li>Technical selling experience, preferably in B2B infrastructure solutions.</li><li>Ability to explain complex technical problems in simple ways</li><li>Well-organized with strong time management skills and a proactive personality</li><li>Experience using CRMs like Hubspot, Pipedrive, etc</li><li>Track record of overachieving your goals</li><li>Comfortable in fast-paced environments</li><li>Strong interest in DeFi, Gaming, and NFTs</li><li>Bonus: Experience within a web3 middleware projects</li></ul><h2>Benefits</h2><ul><li>Work very autonomously</li><li>Unlimited holiday (yes you heard that right!)</li><li>Work together with one of the best technical teams on Ethereum</li><li>Build relationships with top blockchain teams which are already Gelato users, including MakerDAO, Zed Run, Connext, Optimism and many more</li><li>Chance to travel the world to go to exciting events and connect with key players in this industry</li><li>Join amazing in-person offsites all over the world</li></ul>",
    "createdOn": "2023-08-18",
    "companyId": 22
}