{
    "id": "string(optional)",
    "title": "Senior Data Partnerships Manager",
    "slug": "sales_chainlink-senior-data-partnerships-manager",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "Sales",
    "tags": [
        "Data",
        "Finance",
        "Non-Tech"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "",
    "applyLink": "https://jobs.lever.co/chainlink/f8160665-da41-40e5-aee6-8969b8df0afb?lever-origin=applied&lever-source%5B%5D=Cryptocurrencyjobs.co",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "    <p>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST). We encourage you to apply regardless of your location.</p><h2>About Us</h2><p>Chainlink is the industry-standard Web3 services platform that enables developers to build feature-rich Web3 applications with seamless access to real-world data and off-chain computation.</p><ul><li>Chainlink has helped enable $8T+ in transaction value since the start of 2022.</li><li>Over 1,700 Web3 projects have integrated Chainlink services.</li><li>Chainlink is live on 15+ blockchains with many having joined the Chainlink SCALE program.</li><li>Chainlink is relied upon by industry-leading protocols like Aave, Compound, Paxos, Synthetix, and ENS.</li><li>Chainlink has delivered 7.4B+ data points on-chain and onboarded 900+ decentralized oracle networks.</li><li>Chainlink has established collaborations with Associated Press, Accuweather, AWS, Google Cloud, Meta, and Twilio.</li><li>The world-class Chainlink Labs research team has won various awards for its work on distributed systems, security, and more.</li></ul><h2>Who we&rsquo;re looking for:</h2><ul><li>You&rsquo;re focused on what matters most and ignore unimportant industry distractions. </li><li>You take extreme ownership and deliver outstanding results. </li><li>You have a growth mindset, seek out feedback and engage in constructive dialogue with others to help them grow.</li><li>You move fast and evolve with rapidly advancing technologies. </li><li>You want to be part of a team that excels and is committed to building the Chainlink Network and growing the Web3 ecosystem over the long term.</li><li>You are welcoming toward a diverse network of participants joining an open, global standard.</li><li>You&rsquo;re excited about the future of Web3 and building a world powered by cryptographic truth. </li></ul><p>The Product Team at Chainlink Labs is dedicated to delivering cutting-edge solutions for the rapidly evolving world of DeFi, on-chain finance, gaming, NFTs, and other major verticals. Our team of experienced product managers, designers, and engineers work together to create innovative products and services that enable smart contracts to securely access off-chain data and systems.</p><p>With a focus on user-centered design, we strive to create intuitive and seamless experiences for developers and end-users alike. We are constantly pushing the boundaries of what is possible in the blockchain space, and our products are used by some of the most innovative and forward-thinking organizations in the industry.</p><p>Whether it&rsquo;s building new features for the Chainlink Platform decentralized oracle network, creating new tools and integrations for developers, or exploring new use cases for blockchain technology, the Product Team at Chainlink Labs is at the forefront of innovation in the blockchain space. Join us on our mission to create a more decentralized world.</p><h2>Objectives of this Role</h2><ul><li>Establish yourself as a trusted partner to the top 20 Data Providers (DPs) in our current portfolio</li><li>Enable your team to deliver on 100% of strategic data requests</li><li>Deliver the 2024 budget for Data Provider costs across Chainlink Networks</li><li>Structure a Data Provider partnership review framework to improve service quality and optimize costs</li><li>Coach and develop your team members to exemplary performance</li></ul><h2>Skills and Qualifications</h2><ul><li>Proven ability to structure data deals, grow and optimize partnership portfolios</li><li>Experience with traditional financial data and data services as a customer or provider</li><li>Experience in developing data products internally or through partnerships</li><li>Ability to coach and guide team members to deliver and execute both internally and externally</li></ul><h2>Preferred Qualifications</h2><ul><li>Experience with DeFi and Blockchain</li><li>Ability to deliver detailed product requirements or code prototypes</li><li>Ability to analyze time series data and legal agreements</li></ul>",
    "createdOn": "2023-08-18",
    "companyId": 20
}