{
    "id": "string(optional)",
    "title": "A&R Intern",
    "jobType": "Internship",
    "role": "Education and Training",
    "tags": [
        "Technology",
        "Information and Internet"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "Los Angeles, CA",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Hume is a groundbreaking music and entertainment company creating the next generation of virtual music artists.We blend immersive storytelling, direct to fan engagement, and bleeding edge visual tools to create new artist experiences.We are reimagining what it means to be an artist, what it means to be a fan.For more information visit wearehume.com.What We Are Looking ForWe are seeking a passionate and motivated A&R Intern to join the Hume team and immerse themselves in the world of music discovery and artist development.The A&R Intern will work collaboratively with our Label team, diving into the talent scouting process, nurturing artist relationships, and supporting the execution of a visionary strategy for our artists' success.At Hume, we value innovation, creativity, and authenticity. If you have an ear for talent, a love for music, and a desire to contribute to the growth and development of artists in a technology-driven environment, this is the opportunity for you. Join us in making engaging and transformative connections between artists and audiences, and play a vital role in shaping the future of music at Hume.What You'll DoProviding the A&R team with extensive Artist and song research and identifying opportunities such as independent artists and songs using both personal research and softwareWork with various social media platformsAssist in the tracking of artists leads from identification to signingWork with A&R Team to assist in projects related to developing and maintaining relationships within the creative community, cultivating a strong network of artists, songwriters, producers, engineers, managers, studios, and other creativesMay assist A&R’s in the gathering of song files & links for recent signingsDay-to-day office tasks and administrative work as neededWho You Are1+ years of relevant internship or full-time work experience, preferably in music or entertainmentExcellent communication and interpersonal skills (verbal and written) both with internal and external teamsMeticulous attention to detail and follow throughExtremely organized with superior time management skillsAbility to multitask and prioritize under tight schedules while maintaining production of high quality workOther QualificationsKnowledge of web3 is a bonus but absolutely not required. A willingness to learn is a must! Candidates must be based in the LA area and be able to come to the office once a week",
    "createdOn": "",
    "slug": "a-r-intern-at-art-blocks-inc-3684465315",
    "remote": false,
    "companyId": 1
}