{
    "id": "string(optional)",
    "title": "Apply for future roles!",
    "jobType": "Full-time",
    "role": "Other",
    "tags": [
        "Transportation",
        "Logistics",
        "Supply Chain and Storage"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "New York, United States",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "About Injective LabsInjective Labs is trailblazing a new dawn for Web3 enabled finance. We are the core contributors to Injective, one of the fastest growing blockchains in the industry. Injective provides an interoperable smart contracts platform that is optimized for building decentralized finance applications. Interoperability is at the core of Injective, which is natively integrated with chains such as Ethereum, Cosmos and Solana. Developers can rapidly launch premier financial applications suited for mass adoption using Injective’s infrastructure and specialized DeFi primitives such as the world’s first fully on-chain order book.Our team has decades of experience spearheading the largest financial institutions and tech organizations. Injective is incubated by Binance and is backed by leading firms such as Jump Crypto, Pantera and Mark Cuban.About The Role(s)Don't see anything that matches your experience right now, but you'd REALLY love to work with us and feel that you could add real value?Then send us your details, along with a cover note to let us know why you'd like to work with Injective Labs and what you can bring to Injective to help on our mission.Look forward to hearing from you.As an equal opportunity employer we don’t tolerate discrimination or harassment of any kind. Whether that’s based on race, ethnicity, age, gender identity, citizenship, religion, sexual orientation, disability, pregnancy, veteran status or any other protected characteristic as outlined by federal, state or local laws.",
    "createdOn": "",
    "slug": "apply-for-future-roles%21-at-inje",
    "remote": false,
    "companyId": 2
}