{
    "id": "string(optional)",
    "title": "Business Development Manager",
    "jobType": "Full-time",
    "role": "Business Development and Sales",
    "tags": [
        "Staffing and Recruiting"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "United States",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Role: Business Development ManagerLocation: RemoteDuration: FTE/PermanentThe RoleAs Business Development & Partnerships Manager you will contribute knowledge and experience of the web3, metaverse, blockchain and crypto ecosystem to inform the business development strategy.The successful candidate will establish partnerships with potential web3 protocol, communities, crypto project and social media partners. In addition, the role will manage the full business development lifecycle, from establishing connections to fully supporting protocol integration or product onboarding.What You'll DoEstablish new partnerships and targeted sales pipelines via informed outreachLead the negotiation of complex partnerships across various products in the product suiteSource, identify, and develop new initiatives to drive product adoptionPresent and communicate the product portfolio and opportunities to partnersBuild and maintain relationships with key decision makers internally and externally and share developments and market insights with all stakeholdersWork with other teams within client (product, marketing, etc) to bring new ideas and products to the market which will benefit our partnersTrack and report pipeline status, health, wins/losses, and progress towards goalsWhat We Are Looking ForUnderstand the Web3 landscape and community. You have a deep understanding of the Web3 project landscape and are able to quickly identity partnership opportunities.Communication Skills: You must be able to communicate with clients of all backgrounds and technical focuses. Well-developed written and verbal communication skills are must-haves.Organizational skills: You must be comfortable juggling numerous clients, on- and off-site meetings, and deadlines. Individuals who are highly organized are best equipped to manage the many parts of the job and keep client proposals and other tasks on track.Drive and self-motivation: The most successful business development managers are goal-oriented and mission-driven. Our team is decentralized, so a successful BD needs to be intrinsically motivated to do well & deliver value.Our Ideal Candidate Will Have3-4 years + experience in business development, inside sales, and/or technical salesAt least 1 years of experience in web3, crypto, and NFTsBackground in brand partnerships, brand collaborations, or eCommerce is a plusExceptional communication and collaboration skillsStrong track record of driving product growth and exceeding sales targetsDemonstrate ability to work autonomously and proactively with a strong work ethicExperience or familiarity using Notion and Slack",
    "createdOn": "",
    "slug": "business-development-manager-at-vir-consultant-llc-3542166806",
    "remote": true,
    "companyId": 35
}