{
    "id": "string(optional)",
    "title": "Community Manager - Web3 Metaverse Gaming - Fully Remote - ny",
    "jobType": "Full-time",
    "role": "Marketing",
    "tags": [
        "Human Resources Services"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "United States",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "About the Job We are seeking a dynamic and experienced Head of Community to join a dedicated team creating the next era in AAA games. In this role, you will be responsible for leading, growth and management of our community of players, as well as building relationships with key stakeholders within the gaming industry.The ideal candidate will have a strong background in community management, with experience in either traditional or web3 gaming. You will be a skilled communicator, with the ability to effectively engage and foster a sense of community among our players.As the Head of Community, you will be responsible for:Developing and executing a community management strategy that grows and nurtures a flourishing games community.Moderating online forums and social media channels, ensuring that players have a positive and supportive experienceCollaborating with game developers and designers to gather feedback and ideas from the communityBuilding relationships with key stakeholders in the gaming industry, including influencers, media, and other industry partnersEngage the community in fireside chats, AMAs, live streams and events to strengthen the bond between developer and community.Planning, implementing, and leading community initiatives while tracking relevant community KPIs. Analyzing community data and trends to identify opportunities for growth and improvement.Developing an outreach strategy to attract new cohorts to the Metaverse community.Coordinating and managing a community calendar, working closely with all stakeholders to ensure smooth execution.Monitoring and moderating community interactions that adhere to community and brand guidelines, and addressing member queries on the community.Being passionate about building a web3 community and fostering strong connections with members to exceed their expectations..Leading the community team and providing guidance and support to team membersPlanning and improving Discord server structure, bot and security management as needed.To Be Successful In This Role, You Should Have3+ years of experience in web3 community management, preferably in the gaming industry preferred.Excellent written and verbal communication skills, native English speaker or Bilingual proficiency will be an advantage.Strong organizational and project management skillsProficiency in using social media and online community platforms, with knowledge of online platforms like Medium, Twitter, Reddit, Quora, Telegram, Discord, etc.Ability to work in a fast-paced & international environment;Positive energy, team spirit & zest for fun are a must.If you are passionate about gaming and have a proven track record in community management, we encourage you to apply for this exciting opportunity. Please include your resume and a cover letter explaining why you are the ideal candidate for this role.Make sure to follow us here to get our most live jobs https://www.linkedin.com/company/cryptorecruitCryptorecruit are the worlds leading specialist recruiter for the blockchain/Cryptocurrency industry. We recruit positions from CEO,CTO, Project Manager, Solidity developer, frontend and Backend Blockchain developers to marketing/sales and customer service roles. Please browse our website and at www.cryptorecruit.com to search all our job vacancies.",
    "createdOn": "",
    "slug": "community-manager-web3-metavers",
    "remote": false,
    "companyId": 38
}