{
    "id": "string(optional)",
    "title": "Executive Assistant to CEO",
    "jobType": "Full-time",
    "role": "Administrative",
    "tags": [
        "Financial Services"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "New York, NY",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Executive Assistant to the CEO (Location: New York, NY - Hybrid)At dYdX you'll have an opportunity to build state-of-the-art decentralized technology that will redefine global financial markets. By joining us at this early stage you will make fundamental decisions that will shape the course of dYdX and our mission to democratize access to financial opportunity for all.→ Learn more about working at dYdX and our benefitsAbout dYdX : We’ve built the world’s leading decentralized exchange for crypto assets  dYdX is founded by an ex-Coinbase, ex-Uber engineer, with a Princeton CS background. Our team has previous experience at Google, Bloomberg, Amazon, Bain, NerdWallet, Facebook, Lyft and other top companies  We're a world-class team with top backers and advisors, including Andreessen Horowitz, Polychain Capital, Brian Armstrong, Fred Ehrsam, Naval Ravikant, Elad Gil and more Hi, I’m Antonio, the CEO of dYdX 👋 and I’m looking to hire an Executive Assistant.dYdX is the world’s leading decentralized exchange by trading volume. We’ve raised $87m from the top investors in crypto, and I’m fortunate to have the best advisors & coach in the space - in the past year we’ve grown from a 25→52 person team.This Executive Assistant position is not a typical assistant role - you’ll have unlimited access to all my communications, my meetings and interactions with the team, and thought process. You’ll help with managing me and giving me feedback, generating valuable insights for me and the company, taking notes and running my meetings, fielding all my communications, scheduling my calendar, planning and participating in events, coordinating my personal life, and generally accompanying me in everything I do.RESPONSIBILITIES:  You'll start by shadowing me in all of my meetings, and then increasingly take on tasks that need to be done but I don't have time for, allowing us to work more efficiently together Attend all meetings with me so that you have the full context, take notes, and ensure action items are followedGain a comprehensive understanding of daily activities at the company and in crypto, and highlight the most important updates to me so that I have a well-rounded context for decision makingBecome my accountability partner by helping me prioritize my time, recommending key activities that I should focus on, and providing consistent feedback to meManage communications and relationships effectively by building strong partnerships and maintaining our reputation for excellenceTake initiative in identifying opportunities for the company to optimize collaboration and operate effectivelyBe a cultural carrier for the team - plan and organize high visibility events in the crypto communityHelp me with managing different aspects of my personal lifeCoordinate with and learn from my coaches to become an in house coach & advisor to meREQUIREMENTS: Excellent culture fit  Excellent interpersonal fit with me  Excellent verbal and written communication skills  Ability to navigate and embrace ambiguity  Highly organized  High initiative - founder mentality  Great first principles thinker  High EQ  4+ years of full-time work experience with at least 2 years as an Executive Assistant  A strong knowledge of and interest in tech startups  Strong work ethic and willingness to take on any task  Must be located in New York, NY or be willing to relocate to New York, NY NICE TO HAVE: A strong interest or curiosity in crypto & web3  Ability to understand complex technical blockchain topics  Salary range for this role is $105 K to $150K (NY). Compensation subject to experience and location. Published salary bands pursuant to transparency laws, and do not include possible variable compensation such as annual merit increases, bonus eligibility, commission, or equity incentive.",
    "createdOn": "",
    "slug": "executive-assistant-to-ceo-at-dydx-3696767311",
    "remote": false,
    "companyId": 31
}