{
    "id": "string(optional)",
    "title": "Head of Business Development, Gaming",
    "jobType": "Full-time",
    "role": "Business Development and Sales",
    "tags": [
        "Software Development"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "United States",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Yuga Labs is a web3 company exploring big ideas in identity, ownership, utility, and interoperability to push the crypto and NFT space forward. As The Defiant recently said, \"The story of Yuga Labs is one where the improbable has become reality in the blink of an eye.\" Since debuting with our flagship collection Bored Ape Yacht Club in April 2021, we’ve created new IP for the ape ecosystem (Mutant Ape Yacht Club, Bored Ape Kennel Club), acquired other top collections (CryptoPunks and Meebits), and pulled off successful events (ApeFest) and partnerships (Rolling Stone). And we made both web3 and gaming history — the biggest NFT mint ever followed by a game demo with record-breaking synchronized player participation — for our newest initiative, Otherside.See you on the other side 🫡Our TeamThe trailblazers and dealmakers on a quest to bring interoperability, ownership, and transparency to the next generation of gaming. This clan pushes the boundaries of what’s technically possible to build experiences that wow the most elite players and welcome new ones.Who We’re Looking ForWe are hiring our first Head of Business Development dedicated to Gaming. This person will be pivotal in continuing our efforts to bring blockchain gaming to the masses by establishing long-lasting relationships with outside game developers and identifying strategic partners for IP integration partnerships. This role will report to the SVP, Partnerships and Corporate Strategy and be expected to roll up their sleeves to build out the function over time.The JobNetwork with potential game developers/explore opportunities around strategic partnerships within the gaming ecosystem. Explore and lead conversations to identify and drive IP integration partnerships. Manage negotiation and contractual conversations with Chief Gaming Officer, Legal and relevant external parties. Work as a relationship manager for co-dev external game studios. Identify and promote additional ideas around how we can leverage gaming as a partnership/scale vector. Work with senior Executives to codify a business development strategy and drive this forward annually. Work with Legal/Business owners and Brand leads to drive tactical deal terms and milestone definitions etc. Your Skills10+ years working in Business Development and Partnerships with 5+ working directly in the gaming industry. Strong knowledge of the gaming industry and its trends, and strong existing relationships with game development studios. Proven track record of developing successful business partnerships and driving revenue growth. Experience with rolling up your sleeves to get the work done yourself, while also being able to build out a team over time. Excellent communication and negotiation skills. Ability to work independently and manage multiple projects simultaneously. Passion for gaming and the potential of blockchain technology. The annual salary for this position ranges from $200,000 to $250,000. The actual annual salary paid for this position will be based on several factors, including but not limited to, skills, prior experiences, training, company needs, and current market demands. The annual salary range for this position is subject to change and may be adjusted in the future. This position may also be eligible for salary increases, bonuses, equity awards, and benefits.What We OfferWorking with the best-in-class talent creating innovative technologies and bringing the forefront of culture to web3Exposure to innovative technologies in cryptocurrency, blockchain technology, and game developmentCollaboration with blue chip projects and AAA studios and partners Great internal growth and development100% remote Competitive compensation, benefits, and perksApply anyway.We believe true innovation in web3 requires diversity in perspectives, experiences, and backgrounds. But historically marginalized groups are underrepresented in the space, not just as participants but as leaders and creators. Luckily, we — and every web3 company — have the opportunity to bake necessary process and mindset shifts into our company DNA from the early days.To help build a web3 that’s diverse and inclusive, we strive to build Yuga’s workplace to be diverse and inclusive. Not just how we do things day to day, but who does them and who decides what needs to be done.So if you’re excited about one of our roles but your resume doesn’t align perfectly with the job description, please apply anyway. If you’re enthusiastic about web3 but come from an industry you think is unrelated, apply anyway. If you’re a great thinker and doer, apply anyway. The fate of web3 kiiinda depends on it.Life at Yuga Labs At Yuga Labs, being an Equal Opportunity Employer means more than upholding discrimination-free hiring practices. It means that we cultivate an environment where people can be their most authentic selves and find both belonging and support. We're shaping the future of identity, community, and technology—an experience made whole by our unique backgrounds and perspectives.As a remote-first company, we encourage our employees to care for their whole selves through comprehensive medical benefits, generous paid-time off, paid parental leave, retirement plans, company social events, wellness programs, and volunteer opportunities.Reasonable AccommodationYuga Labs applicants are considered solely based on their qualifications, without regard to applicant's disability or need for accommodation. Any Yuga Labs applicant who requires reasonable accommodations during the application process should contact the Yuga Labs Benefits Team (accommodations@yugalabs.com) to make the need for an accommodation known.",
    "createdOn": "",
    "slug": "head-of-business-development-gaming-at-yuga-labs-3599534118",
    "remote": true,
    "companyId": 41
}