{
    "id": "string(optional)",
    "title": "Investment Analyst Intern",
    "jobType": "Internship",
    "role": "Finance and Sales",
    "tags": [
        "Transportation",
        "Logistics",
        "Supply Chain and Storage"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "California, United States",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "About DoraHacksDoraHacks is a global hackathon organizer and one of the world's most active multi-chain Web3 developer platforms. Our platform enables hackers and open source developers around the world to participate in Hackathons, Bounty, Grant, Grant DAO, and get funding through the encrypted native protocol and infrastructure provided by DoraHacks. By far, more than 4000 projects from the DoraHacks community have received over $25 million in grants . A large number of open source communities, DAOs, and more than 50 major blockchain ecosystems are actively using Dora's infrastructure (DoraHacks.io) for open source funding and community governance.DoraHacks is building the future open source curation market. We believe that by equipping developers with the best tools, connecting them to the right people, we can help the open source community solve the whole world's problems better.For More InfoPlease visit our Website｜LinkedIn｜Twitter｜Discord |Youtube | Bilibili | DORA RESEARCH BLOGJoin UsIf you are motivated by the infinite hacker movementIf you are curious about the outerspaceIf you are ready to solve the real problems of the worldIf you are passionate about building the future of Web3 worldIf you want to be a digital nomadContact usRecruiting@dorahacks.comAbout The JobDora Ventures is the seed money accelerator of DoraHacks, a global hacker community and one of the largest blockchain developer networks in the world.Dora Ventures is growing fast and we need an exceptional analyst to join our team. If you aspire to be one of the best cryptocurrency analysts in the world, we want to hear from you. This role will work closely with the Partners to analyze investment opportunities in early-stage hacker projects, pre-launch & liquid digital assets. Come join us, drink from the crypto firehose, and learn about every investable category in crypto. This includes equity deals focused on blockchain infrastructure, in addition to pure token deals focused on decentralized finance, non-fungible tokens, middleware, and more.ResponsibilitiesPls be well noted \"This intern role is one without payment for at least 6months but can be transferred to a full-time role based on performance\"Make cryptocurrency verticals research & token economics and value accrual mechanisms analysisDevelop investment suggestions based on the above research and industry trendsMapping verticals in the digital asset landscapeExplain key info to Dora Ventures Partners and collaborate with them to get investment insights from the researchHelp our portfolio companies understand how to maximize the value of our investmentMaintain and reconcile trade dataRequirementsBachelor's degree or aboveExcellent data analytic skillsEnglish native with strong written and verbal communication skillsEager to acquire new knowledge with strong learning abilityProficient in Excel Python, R, Matlab, or experience with other analytics tools is a plusLogisticsThis is a remote position that can be done from anywhere. We are able to provide visa sponsorship in some countries, and the possibilities can be discussed in interview process.Our interview process takes place on Zoom/Google Meeting and consists of the following: Test (Online test/Take-home assignment) Recruiter call (15-30 minutes) Team interview (45-60 mins) Final interview (45 mins)If you need any support for the interview process, pls do not hesitate to contact us byrecruiting@dorahacks.com",
    "createdOn": "",
    "slug": "investment-analyst-intern-at-dorahacks-3433252656",
    "remote": true,
    "companyId": 40
}