{
    "id": "string(optional)",
    "title": "Investment Associate",
    "jobType": "Full-time",
    "role": "Finance and Sales",
    "tags": [
        "Transportation",
        "Logistics",
        "Supply Chain and Storage"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "Los Angeles, CA",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "M13 is an early stage venture capital firm investing in market-expanding technologies. With $900M under management, M13 is based in Los Angeles and invests across ecommerce enablement, fintech, digital health, future of work, AI and web3. We’re looking for an investment associate to join our team in Los Angeles. This is an exciting opportunity to work directly with our Principals and Partners and touch all aspects of the investment process, from sourcing to diligence, deal execution and portfolio management. While this is a generalist role, we’re looking for someone with a strong point of view in one or more of our core categories.Who you are:You are deeply passionate about technology and entrepreneurship, and have a point of view about how new technology can disrupt specific markets. You are analytical in your approach - you can build and navigate financial models, cap tables, and large data sets to distill the key points and tell a storyYou have a meaningful network of founder relationships and other early stage investors. You love discussing new concepts and attending startup events. Meeting new people gives you energy. Your opinion is valued and top founders seek you out for feedback. You are tenacious and curious. You don’t accept the commonly accepted wisdom or easy answer, but have a habit of digging deeper to develop true insight. You are comfortable and proficient working with data, including using Microsoft Excel, Pitchbook and PowerPoint to generate insights and communicate. You are a strong communicator and able to persuade others to your point of view by synthesizing facts and data into a compelling narrative. You have 3-5 years relevant experience that informs your skills and your point of view (typically at either an investment bank, a consulting firm, technology company, or venture fund)You have a strong academic track record and history of achievement. What you’ll be doing:Deal sourcing. Our associates play a critical role in understanding the entrepreneurial landscape, building relationships with founders and investors, and surfacing potential investments even before the companies are seeking capital. Conducting diligence. Our associate-partner teams go deep on financial analysis, market research, customer interviews, product reviews and competitive intelligence to assess an opportunity before we decide to invest. Associates are responsible for both quantitative and qualitative diligence, as well as drafting the investment memos that supports our decision-making. Supporting our portfolio. Our associates work closely with portfolio management teams as board observers and in helping founding teams access M13’s extensive platform resources. Often associates form deep relationships of their own with portfolio management and are considered trusted advisors. Developing our perspective on the markets where we invest. Every member of our investment team spends time building out investment theses across our key investment sectors - commerce, health, work, and fintech - and our two technology lenses - AI and web3. This work involves deep research on the market landscape and trends driving growth as well as surveying the startups addressing each market. What's in it for you:One Team, One Dream - A chance to work alongside world-class VC talent in a collaborative and developmentally-focused culture that is respectful, inclusive, diverse, and inspiring. You’ll do the best work of your life here and have fun doing itComprehensive Health Package - Medical, dental, and vision plans that are thoughtful and supportive of the needs of each M13 employeeOpen PTO Policy - We're focused on healthy work/life balance and therefore set no firm guidelines as to how much time off each employee is permitted to takeInvestment in Your Future - Employee Profit Sharing Program and 401(k) Retirement Plan with matching for all employees. Many more excellent perks available within our comprehensive benefits programAbout M13At M13, we are a team of industry-leading operating executives to help founders make better decisions and win in their category. Founders deserve an investor who propels them on their mission of transforming an idea into a successful company, while staying out of their way.M13 injects capital to fuel high growth, while helping founding teams fill gaps in their businesses through our Propulsion Team, which provides strategic counsel, operational expertise, and a constellation of talent, experts, and resources to accelerate growth. Where we see whitespace in an industry, our Launchpad develops the right founding teams, products, and practices to incubate and launch an idea from inception.Just like the stars of the cluster M13, we believe that together we shine brighter. We believe that advancement is a team mission. Our proven paradigm for success will create more winning companies and demonstrate that when investors and founding teams are aligned on a venture together, they can redefine what’s possible.M13 provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, genetics, sexual orientation, gender identity or gender expression. We deeply understand the value of bringing together a team with different perspectives, educational backgrounds, and life experiences. We encourage people from underrepresented backgrounds to apply.Actual compensation within this range will depend upon the candidate's skills, experience, qualifications, and level of impact in the role.",
    "createdOn": "",
    "slug": "investment-associate-at-m13-%F0%9F%",
    "remote": false,
    "companyId": 0
}