{
    "id": "string(optional)",
    "title": "Office Manager at Early-stage VC Firm",
    "jobType": "Full-time",
    "role": "Administrative",
    "tags": [
        "Venture Capital and Private Equity Principals"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "New York, NY",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Early-stage crypto venture firm is looking for an Office Manager to join their small team of 5 based in New York. This team has spent a long time in the industry and has excellent long-term capital so it’s an exciting place to be. In this role, you will wear many different hats - managing the day-to-day office operations, event planning, and assisting with team scheduling & coordination. Someone with a pulse on the New York scene when it comes to restaurants & venues, is tech-savvy, and is excited to learn new things in a growing and dynamic environment will thrive. This is a great opportunity to join a close-knit, collaborative team involved with well-known investors and companies! This is an in-office role based in SoHo. 90-110K+ DOE + benefits & flexible PTO!ResponsibilitiesProvide administrative, facility, and resource management.Oversee and manage the daily administrative operations of the office.Coordinate and prioritize tasks, ensuring deadlines are met and resources are allocated effectively.Develop and implement office policies and procedures to improve efficiency and productivity.Facility and Resource Management:Manage office facilities, including maintenance, repairs, and supplies procurement.Ensure that office equipment and systems are functioning properly.Food & Drinks - coordinate with vendors and service providers to ensure timely delivery of services to keep the kitchen stocked and resolve any issues.Facilitate communication and coordination.Serve as the primary point of contact for internal and external communications.Facilitate effective communication among staff members, departments, and external stakeholders.Coordinate meetings, conferences, and events, including scheduling, travel, logistics, and documentation.Prepare and distribute internal communications via Slack and/or Email.Help organize public-facing events.Manage and plan event invites for events that range from 10-100 people (few per quarter)As part of the job role, the Office Manager will be responsible for booking and organizing monthly social/networking events.Qualifications2+ years of experience as an Executive Assistant, Office Manager, Event Planner, or similar role.Strong communication, organizational skills, and willingness to wear multiple hats.Experience working in a fast-paced, dynamic environment with changing priorities and flexible responsibilities.High level of integrity and discretion in handling confidential information and working with parties both inside and outside the firm.Proficiency with Google Suite (Google Calendar, Docs, Sheets, Forms, and Slides).Curiosity/interest in and/or prior experience (personal or professional) with crypto/web3 a plus.Please Note: Your application will be considered for all open positions. You do not need to apply for multiple roles.",
    "createdOn": "",
    "slug": "office-manager-at-early-stage-vc-firm-at-bloom-talent-3668161026",
    "remote": false,
    "companyId": 39
}