{
    "id": "string(optional)",
    "title": "Paid Media Manager",
    "jobType": "Full-time",
    "role": "Marketing and Sales",
    "tags": [
        "Technology",
        "Information and Internet"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "Los Angeles, CA",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Who We Are:Single Grain is an award-winning digital marketing agency that has been dedicated to driving persistent growth for remarkable companies like Amazon, Uber, and Salesforce since 2009.We do this by providing industry-leading services around Paid Media, SEO, Content Marketing, CRO, and more.We are a team of digital marketers. We love what we do, and we help pioneers grow by empowering our clients with winning strategies that lead to faster growth. As a top digital marketing agency, we understand how fast-paced the marketing industry is. We pride ourselves on staying up to date with new algorithms, technology, and trends because that's what keeps us one step ahead of the competition.As a testament to our digital marketing expertise, we have a Digital Marketing blog with over 200,000 visitors/month, a podcast called ‘Marketing School’ with over 2 million downloads/month, and a YouTube channel with more than 74,000 subscribers.It's our mission to level up every human by educating and moving the digital industry forward. Our goal is to help you level up and succeed. We accomplish this through mentoring or training but also by providing great resources and tools.Check out our website for more on our company culture and values.Include the words \"Paid Media is cool\" in the first sentence of your cover letter (or your application will be disqualified).RequirementsWho You Are:We’re looking for a humble, hungry, and smart Paid Media Manager to join our growing Media Solutions team. The Paid Media Manager at Single Grain will hit the ground running. You are capable of growing revenues by successfully managing multiple Paid Media campaigns, including Paid Social, Amazon Shopping, and Search. You strategically develop and implement campaigns, manage budgets and bids, analyze campaign performance, and present data-driven insights. You are insatiably committed to maintaining successful relationships with your clients and your team as a trusted advisor, leader, and mentor.You will be a great fit if:You are tech-savvy, self-starting, resourceful, entrepreneurial, endlessly curious, and highly ambitiousYou have effective time management and organization skills, strong communication and interpersonal skills, a positive attitude, and a growth mindsetYou show up on time, pay attention to details, think on your feet, ask for help when you need it, and consistently demonstrate respect for othersYou have experience managing multiple paid media accounts You are able to adapt to changes within the industryResponsibilities:Successfully manage multiple paid media client accounts and communicate professionally with the client point of contactCreate and develop paid media campaigns across various industries and platforms (Google, Facebook, Bing, Twitter, Pinterest, Amazon, etc.)Be accountable for budget pacing and recommend strategic data-driven adjustmentsGather and analyze data insights (ROI, ROAS, CPA, CTR, conversion volume, etc.) to deliver reports with accuracy and propose action plans for optimizationMonitor the latest trends and changes in social media and the digital industryRequirements:Strategic expertise on multiple advertising platforms (e.g., Google, Facebook, Bing, Twitter, Pinterest, Amazon, etc.)4+ years of PPC campaign management experienceExperience with Google Analytics and Tag ManagerBasic knowledge of HTMLProject management and analytical skillsWriting and proofreading skills (creative copy, emails, etc.)Google Ads and Facebook Blueprint certifications a plusExperience with marketplaces such as Amazon a plusUnderstanding of Web3, blockchain and NFT technology a HUGE BONUSPrevious Web3 client experience a HUGE BONUS BenefitsSalary: $80,000 - $90,000Our BenefitsMedical, Dental, and Vision InsuranceFlexible PTOHome Office StipendMacBook Provided100% Remote",
    "createdOn": "",
    "slug": "paid-media-manager-at-single-grain-start-growing-3651898499",
    "remote": true,
    "companyId": 33
}