{
    "id": "string(optional)",
    "title": "Partnerships Executive",
    "jobType": "Full-time",
    "role": "Business Development and Sales",
    "tags": [
        "Technology",
        "Information and Internet"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "New York, NY",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Magic is spearheading the global shift to web3, a decentralized internet. Our focus is simplifying web3 onboarding and adoption by enabling instant web3 wallet creation, mirroring user-friendly web2 experiences. With 20M+ wallets, 130K+ developers, and $52 million in funding, we're shaping a future where users have total control over their digital assets.We believe in an internet that grants users new digital property rights, empowering personal ownership of virtual assets. This vision is endorsed by our major partners, such as Mattel, Macy's, ImmutableX, Niftys, & OpenSea, and leading investors like Tiger Global, Lightspeed Ventures, SV Angel, Social Capital, Northzone, Placeholder, Naval Ravikant, Alexis Ohanian, and Balaji Srinivasan.If you are excited to help onboard the next billion users to a useful, accessible, and safe Web3, let's chat!The RoleAs a Partnerships Executive at Magic, you will play a pivotal role in growing our partnerships ecosystem. Partnerships at Magic are a crucial bridge between Magic and external partners, effectively communicating the value proposition and benefits of collaboration. You will build programs that are scalable, design long term incentives, and bring high impact partners to Magic. The partnerships executive will directly impact our future as we build out web3's defining product experiences by identifying, developing, and leading initiatives focused on driving user and revenue growth. You will thrive in this role if you are creative, ambitious, hungry, action-oriented, fluent in web3 technologies, and excited by a fast-moving and innovative space.You WillLeverage your relationships with the ecosystem to identify and evaluate potential partnership opportunities, including strategic alliances, collaborations, and joint ventures. Develop and execute partnership strategies to drive growth and adoption of Magic's solutions. Cultivate and maintain relationships with key stakeholders, including blockchain companies, technology providers, agencies, industry associations, and enterprise companies. Negotiate and structure partnership agreements, ensuring alignment with business objectives and legal requirements. Collaborate with cross-functional teams, including product, marketing, and sales, to develop and implement partnership initiatives. Track and analyze partnership performance metrics, providing regular reports and insights to stakeholders. Stay updated on industry trends, competitive landscape, and regulatory developments related to blockchain technology. Represent the company at industry events, conferences, and trade shows to build brand awareness and network with potential partners. Provide guidance and support to internal teams on partnership-related activities, ensuring effective execution and alignment with overall business strategies. Contribute to the development of marketing collateral, presentations, and other materials to support partnership activities. You Have:6+ years of experience in partnerships, sales, or similar roles with a proven track record cultivating, closing, and managing partnership pipelines over time. Excited about developing, executing, and fine-tuning partnerships strategies and processes with an eye towards measurable results. Excellent collaboration skills and the ability to drive projects forward with processes that ensure efficient and high impact cross-functional collaboration. Strong written and verbal communicator who loves to connect with existing and potential partners with an ability to persuade, influence, and build trust at all levels. Effective leader who can distill information into actionable insights to inspire your team (and internal stakeholders) to achieve ambitious goals. Strong technical acumen with the ability to navigate strategic uses of NFT technology. Web3 fluency across wallets, blockchains, Discord, Twitter. Proficiency using CRM software (we use HubSpot) with an analytical mindset, including deriving and leveraging data insights to drive decision making. Committed to diversity, equity, and inclusion and building strategies with that commitment in mind. Bonus: You own several NFTs acquired from various sources. Bonus: Experience at a high-growth web3 company. Bonus: Experience in the gaming industryCompensation Range$150k-$200kBenefitsFully remote team and flexible working hoursCompetitive salary and stock optionsUnlimited paid time off99% coverage of platinum-level Health, Vision, and Dental insurance401(k) programTop of the line equipment$300 monthly budget for home office needs and professional development16 weeks of paid parental leaveFamily planning and reproductive health benefit with $5,000 lifetime reimbursement through MavenAnnual team meetupsDiscretionary performance bonusWe welcome all qualified candidates to apply for the position. However, please note that we are not currently able to provide visa sponsorship for employment. Applicants must already be authorized to work in the United States for any employer.At Magic, we believe building a team full of diverse perspectives and experiences is vital to success. Therefore, we strongly encourage anyone historically underrepresented in tech to apply for this role. Magic does not discriminate based on gender, sexual orientation, race, religion, citizenship status, age, or physical ability. Empathy, authenticity, and inclusivity are at the core of all we do.",
    "createdOn": "",
    "slug": "partnerships-executive-at-magic-3654519838",
    "remote": true,
    "companyId": 32
}