{
    "id": "string(optional)",
    "title": "Pitch your own role!",
    "jobType": "Full-time",
    "role": "Other",
    "tags": [
        "Financial Services"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "New York, NY",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Who We AreRain’s mission is to create the fastest and easiest pathways for web3 teams to spend crypto in the real world. We’re a small and mighty team of passionate builders and veteran founders building at the intersection of crypto and fintech. We are looking for a chief of staff to join us to accelerate the organization and guide early culture and personality within the company. You will have the opportunity to deliver massive impact at a small and quickly growing company that is funded by some of the top investors in fintech and crypto. We're based in NYC but are open to fully remote candidates.Our Ethos:We believe in an open structure and you will be able to grow into the roles that most align with their goals. Our team members at all levels have the freedom to explore ideas and impact the roadmap and vision of our company.Who We Are Looking ForRain is seeking awesome people. If you are excited about what we are building and think you can help, pitch us a role!Why this is a great opportunityJoy focused - we're building something massive and we want to spread joy among our users. Rain starts off as a credit card company and a community. You get to be a part of a company that wants to bring joy and great experiences to our user base.Cutting Edge - We are literally building on the very edge of what's possible in Web3 and pushing the envelope. you get to contribute and define the journey and opportunity at the highest levels.Super Early - We're early in our journey and team members joining now will see more personal, professional and financial growth than they've ever seen before in their careers. You also get to be the member of a founding team and inside the tornado. We're well funded and you will have more career stability than other early stage opportunities out there.Our perks enable working at Rain to be a fulfilling, healthy and happy experience.Unlimited time off 🛼Unlimited vacation can be daunting, so at Rain we require our teammates to take 10 days minimum for themselves.Flexible working ☕We support a flexible workplace, if you feel comfortable at home please work from home. If you’d like to work with others in an office feel free to come in. We want everyone to be able to work in the environment in which they are their most confident and productive selves.Flexible Benefits 🧠Easy-to-access benefits, for all employees based in the US, Rain pays a percentage of your benefits for the employee and for your dependents. We offer comprehensive health, dental and vision plans as well as a 100% company-subsidized life insurance plan.Equity plan 📦On top of a competitive salary, we offer every Rain employee an equity option plan so we can all can benefit from our success.Rain Cards 🌧️We want our teammates to be knowledgeable about our core products and services and to support this mission we issue a card for our team to utilize the card for testing.Health and Wellness 📚High performance begins from within. Our members are welcome to use their company card for eligible health and wellness spending like gym memberships, fitness classes and other wellness items.Team summits ✨Summits play an important role at Rain! Time spent together helps us get to know each other, strengthen our relationships, and build a common destiny. Stay tuned for upcoming destinations!",
    "createdOn": "",
    "slug": "pitch-your-own-role%21-at-rain",
    "remote": true,
    "companyId": 30
}