{
    "id": "string(optional)",
    "title": "Public Relations Account Executive (Associate)",
    "jobType": "Full-time",
    "role": "Sales and Business Development",
    "tags": [
        "Internet Publishing"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "Washington, DC",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Founded in 2015, Wachsman is a leading global strategy and communications firm advising the next generation of companies in Web3, disruptive technologies, fintech and venture capital. With regional headquarters in New York, Dublin, and Singapore, and additional offices in London, Geneva, Los Angeles, and Washington, DC, Wachsman has solidified its position as a trusted advisor to some of the most innovative companies around the world.At Wachsman, we focus on helping businesses establish and defend their industry position, seize opportunities, overcome challenges, and achieve sustainable commercial success in fast-moving and complex marketplaces. We offer clients a unique blend of advisory services across public relations and strategic communications, business strategy and consulting, digital marketing and events, regulation, and public policy.Wachsman is now seeking a talented Public Relations Account Executive, known internally and to clients as an Associate, for immediate hire.This is a fully remote role and we are open to candidates located anywhere in the United States. Wachsman has an office in New York City for those who are interested in a hybrid model.Duties:Performing day-to-day account work for clients, focusing on the execution of Public Relations campaigns.Supporting senior staff members with daily internal & external communications for clients.Responding to all inbound requests and questions from the press and clients.Drafting, editing, and distributing press materials and pitching to reporters across all channels.Daily media monitoring & reporting.Developing social media plans, creating content, and tracking campaigns across social channels.Conducting competitive research, and generating story ideas and angles.Developing relationships with journalists, and securing placements.Supporting and training junior staff members.Skills & Requirements:Bachelor’s degree required.Minimum 1 year of professional experience in Public Relations; agency environment strongly preferred.Exceptional written and verbal communication.Understanding of the technology and business media landscape.Demonstrated ability to prioritize and manage multiple projects with tight deadlines.Proactive problem-solving & solutions-oriented.Impeccable attention to detail.Professional, client-ready demeanor and presence in all communications and interactions (video, email/slack, in-person if applicable).Self-starter who thrives in a fast-paced team environment. Experience working within the crypto/blockchain/Web3 industry is a plus!Powered by JazzHRZBVhJrZzgG",
    "createdOn": "",
    "slug": "public-relations-account-executive-associate-at-wachsman-3686040249",
    "remote": true,
    "companyId": 29
}