{
    "id": "string(optional)",
    "title": "Recruiter- DeFi",
    "jobType": "Full-time",
    "role": "Human Resources",
    "tags": [
        "Human Resources Services"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "United States",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "We at the company aspire to transform and decentralize finance with tomorrow’s technology, with a globally distributed and close-knit team of doers and getters. Here’s an opportunity to join a movement to break the mold. Join the company and help us shape the future of personal finance.About The JobAs an Employer Branding Specialist, you will own the end-to-end spectrum of employer branding. Your primary deliverable will be ensuring that the world hears about the amazing culture and team we've built. If you love hiring great people, are passionate about the DeFi space, and enjoy full autonomy and visibility in your work, you'll fit right in!What You'll DoStrategize, plan, and execute the full end to end employer branding strategiesThis can include revamps of our job descriptions, web presence, narrative, EVP, etcMove us towards the goal of being known as THE tech business to work for (we already are! just gotta get the word out!)You will have full ownership of every deliverable, you need to want this. What you'll need:Minimum 1-year experience in an execution-heavy role as an employer branding specialistExperience in the earlier phases (ideation, strategizing, planning), is idealGreat marketing expertise and writing skillsA passion for teaching, and attracting, great talent in this talent arms raceA passion for the web3, DeFi spaceWhy Work With The CompanyDo something with purpose; Be a part of the future that will shape how people are dealing with their finances in Crypto and BlockchainFast-moving, challenging, and unique business problemsInternational, diverse work environment and flat hierarchyGreat career development opportunities in a growing companyThe company is a Singapore-based blockchain and fintech company that empowers users to be in control of their finances by creating cash flow and harnessing the potential of Decentralized Finance. Founded in 2019, we currently have more than ~100 employees of various backgrounds and nationalities and growing.Make sure to follow us here to get our most live jobs https://www.linkedin.com/company/cryptorecruitCryptorecruit are the worlds leading specialist recruiter for the blockchain/Cryptocurrency industry. We recruit positions from CEO,CTO, Project Manager, Solidity developer, frontend and Backend Blockchain developers to marketing/sales and customer service roles. Please browse our website and at www.cryptorecruit.com to search all our job vacancies.",
    "createdOn": "",
    "slug": "recruiter-defi-at-cryptorecruit-3695665632",
    "remote": false,
    "companyId": 38
}