{
    "id": "string(optional)",
    "title": "Strategic Partnerships, Sports & Entertainment",
    "jobType": "Full-time",
    "role": "Business Development and Sales",
    "tags": [
        "Software Development"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "United States",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Mysten Labs believes that decentralized and open protocols are the bedrock of the internet of value. This is why at Mysten Labs, we are creating foundational infrastructure to accelerate the adoption of decentralized protocols based on blockchain technologies.The Partnerships Team is responsible for creating and managing relationships with strategic partners that support Mysten Labs’ ecosystem. We’re looking for a business development professional who will spearhead our Sports and Entertainment initiatives that support Mysten Labs’ growth.What You’ll Do:Strategic Vision: Develop and implement a comprehensive strategy that establishes and expands partnerships with prominent sports and entertainment entities. Partnership Identification: Identify, engage, and foster relationships with key industry players such as sports teams, leagues, entertainment venues, content creators, media outlets, and other influential stakeholders. Cultivate and manage a robust pipeline of compelling partnership opportunities. Negotiation Mastery: Lead intricate negotiations and contract discussions with potential partners, ensuring that the terms are mutually advantageous and align with the strategic objectives of both parties. Skillfully draft and finalize partnership agreements, meticulously addressing critical terms and conditions. Collaboration: Collaborate seamlessly with internal cross-functional teams to conceptualize and execute joint marketing initiatives, co-branded campaigns, and other innovative promotional activities that elevate the Mysten Labs brand within the sports and entertainment sector. What You’ll Have:You are passionate about sports and understand the inner workings of leagues, teams, and entertainment companiesYou are a creative problem solver who embraces change and ambiguity. You know how to navigate within highly regulated and/or ambiguous landscapes. You possess great written and verbal communication skills and highly detail-orientedHigh ethical standardsYou’ve got positive energy. You’re optimistic about the future and determined to get there. You appreciate direct communication. You’re both an active communicator and eager listener - as they both come hand-in-hand. You’re cool with candid feedback and see every setback as an opportunity to grow. You can pivot on the fly. Crypto is constantly evolving, so our priorities do, too. What you worked on last month may not be what you work on today, and that excites you. You’re not looking for a 9-5 job. Our team is remote first and we are hiring across the world. Here at Mysten Labs, you’ll be joining a world-class team with tremendous growth potential as we bring the next billion users to web3. We raised a $300M Series B round from top Silicon Valley led venture funds like Jump Crypto, Andreessen Horowitz (a16z), Binance Labs, Redpoint, Lightspeed, Coinbase Ventures, Electric Capital, Standard Crypto, NFX, Slow Ventures, Scribble Ventures, Samsung Next, Lux Capital, among other investment firms and strategic partners. Come join us and build the future of web3!Compensation Range: $160K - $237K",
    "createdOn": "",
    "slug": "strategic-partnerships-sports-entertainment-at-mysten-labs-3696160286",
    "remote": true,
    "companyId": 27
}