{
    "id": "string(optional)",
    "title": "Strategic Partnerships, Culture & NFTs",
    "jobType": "Full-time",
    "role": "Business Development and Sales",
    "tags": [
        "Software Development"
    ],
    "compensationMin": "",
    "compensationMax": "",
    "location": "United States",
    "applyLink": "",
    "sticky": "",
    "highlight": "",
    "description": "Mysten Labs believes that decentralized and open protocols are the bedrock of the internet of value. This is why at Mysten Labs, we are creating foundational infrastructure to accelerate the adoption of decentralized protocols based on blockchain technologies.The Partnerships Team is responsible for creating and managing relationships with strategic partners that support Mysten Labs’ ecosystem. We’re looking for a business development professional who will spearhead our Culture, Arts, & NFTs initiatives that support Mysten Labs’ growth.What You'll Do:Lead our overall arts & culture strategy for Sui. Partner with NFT Platforms, marketplaces, dApps, and creators to support novel NFT projects. Grow partnerships and develop product offerings with asset issuers, IP holders, creators, artists, and other ecosystem partners and projects. Collaborate and aligning with internal product teams to ensure a comprehensive Arts and Culture strategy. Create systems and processes to drive proactive outreach and identify opportunities and develop relationships. Ensure that product and partnerships materials are always updated and focused for the applicable presentation, conference, or opportunity. Engage new projects to join our various in person and online accelerators and providing support throughout the process of. Source, conduct due diligence, and execute high-value strategic partnerships with NFT tooling providers and studios. Provide a strategic perspective to product and engineering teams, delivering critical business insights that allow us to build a better product. What You'll Have:You speak degen and are passionate about NFTs, its artists and communities. You dream in jpegs and what utility they can unlock. You have a deep understanding of art and culture within Web3. You are active on Twitter, Telegram, and Discord. You are a creative problem solver who embraces change and ambiguity. You know how to navigate within highly regulated and/or ambiguous landscapes. You possess great written and verbal communication skills and highly detail-oriented. High ethical standards. You’ve got positive energy. You’re optimistic about the future and determined to get there. You appreciate direct communication. You’re both an active communicator and eager listener - as they both come hand-in-hand. You’re cool with candid feedback and see every setback as an opportunity to grow. You can pivot on the fly. Crypto is constantly evolving, so our priorities do, too. What you worked on last month may not be what you work on today, and that excites you. You’re not looking for a 9-5 job. You have experience and exposure to the art community. You have prior experience launching NFT communities and working with NFT artists. Travel required for conferences and events. Our team is remote first and we are hiring across the world. Here at Mysten Labs, you’ll be joining a world-class team with tremendous growth potential as we bring the next billion users to web3. We raised a $300M Series B round from top Silicon Valley led venture funds like Jump Crypto, Andreessen Horowitz (a16z), Binance Labs, Redpoint, Lightspeed, Coinbase Ventures, Electric Capital, Standard Crypto, NFX, Slow Ventures, Scribble Ventures, Samsung Next, Lux Capital, among other investment firms and strategic partners. Come join us and build the future of web3!Compensation Range: $120K - $165K",
    "createdOn": "",
    "slug": "strategic-partnerships-culture-nfts-at-mysten-labs-3696164190",
    "remote": true,
    "companyId": 27
}