{
    "id": "string(optional)",
    "title": "Binance Accelerator Program - Angel Program Coordinator",
    "slug": "binance-accelerator-program-angel-program-coordinator-binance",
    "jobType": "Full-time",
    "role": "blockchain",
    "tags": [
        "blockchain",
        "crypto"
    ],
    "compensationMin": 90000,
    "compensationMax": 213000,
    "location": "Anywhere",
    "applyLink": "https://jobs.lever.co/binance/acb6bb6b-8e4f-450a-9444-277c61759b9a/apply?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&lever-origin=applied&lever-source%5B%5D=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Binance Accelerator Program - Angel Program Coordinator Eastern Europe / Marketing – Binance Angels / Full-time: Remote / Remote  Apply for this job  Binance is the global blockchain company behind the world s largest digital asset exchange by trading volume and users, serving a greater mission to accelerate cryptocurrency adoption and increase the freedom of money. Are you looking to be a part of the most influential company in the blockchain industry and contribute to the crypto-currency revolution that is changing the world?   Responsibilities: Innovate and Elevate: Propose improvement plans for the Angel Program and related processes for better efficiency and scalability; Create Engaging Experiences: Lead or support the team in planning and executing Angel activities such as Angel giveaways, content creation activities, online team buildings, AMAs, webinars, and more; Nurture the Angel Community: From onboarding new Angels to orchestrating day-to-day coordination, optimising satisfaction scores, and beyond, you ll play a vital role in the Angel Program s success; Increase Brand Awareness: Elevate the recognition of the Binance Angel Program in fun, creative, and informative ways, such as creating content for the Binance Angel Twitter Account, Binance Blogs, and more; Empowerment and Feedback: Support Angel escalations and provide community feedback to internal teams. Make sure Angels  voices are heard; Resource Management: Improve operational efficiency by maintaining Angel Program related database, documents, tools, files, and other resources; Program Finance and Administration: Coordinate budget applications, reimbursements, swag distributions, Angel certificates, and more; Explore Better Engagement Methods: Test out better ways to engage with the Angels and foster the vibrant Binance communities through Angels.   Requirements: Familiar with the Binance Angel Program and its scope; Strong communication and coordination skills; Solid understanding of the Binance ecosystem and the general crypto market; Exhibit keen attention to detail; Ability to work under pressure in a fast-paced environment; Native-level or fluent English. International background and the ability to speak other languages are great add-ons; Bonus points: Data analytics, graphic design, programming, finance, administration, and content creation.   Apply for this jobWhen applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-18T12:00:00+07:00",
    "companyId": 10
}