{
    "id": "string(optional)",
    "title": "Director Of Marketing",
    "slug": "director-of-marketing-nansen",
    "jobType": "Full-time",
    "role": "cmo",
    "tags": [
        "cmo",
        "executive",
        "marketing",
        "non tech",
        "blockchain"
    ],
    "compensationMin": 60000,
    "compensationMax": 120000,
    "location": "Singapore",
    "applyLink": "https://boards.greenhouse.io/nansen/jobs/4958245004?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&gh_src=web3.career#application_form",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Nansen is a rapidly-growing, innovative crypto analytics company. Our mission is to empowerblockchain professionals and investors with actionable insights and data-driven decision-makingtools. By decoding blockchain data, we enable our clients to uncover hidden opportunities,manage risks, and gain a competitive edge in the constantly evolving world of cryptocurrencies. The Opportunity: We are seeking an experienced and dynamic Director of Marketing to lead our marketing effortsas we continue to scale and reach new heights. The ideal candidate will have a strongunderstanding of the cryptocurrency landscape and a proven track record in building andexecuting marketing strategies that drive growth. This role offers an incredible opportunity toshape and develop Nansen s marketing function in a fast-paced and rapidly evolving industry. Key Responsibilities: Develop and implement a comprehensive marketing strategy that aligns with Nansen overall business objectives, ensuring we maximise visibility, brand awareness, andgrowth within the cryptocurrency and blockchain ecosystem. Lead and manage a globally distributed, high performing and results-driven marketing team, providing guidance and mentorship to help them grow and excel in their roles. Drive a data-driven approach to marketing by setting up effective KPIs andmeasurement systems, regularly reporting on performance and optimising campaigns. Develop a strong understanding of Nansen target audience and customer segments,using this knowledge to create targeted and engaging content across multiple platforms,including blogs, social media, email campaigns, webinars, and more. Collaborate with the Product and Sales teams to develop product messaging andpositioning, ensuring all external communications are clear, consistent, and compelling. Oversee Nansen s digital marketing efforts, including SEO, SEM, social mediaadvertising, and email marketing campaigns, to drive increased web traffic, useracquisition, and conversion rates. Continuously monitor and analyse the competitive landscape, staying abreast of industrytrends and emerging marketing opportunities. Requirements: 10+ years of experience in marketing, with at least 3 years in a leadership role,preferably in the cryptocurrency, blockchain, or fintech industry. Exceptional leadership and management skills, with experience building and leadinghigh-performing teams. A strong understanding of and passion for the cryptocurrency and blockchainEcosystem. Proven track record of developing and executing successful marketing strategies thatdrive growth. Outstanding written and verbal communication skills, with a knack for crafting engagingand compelling content. A data-driven mindset, with the ability to analyse and optimise marketing performancebased on KPIs and metrics. What We Offer: Competitive salary and equity package. Remote work environment with a flexible schedule Opportunity to work in a rapidly growing and cutting-edge industry. Collaborative and supportive company culture Opportunities for personal and professional growth as the company scales. Exposure to a global network of industry experts, partners, and influencers.When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-21T12:00:00+07:00",
    "companyId": 74
}