{
    "id": "string(optional)",
    "title": "Direktor für Projekte und Produkte",
    "slug": "direktor-fur-projekte-und-produkte-zaubar",
    "jobType": "Full-time",
    "role": "",
    "tags": [],
    "compensationMin": null,
    "compensationMax": null,
    "location": "Germany",
    "applyLink": "https://join.com/companies/zaubar/8975267-direktor-fuer-projekte-und-produkte?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "p&amp;gt;Bist du bereit für eine spannende Karriere in der Augmented Reality? /p&amp;gt;  p&amp;gt;ZAUBAR, ein in Berlin ansässiges Unternehmen, das urbane Erfahrungen neu gestaltet, sucht einen engagierten &amp;amp;quot;Hybrid Project &amp;amp;amp; Product Manager&amp;amp;quot; für unsere AR-Produkte. In dieser Rolle übernimmst du die Verantwortung für die Entwicklung unserer Projekte in den Bereichen Web, App, KI und 3D-Kunst. Du brauchst mindestens 5 Jahre Erfahrung in der Produkt- und Projektverwaltung und ein tiefes Verständnis für moderne Projektmanagement-Tools und -Techniken. Bei uns bekommst du eine faire Bezahlung und die Möglichkeit, Teil unseres schnellen Wachstums zu sein. Bist du bereit, die Herausforderung anzunehmen und die Zukunft der Augmented Reality mit uns zu gestalten? Wir freuen uns auf deine Bewerbung! /p&amp;gt;  h2 id= aufgaben &amp;gt;Aufgaben /h2&amp;gt;  ul&amp;gt;  li&amp;gt;Steuere die interne und externe Entwicklung unserer  strong&amp;gt;Web /strong&amp;gt;-,  strong&amp;gt;Unity /strong&amp;gt; und  strong&amp;gt;native /strong&amp;gt;  strong&amp;gt;App /strong&amp;gt;-,  strong&amp;gt;AI /strong&amp;gt;- und  strong&amp;gt;3D-Artwork /strong&amp;gt; Projekte, indem du eine Kombination aus SCRUM und Projektmanagementtechniken verwendest, um unsere erstklassigen AR-Lösungen pünktlich zu liefern. /li&amp;gt;  li&amp;gt;Arbeite Hand in Hand mit verschiedenen Teams zusammen, um die Entwicklung und Einführung unserer AR-Software mit den Zielen unseres Unternehmens und den speziellen Anforderungen unserer  strong&amp;gt;anspruchsvollen Großkunden /strong&amp;gt; abzustimmen. /li&amp;gt;  li&amp;gt;Erstelle detaillierte Pläne und Anforderungen für die Projekte und Produkte unserer AR-Plattform, um eine reibungslose und effiziente Ausführung zu gewährleisten. /li&amp;gt;  li&amp;gt;Pflege  strong&amp;gt;enge Beziehungen zu unseren Kunden /strong&amp;gt;, verstehe die hohen Anforderungen unserer anspruchsvollen und beeindruckenden Großkunden und werbe für die Vorteile unserer AR-Lösungen bei allen Beteiligten. /li&amp;gt;  li&amp;gt;Agierst du  strong&amp;gt;wie ein Art Director /strong&amp;gt; und setzt du dich für höchste ästhetische Qualität in unserer Augmented Reality, UI &amp;amp;amp; UX-Effekten ein. /li&amp;gt;  li&amp;gt;Nutze Analyticsdaten,  strong&amp;gt;Kundenfeedback /strong&amp;gt; und AR- strong&amp;gt;Markttrends /strong&amp;gt;, um unsere Software kontinuierlich zu verbessern. /li&amp;gt;  li&amp;gt;Überwache den Projektumfang, den  strong&amp;gt;Zeitplan /strong&amp;gt;, das Team, das  strong&amp;gt;Budget /strong&amp;gt; und die  strong&amp;gt;Risiken /strong&amp;gt; und halte alle Beteiligten stets auf dem Laufenden. /li&amp;gt;  li&amp;gt;Bleibe auf dem neuesten Stand der Trends in den Bereichen  strong&amp;gt;AR, SaaS und AI /strong&amp;gt;, um die Leistung unseres Produkts, die Effizienz unseres Geschäfts und die Zufriedenheit unserer Kunden zu steigern. /li&amp;gt;  /ul&amp;gt;  p&amp;gt;Bitte beachte, dass wir Wert darauf legen bei dieser Rolle gemeinsam in unserem Büro vor Ort in Berlin zusammen zu arbeiten. Gleichzeitig ist eine hybride Arbeitsweise möglich, so dass du 1-2 Tage pro Woche zuhause in Berlin arbeiten kannst. /p&amp;gt;  h2 id= qualifikation &amp;gt;Qualifikation /h2&amp;gt;  ul&amp;gt;  li&amp;gt; strong&amp;gt;Erfahrung: /strong&amp;gt; Du hast mindestens 5 Jahre Erfahrung in der Produkt- und Projektverwaltung, idealerweise im Tech- oder AR-Bereich. Du hast bereits mehrere Apps auf den Markt gebracht, von denen jede Millionen von Nutzern erreicht hat. /li&amp;gt;  li&amp;gt; strong&amp;gt;Software: /strong&amp;gt; Im Idealfall warst du einige Jahre aktiv Programmierer, besser noch Unity Technical Artist. Falls nicht, solltest du dich in diesem Bereich jedoch auf Expertenniveau auskennen. /li&amp;gt;  li&amp;gt; strong&amp;gt;Bildung: /strong&amp;gt; Du hast einen Abschluss in einem Bereich wie Wirtschaft, Informatik oder Ingenieurwesen. Ein Bonuspunkt, wenn du einen Master oder eine Projektmanagement-Zertifizierung wie PMP oder Scrum Master hast! /li&amp;gt;  li&amp;gt; strong&amp;gt;Technisches Know-how: /strong&amp;gt; Du bist ein Profi in Web-, App-, AI- und 3D-Kunstentwicklung. Du kennst dich mit Projektmanagement-Tools aus und fühlst dich mit SCRUM- und Agile-Methoden zu Hause. /li&amp;gt;  li&amp;gt; strong&amp;gt;Sprachkenntnisse: /strong&amp;gt; Du kannst nicht nur hervorragend auf Englisch kommunizieren, sondern  strong&amp;gt; em&amp;gt;du sprichst und schreibst auch auf muttersprachlichem Niveau /em&amp;gt; /strong&amp;gt;  strong&amp;gt; em&amp;gt;Deutsch /em&amp;gt; /strong&amp;gt;. Das ist ein Muss!Führung: Du bist ein geborener Anführer, fähig, ein vielfältiges Team zu steuern und anspruchsvolle Kunden zufrieden zu stellen. /li&amp;gt;  li&amp;gt; strong&amp;gt;Analytische Fähigkeiten: /strong&amp;gt; Die Interpretation von Metriken, Benutzerfeedback und Markttrends liegt dir im Blut, und du weißt, wie du diese in bessere Produkterfahrungen umsetzen kannst. /li&amp;gt;  li&amp;gt; strong&amp;gt;Kreativität: /strong&amp;gt; Du hast ein scharfes Auge für Design und Detail und setzt dich stets für erstklassige Ästhetik in unseren AR-, UI- &amp;amp;amp; UX-Effekten ein. /li&amp;gt;  li&amp;gt; strong&amp;gt;Trendbeobachter: /strong&amp;gt; Du bist am Puls der Zeit bei AR-, SaaS- und AI-Trends. Du verstehst unser Produkt, unsere Konkurrenz und unsere Kunden. /li&amp;gt;  li&amp;gt; strong&amp;gt;Risikobereitschaft: /strong&amp;gt; Du kannst potenzielle Probleme erkennen und ihnen ausweichen, sodass alle Projekte reibungslos verlaufen und im Budget bleiben. /li&amp;gt;  li&amp;gt; strong&amp;gt;Problemlöser: /strong&amp;gt; Herausforderungen sind dein Spielplatz. Du liebst innovative Lösungen und schnelle Anpassungen in einem schnelllebigen Umfeld. /li&amp;gt;  /ul&amp;gt;  h2 id= benefits &amp;gt;Benefits /h2&amp;gt;  ul&amp;gt;  li&amp;gt;Flache Hierarchien /li&amp;gt;  li&amp;gt;Beträchtliche Eigenkapitalbeteiligung /li&amp;gt;  li&amp;gt;Teamevents (VR, AR Schnitzeljagden, Meetups, Fahrradtouren, Partys) /li&amp;gt;  li&amp;gt;Flexible Arbeitszeiten /li&amp;gt;  li&amp;gt;Home-Office /li&amp;gt;  li&amp;gt;Kaffee- und Tee-Flatrate im Büro /li&amp;gt;  /ul&amp;gt;  p&amp;gt;Bitte bewirb&amp;amp;#39; dich auch mit einem Portfolion von veröffentlichen Produkten, die du als leitender Manager entwickelt hast. /p&amp;gt;When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-07-25T08:31:10+00:00",
    "companyId": 12
}