{
    "id": "string(optional)",
    "title": "FP&amp;A Manager",
    "slug": "fp-a-manager-chainlink",
    "jobType": "Full-time",
    "role": "remote",
    "tags": [
        "remote",
        "aws",
        "blockchain",
        "legal",
        "remote"
    ],
    "compensationMin": 120000,
    "compensationMax": 220000,
    "location": "Anywhere",
    "applyLink": "https://jobs.lever.co/chainlink/ba4bc1fc-574f-45a0-9bb7-16e488302591/apply?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&lever-origin=applied&lever-source%5B%5D=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "FP&amp;amp;A Manager United States / Remote / Finance / Remote - Full-time / Remote  Apply for this job  All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST). We encourage you to apply regardless of your location.   About Us  Chainlink is the industry-standard Web3 services platform that enables developers to build feature-rich Web3 applications with seamless access to real-world data and off-chain computation. • Chainlink has helped enable $8T+ in transaction value since the start of 2022. • Over 1,700 Web3 projects have integrated Chainlink services. • Chainlink is live on 15+ blockchains with many having joined the Chainlink SCALE program. • Chainlink is relied upon by industry-leading protocols like Aave, Compound, Paxos, Synthetix, and ENS. • Chainlink has delivered 7.4B+ data points on-chain and onboarded 900+ decentralized oracle networks. • Chainlink has established collaborations with Associated Press, Accuweather, AWS, Google Cloud, Meta, and Twilio. • The world-class Chainlink Labs research team has won various awards for its work on distributed systems, security, and more. Who we re looking for:  • You re focused on what matters most and ignore unimportant industry distractions.  • You take extreme ownership and deliver outstanding results.  • You have a growth mindset, seek out feedback and engage in constructive dialogue with others to help them grow. • You move fast and evolve with rapidly advancing technologies.  • You want to be part of a team that excels and is committed to building the Chainlink Network and growing the Web3 ecosystem over the long term.  • You are welcoming toward a diverse network of participants joining an open, global standard. • You re excited about the future of Web3 and building a world powered by cryptographic truth.  The Finance team is focused on enabling Chainlink Labs to operate as a financially healthy and responsible business, building for speed and scale while avoiding unnecessary friction. We manage our capital resources carefully, surveying the road ahead to anticipate and prepare for any turn, and ensure the right resources are allocated for maximum returns. We analyze the business and report on key performance indicators, partner closely with other teams across the company, and ensure that we drive the right business outcomes, proper compliance, and accountability. We are seeking a highly experienced FP&amp;amp;A Manager to join our team and play a critical role in driving financial planning and analysis activities. In this senior-level position, you will collaborate closely with department leaders, the Finance team, and the Data team. Your primary responsibilities will include providing strategic support in financial planning, ensuring accountability among business leaders, and leading the development of robust financial models, forecasts, and reports. The ideal candidate for this senior role will possess a strong background in finance, accounting, and data analysis, along with exceptional numerical and interpersonal skills. You should demonstrate a willingness to expand your knowledge within the blockchain industry and leverage your problem-solving abilities and experience in communicating business insights to advise senior stakeholders on key cost-related decisions. This is an exceptional opportunity to join our dynamic team and contribute to the rapidly evolving and exciting field of blockchain technology. Candidates located in time zones between US Pacific Time and US Eastern Time are preferred.   Objectives of this Role: Deliver consistent, timely, accurate, high-quality, and insightful financial data to department leads and the executive team. Prepare comprehensive current and forecasted cost projections for all areas of the business. Collaborate effectively with the accounting team to ensure seamless alignment of financial data. Develop and rigorously test financial models for new products, assisting the business in making critical decisions. Drive the strategic growth of the FP&amp;amp;A function, with a focus on scalability and process automation. Respond to ad-hoc modeling requests from various business units.   Skills &amp;amp; Qualifications: 5+ years of experience in FP&amp;amp;A or a related field (e.g., investment banking, management consulting) at a senior level. Advanced Excel skills and a strong willingness to acquire proficiency in additional financial tools. Excellent communication skills, including extensive experience in managing Director-level or equivalent stakeholders. Ability to thrive under pressure, meet tight deadlines, and maintain a high level of accuracy and attention to detail. Genuine passion for the blockchain industry and a strong desire to expand your knowledge of cryptocurrency data and analytics. Adaptable approach to working in a startup environment. Bachelor s degree in finance, accounting, economics, or a related field.   Preferred Qualifications: Familiarity with business intelligence (BI) tools and experience with financial modeling tools. CFA and/or CPA certification.   Privacy Policy and an Equal Opportunity Employer:  Chainlink Labs is an Equal Opportunity Employer. To request an accommodation in our recruitment process, please contact us at people@smartcontract.com. Please see our Privacy Policy for more information about how we collect and use your application information.   Apply for this jobWhen applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-18T12:00:00+07:00",
    "companyId": 11
}