{
    "id": "string(optional)",
    "title": "Head of Cybersecurity",
    "slug": "head-of-cybersecurity-coinclan-ou",
    "jobType": "Full-time",
    "role": "executive",
    "tags": [
        "executive",
        "remote",
        "blockchain",
        "crypto",
        "dev"
    ],
    "compensationMin": 10000.0,
    "compensationMax": 10000.0,
    "location": "Anywhere",
    "applyLink": "https://web3.career/head-of-cybersecurity-coinclan-ou/54694",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Company Introduction: CoinClan is a licensed &amp;amp; regulated cryptocurrency exchange company. We are currently operating in Australia, the EU, the UK, Canada &amp;amp; Thailand. We trade on major crypto P2P platforms such as Binance P2P, and we are the largest crypto P2P merchant/liquidity provider in all of the countries and on all of the P2P platforms where we advertise and trade. We have longer-term plans to build our own platform. We are also now looking to expand our business to several other countries, such as Hong Kong, Taiwan, Indonesia, Brazil, Mexico, the US, Turkey &amp;amp; more. Our vision is to make crypto access seamless, for anyone, anywhere in the world.  Job Description : • Assess all of the current cybersecurity processes and propose improvements to have the highest overall cybersecurity standards against both external and internal hacks, fraud, or theft. • Design code review and deployment processes to enhance our cybersecurity • Work with securing our company equipment and any other hardware and software, including physical security. • Work with our product team to propose the security requirements for any product designed before launch. • Provide cybersecurity consultation on multiple IT platforms  • Be in charge of the overall cybersecurity design for the whole organization, especially any part that handles any money/crypto movements, and design it to the highest standards - the same standard that Binance &amp;amp; Coinbase uses. • Experience in implementing cybersecurity protection frameworks such as ISO27001, Zero-Trust etc - not just a single product  • As this is a senior role, you may hire and lead others to help you perform any of the above.  Requirements: • Bachelor s degree or equivalent trading skills &amp;amp; experience(2 years of crypto experience OR 2 years of experience in B2C Fintech, blockchain, or other global technology companies(such as Google, Facebook, Airbnb, etc), or trading firms(such as Goldman Sachs). • At least 5 years of working experience in cybersecurity. • Willing to be on standby and generally responsive to urgent security issues even it falls on weekends and nights (only if there is a major threat or critical situation)  • Have a clear understanding of cybersecurity in crypto. • Ability to work well in an unstructured, fast-paced environment as we are a start-up • Able to commit &amp;amp; deliver to the highest standards • Can speak and read Chinese Why work with us? • Do something meaningful - Be part of a company that s building the digital infrastructure to allow universal access to the future economy enabled by blockchain technology. • Competitive salary paid in any currency or cryptocurrency of your choosing (including equity so you can capitalize on the exponential growth of our startup with the possibility to achieve financial freedom). • Fast-paced, challenging, faced with different issues every day - Life never gets boring in a start-up environment. • Work with an international company &amp;amp; team - we currently have team members across 12 different countries! • Great career development opportunities in a fast-growing company. • Work remotely from anywhere in the world with flexible working hours &amp;amp; casual work attire.When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-18T15:47:27+07:00",
    "companyId": 5
}