{
    "id": "string(optional)",
    "title": "Lead Software Engineer (Blockchain)",
    "slug": "lead-software-engineer-blockchain-cere-network",
    "jobType": "Full-time",
    "role": "dev",
    "tags": [
        "dev",
        "lead",
        "blockchain",
        "golang",
        "javascript"
    ],
    "compensationMin": 80000,
    "compensationMax": 130000,
    "location": "Anywhere",
    "applyLink": "https://jobs.lever.co/cere-network/dbbaa563-351a-4e6a-a2bf-e5866c5fecb0?lever-origin=applied&lever-source%5B%5D=WEB%23%20Europe/apply&utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&lever-origin=applied&lever-source%5B%5D=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Do you self-identify as a great multi-tasker? Have you been yearning for more complex challenges? Does the opportunity to play a supporting role in the launch of a software platform with massive impact (for millions or even billions of people) excite you? If you ve answered with 3 resounding yeses, then we want to meet you! What We Expect We are a cutting-edge web3 infrastructure scale-up project seeking a few very talented developers who are not just looking for a job but want to be challenged to accomplish great things in an exciting venture.   We are the veterans of many successful startups and will put you on the accelerated learning curve toward your future success.  This position requires a great understanding of large-scale distributed computing, web3 technologies and experience managing large scaling infrastructure, blockchain, and smart contracts. Yet, we are open to talented people with less experience in web3 but have experience building large, robust data solutions and are eager to grow into web3.   As a Lead Software Engineer, you will play a pivotal role in driving engineering excellence, managing projects, mentoring team members, and ensuring the smooth execution of deliverables. Your expertise in software development, tools development, and management will be instrumental in our success.  About Cere Network Cere Network is the decentralized data protocol powering the future of web3 with trustless content sharing and cloud data interactions between apps, users, AI/ML, and (NFT) assets. Cere is backed by the world s largest institutions and projects, including Binance Labs, Republic Labs, and Polygon.  Our Ethos We look for a few things across all hires we make at Cere, regardless of role or team:  - We seek teammates who will thrive in our fast-paced work environment, where we default to methodical, simulation-driven, fast development iterations and a first-principle thinking mindset.  - We crave teammates with high standards and strong discipline, embracing a growth mindset to continuously learn and incrementally improve habits and processes.  - We require contributors to have excellent communication skills (esp. written), for everything must be well organized and tracked in Notion, Slack, Wiki s, etc. We want autonomous, goal-oriented individuals who embrace transparency and accountability. No one wants to micro-manage others. - We need good teammates who are generally cool people who want to be part of a great team &amp;amp; decentralized community where everyone truly helps and challenges each other to learn/grow by innovating together towards greater shared goals. Embracing the building of such a collaborative community is the only way we can sustain rapid innovation (and the only way to live/work, really).  Responsibilities: - Lead the development and improvement of engineering practices, processes, and tools to enhance productivity and efficiency. - Drive development and contribute to continuous improvements in coding standards, performance, and scalability. - Oversee network operations, ensuring stable and secure infrastructure for our applications. - Manage incidents and troubleshoot technical issues, providing timely resolutions to minimize downtime and disruptions. - Provide project management expertise, overseeing sprint planning, roadmaps, and deliverables execution. - Collaborate with cross-functional teams to ensure alignment and successful project outcomes. - Prepare and deliver regular reports on project progress and achievements. - Mentor and guide team members, creating career development plans and conducting regular 1-1s to support their growth. - Lead the onboarding process for new team members, ensuring a smooth integration into the team. - Facilitate communication and collaboration with cross-functional teams, including DevOps, HR, DDC, and S&amp;amp;T departments. - Engage with the EDP community in Discord, sharing knowledge, contributing to discussions, and promoting a positive team culture.  Requirements: - Bachelor s degree in Computer Science, Engineering, or a related field. - Proven experience as a Lead Software Engineer or similar role, with a strong software development and project management background. - Experience with Substrate or other Blockchain frameworks. - Solid understanding of blockchain technology, decentralized systems, and distributed ledger protocols. - In-depth knowledge of blockchain consensus algorithms, cryptographic principles, and security best practices. - Experience in optimizing the performance and scalability of blockchain systems. - Strong problem-solving skills and ability to architect and design complex software systems. - Excellent communication and leadership skills, with the ability to mentor and guide team members. - Prior experience working in agile development methodologies. - Familiarity with other blockchain platforms and protocols is a plus.  Tech stack:  - JS/TypeScript - Rust - Express/NestJS  - React/Vue  - PostgreSQL  - AWS Nice to have:  - GO   A bit more about our Multinational, High-Performance (and primarily remote) Team Join a highly talented multicultural team that is based all over the world. We have offices in San Francisco, New York, Warsaw, Amsterdam, Berlin, and several locations in Asia. As stated above, we make remote working possible by embracing our ethos, yet many teams also travel to meet in person every 1-2 months. We all want high degrees of autonomy and flexibility to make life and work fun, but transparency, accountability/ownership are the requisites.When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-20T23:50:01+07:00",
    "companyId": 4
}