{
    "id": "string(optional)",
    "title": "Managing Director/Partner",
    "slug": "managing-director-partner-theflowerscompany",
    "jobType": "Full-time",
    "role": "executive",
    "tags": [
        "executive",
        "blockchain"
    ],
    "compensationMin": 452629.0,
    "compensationMax": 536809.0,
    "location": "United States",
    "applyLink": "https://www.linkedin.com/jobs/view/managing-director-partner-at-the-flowers-company-3698230441?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "p&amp;gt;Seeking  /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt;About the job /strong&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt;&amp;amp;nbsp; /strong&amp;gt; /p&amp;gt; p&amp;gt;Reports to: Chairman &amp;amp;amp; Managing Partner /p&amp;gt; p&amp;gt;Date: August 2023 /p&amp;gt; p&amp;gt; strong&amp;gt;&amp;amp;nbsp; /strong&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt;&amp;amp;nbsp; /strong&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt;If you are someone who: /strong&amp;gt; /p&amp;gt; p&amp;gt;·&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;Desires an autonomous work environment /p&amp;gt; p&amp;gt;·&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;Wants your input and recommendations to be highly valued and respected /p&amp;gt; p&amp;gt;·&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;Believes that with the right culture, you have the potential to be great. /p&amp;gt; p&amp;gt;·&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;Desires to participate in the upside /p&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; p&amp;gt;Keep reading, it only gets better (read carefully) /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt; u&amp;gt;Company Background /u&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt;&amp;amp;nbsp; /strong&amp;gt; /p&amp;gt; p&amp;gt;Flowers Equity Partners Management, LLC (FEP) is a subsidiary of The Flowers Company, LLC, specializing in alternative investments. FEP has made notable investments and exits in Blockchain technology, Web3, Real Estate, Cannabis, and FX trading assets since 2020. Our core values of Integrity, Passion for Excellence, Accountability, Teamwork, and Entrepreneurship guide us as an organization and an employer. /p&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; p&amp;gt; strong&amp;gt; u&amp;gt;Summary /u&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt;We want to partner with a candidate who feels their potential is untapped and desires to build something significant. If you re only seeking a paycheck, this isn t it. We are mission-focused. The Managing Director role is a Partner-track, senior level position within the firm. Leveraging multiple years of private equity investing and value creation experience, an MD will manage and help drive Flowers  efforts across the investment life cycle, including investment thesis generation, deal sourcing, deal execution, debt, and equity capital raising, portfolio management, and exit of portfolio investments. Additionally, the MD will further expand the firm s reach by building trust-based relationships with key parties (e.g., investors, bankers, portfolio company executives, investment targets, advisors, and limited partners) while serving as a trusted partner to the firm s senior leaders. /p&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; p&amp;gt;The ideal candidate for this position is a self-starter with experience raising capital from accredited, high-net-worth individuals and family offices. Flowers seeks a hardworking individual with strong financial and interpersonal skills to recruit investors for FEP s projects and maintain investor relationships. /p&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt; u&amp;gt;Responsibilities (please read carefully) /u&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt;&amp;amp;nbsp; /strong&amp;gt; /p&amp;gt; p&amp;gt;The focus of this position is to aid in developing, strengthening, and expanding Flowers Equity Partners Management as a world-class investment firm globally. The successful candidate will be responsible for the following: /p&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; ul&amp;gt; li&amp;gt;Develop trust-based counseling relationships with portfolio executives and senior leadership /li&amp;gt; li&amp;gt;Monitor performance and risk profile of existing portfolio investments /li&amp;gt; li&amp;gt;Key participant in preparing and presenting deal information, by stage, to the investment committee /li&amp;gt; li&amp;gt;Create and maintain deal flow databases by identifying potential targets and preparing company-specific due diligence reports and analysis /li&amp;gt; li&amp;gt;Conduct market and industry research while qualifying investment opportunities and providing rolling updates /li&amp;gt; li&amp;gt;Mentor and train analysts and associates /li&amp;gt; li&amp;gt;Stay informed on capital market dynamics, provide appropriate information for disclosure, keep tracking policies and regulatory compliances /li&amp;gt; li&amp;gt;Engage, prepare, and participate in board meetings of Portfolio Companies /li&amp;gt; li&amp;gt;Profile investment themes and approaches and take a leading role in the research and analysis of prospective investments /li&amp;gt; li&amp;gt;Lead and oversee critical functions of a transaction, including financial modeling, investor presentations, due diligence frameworks (financial, legal, operations, insurance, benefits, IT, and HR), and lender presentations /li&amp;gt; li&amp;gt;Coordinate the execution of investment transactions across all parties involved (e.g., legal counsel, third-party diligence providers, investors, internal operations, and portfolio company management) /li&amp;gt; li&amp;gt;Assist in negotiations with potential partners including, but not limited to, letters of intent, purchase agreements, credit agreements, and executive employment agreements /li&amp;gt; li&amp;gt;Develop trust-based counseling relationships with portfolio executives /li&amp;gt; li&amp;gt;Monitor performance and risk profile of existing portfolio investments /li&amp;gt; li&amp;gt;Key participant in recruiting, preparing, and presenting deal information, by stage, to the investment committee /li&amp;gt; li&amp;gt;Create and maintain deal flow databases by identifying potential targets and preparing company-specific due diligence reports and analysis /li&amp;gt; li&amp;gt;Conduct market and industry research while qualifying investment opportunities and providing rolling updates /li&amp;gt; li&amp;gt;Recruit, mentor, and train analysts and associates /li&amp;gt; li&amp;gt;Stay informed on capital market dynamics, provide appropriate information for disclosure, keep tracking policies and regulatory compliances /li&amp;gt; li&amp;gt;Engage, prepare, and participate in board meetings of Portfolio Companies /li&amp;gt; li&amp;gt;Ensure the maintenance of ongoing relationships with external investors and partners /li&amp;gt; li&amp;gt;Capital raising, investor identification, and solicitation; establishing initial dialogues; preparing targeted/investor-specific presentation materials; coordinating fundraising and creating detailed diligence follow-up meetings. /li&amp;gt; /ul&amp;gt; p&amp;gt;·&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;Build, establish, and cultivate investor relationships with investors and their managers/advisors, intending to attract capital for various investment opportunities. The focus should be on family offices, high-net-worth and accredited investors, etc. /p&amp;gt; p&amp;gt;·&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;Effectively articulate the investment philosophy and strategy to potential and existing investors. /p&amp;gt; ul&amp;gt; li&amp;gt;Market new opportunities; obtain capital commitments; solicit for new business via telephone, networking, and other lead sources /li&amp;gt; /ul&amp;gt; p&amp;gt;·&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;&amp;amp;nbsp;Work with the Chairman to develop a multi-year capital raise plan with specific goals, objectives, strategies, and tactics. /p&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; p&amp;gt; strong&amp;gt; u&amp;gt;Qualifications /u&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; ul&amp;gt; li&amp;gt;Undergraduate degree in finance, accounting, or economics (or related work experience) /li&amp;gt; li&amp;gt;An MBA or related degree is a plus but not required /li&amp;gt; li&amp;gt;10+ years of experience in family office investment management or private equity business /li&amp;gt; li&amp;gt;Real Estate Asset Investment knowledge is important /li&amp;gt; li&amp;gt;Appetite to become a subject matter expert in broad and diverse industries /li&amp;gt; li&amp;gt;A proactive, highly motivated, and self-assured approach to business leadership and development, with a team-based belief system /li&amp;gt; li&amp;gt;Extraordinary leadership skills /li&amp;gt; li&amp;gt;A culture-add to a high-performance lifestyle culture /li&amp;gt; li&amp;gt;Outstanding financial modeling and analytical skills /li&amp;gt; li&amp;gt;Strong understanding of accounting, finance, and capital structure /li&amp;gt; li&amp;gt;Strong character, ethics, and integrity /li&amp;gt; /ul&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; p&amp;gt; strong&amp;gt; u&amp;gt;Compensation /u&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt;&amp;amp;nbsp; /p&amp;gt; p&amp;gt; strong&amp;gt;Pay for Performance /strong&amp;gt; to start (120-day period). Targeted compensation range:  strong&amp;gt;$452,629 -$536,809+ Benefits package /strong&amp;gt;. Total compensation may vary based on several factors, including, but not limited to, each candidate s qualifications, skills, agreed terms, bonuses, carried interest, and overall competencies. /p&amp;gt;When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-19T22:22:03+00:00",
    "companyId": 14
}