{
    "id": "string(optional)",
    "title": "Marketing Designer",
    "slug": "marketing-designer-huddle01",
    "jobType": "Full-time",
    "role": "design",
    "tags": [
        "design",
        "non tech",
        "marketing",
        "remote",
        "stats"
    ],
    "compensationMin": null,
    "compensationMax": null,
    "location": "Anywhere",
    "applyLink": "https://boards.greenhouse.io/huddle01/jobs/4065342007?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&gh_src=web3.career#application_form",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "About the Role: We are seeking a talented and creative Marketing Designer to join our Comms team at Huddle01. As a Marketing Designer, you will play a crucial role in shaping the visual identity of our products and brand. You will collaborate closely with cross-functional teams to create captivating visual experiences that resonate with our users and align with our company s vision. Key Responsibilities: Create visually stunning designs for our products, including web and mobile applications, infra, and networks for all social media channels, blogs, newsletters, and other marketing assets. Develop and maintain a consistent visual language for different programs and events and make sure it matches our brand guidelines and enhances the overall experience. Collaborate with product manager, UX designer, and developers to understand project requirements and translate them into engaging visual designs. Produce high-quality graphics, icons, illustrations, and other visual assets that elevate the usability and aesthetics of our products. Iterate on designs based on feedback and analytics, ensuring continuous improvement and innovation. Conduct research on design trends, user preferences, and competitor analysis to inform and inspire your design decisions. Participate in brainstorming sessions to provide ideas on how to consistently improve the brand. Help maintain and evolve our design system, contributing to the consistency and scalability of our design assets. Stay up-to-date with industry developments, design tools, and best practices to drive design excellence within the company. Qualifications: Bachelor s degree in Graphic Design, Visual Communication, or a related field. Proven experience as a Marketing Designer, preferably in a technology or SaaS environment. Proficiency in industry-standard design tools such as Adobe Creative Suite (Photoshop, Illustrator, XD) and familiarity with prototyping tools. Strong portfolio showcasing a range of visual design work, including user interfaces, icons, illustrations, and branding projects. Solid understanding of user-centered design principles and the ability to translate user needs into compelling visual solutions. Excellent eye for detail, color theory, and typography. If you are passionate about leading the marketing design and want to work in a dynamic and fast-paced environment, apply for this role today. Compensation As per your experience and industry standards. Alternatively, mail your resume/porfolio/social handles at parnika@huddle01.comWhen applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-21T12:00:00+07:00",
    "companyId": 8
}