{
    "id": "string(optional)",
    "title": "Product Director, Operations Platform",
    "slug": "product-director-operations-platform-okx",
    "jobType": "Full-time",
    "role": "executive",
    "tags": [
        "executive",
        "operations",
        "blockchain",
        "crypto"
    ],
    "compensationMin": 184100,
    "compensationMax": 265000,
    "location": "Singapore",
    "applyLink": "https://boards.greenhouse.io/okx/jobs/5719556003?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&gh_src=web3.career#application_form",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Who We Are At OKX, we believe our future is reshaped with technology. As one of the world s leading cryptocurrency spot and derivatives exchanges, OKX uses innovative blockchain technology to redefine the financial ecosystem. With millions of global users and an array of diverse and sophisticated products, solutions, and trading tools, we strive to empower everyone to explore the world of crypto. About the team: Our team is composed of highly talented individuals who bring expertise from top internet companies and cryptocurrency firms. We have carefully selected professionals who possess a deep understanding of operations platform &amp;amp; promotional campaigns with  a track record of success in their respective fields. The team s diverse backgrounds and experiences enable us to approach operations platform and tools with a wealth of knowledge and a strong focus on delivering exceptional user experiences. We foster a collaborative environment where innovation, creativity, and continuous learning are valued. Together, we work towards driving growth and shaping the future of the cryptocurrency industry through impactful promotional initiatives. What You ll Be Doing:   Provide strategic direction and leadership for the product roadmap of operation platform initiatives, ensuring alignment with business goals and stakeholder requirements.  Responsible for the collection of requirements of the platform, optimize or reinvent internal best practice by collecting and analyzing problems in business implementation.  Design rating mechanism for partners with multiple roles (Affiliates, Copy traders, ...) on the Operation Platform, to motivate platform partners and guide them to offer a better service to users. Establish monitoring index system, conduct data traction, and be responsible for improving product penetration and satisfaction.  Responsible for training to promote platform new features to help local markets follow the designed workflow, and improve the performance and satisfaction of the platform.  Promote continuous development through communication and cooperation with the relevant PMs, local markets, R&amp;amp;D team, and algorithm team. Pay attention to the efficiency and optimization of each module.  Responsible for the design of internal communication system to improve information transparency and efficiency.  Ability to understand the business in depth according to the complex business environment, propose creative problem-solving ideas and methods, and effectively solve difficult problems.   What We Look For In You:  Bachelor s degree or above, 5 years of experience in a related role.  Excellent communication ability, strong project management ability, and project coordination ability, able to cooperate with multiple teams to complete the set of work goals.  Strong logical and structural thinking, ability to work under pressure and manage deadlines.  Self-motivated, independent, and capable of taking ownership of projects.  Good internal platform product sense, fast learner, can independently promote training and requirements collection.  Experience leading and managing cross-functional teams, with excellent stakeholder management skills.  Open to exploring new and innovative projects to drive product growth.  Excellent communication skills, both written and verbal, with the ability to influence and present ideas.  Nice to Haves:    Experience in the cryptocurrency or blockchain industry, with a strong understanding of crypto trading and market dynamics.  Familiarity with regulatory frameworks and compliance requirements in different regions related to cryptocurrencies and promotional campaigns.  Proficiency in data analytics tools and techniques, to derive insights and make data-driven decisions.  Experience in Artificial Intelligence (AI)    Perks &amp;amp; Benefits Competitive total compensation Comprehensive insurance coverage for employees and their dependants More that we love to tell you along the process!When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-21T12:00:00+07:00",
    "companyId": 6
}