{
    "id": "string(optional)",
    "title": "Senior Product Strategy Manager, Growth",
    "slug": "senior-product-strategy-manager-growth-okx",
    "jobType": "Full-time",
    "role": "growth",
    "tags": [
        "growth",
        "strategy",
        "non tech",
        "senior",
        "blockchain"
    ],
    "compensationMin": 152100,
    "compensationMax": 185900,
    "location": "Singapore",
    "applyLink": "https://boards.greenhouse.io/okx/jobs/5719549003?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&gh_src=web3.career#application_form",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Who We Are At OKX, we believe our future is reshaped with technology. As one of the world s leading cryptocurrency spot and derivatives exchanges, OKX uses innovative blockchain technology to redefine the financial ecosystem. With millions of global users and an array of diverse and sophisticated products, solutions, and trading tools, we strive to empower everyone to explore the world of crypto.  What You ll Be Doing:  Manage the overall growth strategy, operation, and optimisation of our user persona, business value score, and product optimisation.  Design rating mechanism for partners with multiple roles (Affiliates, Copy traders, ...) on the OKX platform, to motivate platform partners and guide them to offer a better service to users. Establish monitoring index system, conduct data traction, and be responsible for improving product penetration and satisfaction.  Develop different operation strategies based on international scenarios and different user characteristics to improve user trading satisfaction and efficiency of the platform.  Discover the essential needs of users and be good at empathy, solve user pain points, promote cross-departmental cooperation, and coordinate all partners to achieve goals together.  Collaborate with cross-functional teams including local market, design, engineering, and data analysis to conceptualize and execute effective campaign features and tools.  Conduct in-depth data analysis to measure the impact of campaigns, test hypotheses, and derive actionable insights to drive product improvements.  Stay informed about industry trends, competitor activities, and user feedback to identify opportunities for innovation and improvement.    What We Look For In You:  Bachelor s degree or above, 3 to 5 years working experience in growth strategy.  Relevant experience in recommendation, user strategy, channel gameplay, content interaction and other products is preferred.  Highly data sensitive, quick discoverer in data insights and able to locate the cause, give a solution, and verify the result.  Be able to identify problems and promote upstream and downstream teams, coordinate relevant resources and make rational use of them.  Experience in influencer and MCNs business, and international product projects is preferred.    Nice to Have:  Experience in the cryptocurrency or blockchain industry, with a strong understanding of crypto trading and market dynamics.  Familiarity with regulatory frameworks and compliance requirements in different regions related to cryptocurrencies and promotional campaigns.  Perks &amp;amp; Benefits:  Competitive total compensation  Comprehensive insurance coverage for employees and their dependants  More that we love to tell you along the process!When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-21T12:00:00+07:00",
    "companyId": 6
}