{
    "id": "string(optional)",
    "title": "Senior Product Manager (Pay)",
    "slug": "senior-product-manager-pay-crypto-com",
    "jobType": "Full-time",
    "role": "product manager",
    "tags": [
        "product manager",
        "non tech",
        "senior",
        "crypto",
        "product manager"
    ],
    "compensationMin": 60000,
    "compensationMax": 90000,
    "location": "Hong Kong",
    "applyLink": "https://jobs.lever.co/crypto/1171bd01-4991-473e-b027-05f662956d9c/apply?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&lever-origin=applied&lever-source%5B%5D=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Senior Product Manager (Pay) Hong Kong, Hong Kong SAR / Product – Product Management / Full-time / Hybrid  Apply for this job  Our Product Management team drives product initiatives from inception through execution, makes impacts and launches products/features across our global footprint. We collaborate closely with engineers, designers, analysts, marketers, and other cross-functional team members to ship remarkable features and products. We are looking for Senior Product Managers to drive product initiatives from inception through execution. This is a unique opportunity for someone with vision to architect and manage an industry-changing platform that helps change the way we deal with money. You will be able to drive impact and launch products/features across our global footprint. You will collaborate closely with engineers, designers, analysts, marketers, and other cross-functional team members to ship remarkable features and products.   Job Responsibilities Create and maintain the team s roadmap, milestones, and dependencies with strategic priorities in mind Define features, write product specifications, facilitate user studies, iterate on feedback, help write test plans with QA, manage the backlog, and ultimately ship products/features in a timely manner Interview and interact with customers to build empathy, ensuring that their needs are met Prioritize initiatives and projects appropriately and weigh tradeoffs that must be made Perform market research and analysis Represent the team in communication with cross-functional teams Manage specific features within a product line; nurture and lead Associate Product Managers   Requirements A data-informed work style, viewed through a compassionate lens of the user A passion for building delightful customer-facing products and experiences Experience shipping and iterating on successful Software or Financial products at scale Demonstrated leadership, taking initiative and producing results The ability to collaborate well with designers, engineers, QA, Marketing, compliance, growth Bachelor s degree or equivalent experience Bring humility to your work and how you work with others At least 5 years of work experience in product management, with domain knowledge in payment is a plus    Life @ Crypto.com   Empowered to think big. Try new opportunities while working with a talented, ambitious and supportive team. Transformational and proactive working environment. Elevate employees to find thoughtful and innovative solutions. Growth from within. We help to develop new skill-sets that would impact the shaping of your personal and professional growth. Work Culture. Our colleagues are some of the best in the industry; we are all here to help and support one another. One cohesive team. Engage stakeholders to achieve our ultimate goal - Cryptocurrency in every wallet.      Are you ready to kickstart your future with us?    Benefits   Competitive salary  Medical insurance package with extended coverage to dependents  Attractive annual leave entitlement including: birthday, work anniversary Work Flexibility Adoption. Flexi-work hour and hybrid or remote set-up Aspire career alternatives through us. Our internal mobility program can offer employees a diverse scope.   Work Perks: crypto.com visa card provided upon joining    Our Crypto.com benefits packages vary depending on region requirements, you can learn more from our talent acquisition team.   About Crypto.com:   Founded in 2016, Crypto.com serves more than 80 million customers and is the world s fastest growing global cryptocurrency platform. Our vision is simple: Cryptocurrency in Every Wallet™. Built on a foundation of security, privacy, and compliance, Crypto.com is committed to accelerating the adoption of cryptocurrency through innovation and empowering the next generation of builders, creators, and entrepreneurs to develop a fairer and more equitable digital ecosystem.   Learn more at https://crypto.com.    Crypto.com is an equal opportunities employer and we are committed to creating an environment where opportunities are presented to everyone in a fair and transparent way. Crypto.com values diversity and inclusion, seeking candidates with a variety of backgrounds, perspectives, and skills that complement and strengthen our team.   Personal data provided by applicants will be used for recruitment purposes only.   Please note that only shortlisted candidates will be contacted.  Apply for this jobWhen applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-21T12:00:00+07:00",
    "companyId": 7
}