{
    "id": "string(optional)",
    "title": "Senior/Lead Golang Engineer",
    "slug": "senior-lead-golang-engineer-cere-network",
    "jobType": "Full-time",
    "role": "dev",
    "tags": [
        "dev",
        "golang",
        "lead",
        "senior",
        "blockchain"
    ],
    "compensationMin": 95000,
    "compensationMax": 200000,
    "location": "Anywhere",
    "applyLink": "https://jobs.lever.co/cere-network/491a64e4-e4d3-457d-8355-89dd1c681137?lever-origin=applied&lever-source%5B%5D=Web3JobsEurope/apply&utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&lever-origin=applied&lever-source%5B%5D=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Do you self-identify as a great problem solver? Have you been honing your innovation craft for years yet yearning for more complex challenges? Does the opportunity to play a key role in the launch of a software platform with massive impact (for millions or even billions of people) excite you? If you ve answered with 3 resounding yeses, then we want to meet you!   What We Expect We are a cutting-edge web3 infrastructure scale-up project seeking a few very talented developers who are not just looking for a job but want to be challenged to accomplish great things in an exciting venture.  We are the veterans of many successful startups and will put you on the accelerated learning curve toward your future success. We are looking for an experienced Senior/Lead Golang Engineer who has designed, built, and operated high-throughput, highly resilient distributed data systems. This is a rare opportunity to work with a number of talented innovators on building a protocol that can change the data cloud landscape, e.g. decentralizing big data.  This core systems development position will challenge you to drive the design and development of significant system software components with a highly collaborative, test-driven, and rapid prototyping approach. In addition, you will definitely need to build upon your previous innovation and operational experience with highly scalable distributed systems that provide availability, reliability, and performance guarantees. About Cere Network Cere Network is the decentralized data protocol powering the future of web3 with trustless content sharing and cloud data interactions between apps, users, AI/ML, and (NFT) assets. Cere is backed by the world s largest institutions and projects, including Binance Labs, Republic Labs, and Polygon. Our Ethos We look for a few things across all hires we make at Cere, regardless of role or team:  - We seek teammates who will thrive in our fast-paced work environment, where we default to methodical, simulation-driven, fast development iterations and a first-principle thinking mindset.  - We crave teammates with high standards and strong discipline, embracing a growth mindset to learn and incrementally improve habits and processes continuously.  - We require contributors to have excellent communication skills (esp. written), for everything must be well organized and tracked in Notion, Slack, Wiki s, etc. We want autonomous, goal-oriented individuals who embrace transparency and accountability. No one wants to micro-manage others. - We need good teammates who are generally cool people who want to be part of a great team &amp;amp; decentralized community where everyone truly helps and challenges each other to learn/grow by innovating together towards greater shared goals. Embracing the building of such a collaborative community is the only way we can sustain rapid innovation (and the only way to live/work, really). Requirements: - 5+ years of extensive programming experience with Golang. - Deep understanding of system design, data structures, and algorithms. - Experience with concurrency, transactions and parallel execution. - Experience with cryptography (encryption and signatures). - Systematic problem-solving approach coupled with effective communication skills. Nice to have: - Experience with distributed databases and/or storage systems. - Database engine internals (storage): indexing, access methods, concurrency control, logging, caching, transaction processing, replication, backup restore, and buffer management. - Database engine internals (query processing): query compilation, optimization, execution, parallel execution. - Distributed systems: consensus-based quorum replication, peering networks system implementation.  A bit more about our Multinational, High-Performance (and primarily remote) Team Join a highly talented multicultural team that is based all over the world. We have offices in San Francisco, New York, Warsaw, Amsterdam, Berlin, and several locations in Asia. As stated above, we make remote working possible by embracing our ethos, yet many teams also travel to meet in person every 1-2 months. We all want high degrees of autonomy and flexibility to make life and work fun, but transparency, accountability/ownership are the requisites.When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-06-21T17:25:00+07:00",
    "companyId": 4
}