{
    "id": "string(optional)",
    "title": "Senior Full Stack Software Engineer",
    "slug": "senior-full-stack-software-engineer-ripple",
    "jobType": "Full-time",
    "role": "dev",
    "tags": [
        "dev",
        "full stack",
        "senior",
        "aws",
        "blockchain"
    ],
    "compensationMin": 100000,
    "compensationMax": 206000,
    "location": "United Kingdom",
    "applyLink": "https://ripple.com/careers/all-jobs/job/5304774?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "At Ripple, we re building a world where value moves like information does today. It s big, it s bold, and we re already doing it. Through our crypto solutions for financial institutions, businesses, governments and developers, we are improving the global financial system and creating greater economic fairness and opportunity for more people, in more places around the world. And we get to do the best work of our career and grow our skills surrounded by colleagues who have our backs.  If you re ready to see your impact and unlock incredible career growth opportunities, join us, and build real world value.   Senior Full Stack Software Engineer, Liquidity Hub Ripple s mission is to enable payments every way, everywhere for everyone. We believe connecting traditional financial entities like banks, payment providers and corporations with emerging blockchain technologies and users is the path to an open, decentralized, and more inclusive financial future. This Internet of Value gives any internet-enabled person, application, or device access to financial services that are transparent, fast, reliable, and cheap. Delivering this vision is a challenge of a massive scale spanning $155 trillion in annual cross-border fiat payments and the $1.5 trillion market of digital assets that has grown 10X in the last year. We are looking for a software engineer to join a growing team charged with determining and delivering optimal liquidity for every customer in the world in a cost-effective, robust and scalable manner. You will work closely with applied scientists and machine learning engineers to build robust solutions that power our liquidity services at scale. You will mentor other software engineers, setting and demonstrating high standards and technical excellence. As a member of a new initiative, you must be passionate about inventing and delivering customer-focused solutions to ambitious and ambiguous challenges. WHAT YOU LL DO: Build an enterprise grade platform that provides businesses with a streamlined way to buy, sell and hold digital assets Work on developing the best possible distributed services platform using Kubernetes on top AWS with multiple supporting tools and technologies Participate in the entire software development lifecycle, from software design and requirements gathering to the unit and integration testing Work with teams across the organization, including product, design, marketing, integrations, ops, customer success, legal, etc  Be a technical subject matter expert, provide technical leadership and share your expertise with a growing team of engineers Continuously raise our standard of engineering excellence by implementing and driving best practices for coding, testing, and deployment WHAT WE RE LOOKING FOR: At least 5+ years of hands-on Software Development experience on large scale distributed systems and 2+ years experience working as a tech lead. Experience with Java and GRPC APIs is a plus.  At least 2+ years of web development experience with modern Javascript frameworks (React preferred), HTML5, CSS/SASS. Experience with GraphQL and Typescript is a plus. Demonstrated success by building highly elegant, scalable, and responsive web applications for consumers/enterprise customers Experience in building transactional systems (preferably in finance/banking / e-commerce domains), backed by an RDBMS or NoSQL. Experience with Agile development of distributed services, with a focus on shipping customer-facing features on a regular cadence including, scalability and security. Eagerness to work openly with a diverse team Ability to encourage and drive engineering practices A positive attitude and a passion for imparting knowledge BS in Computer Science or similar  WHO WE ARE: Do Your Best Work The opportunity to build in a fast-paced start-up environment with experienced industry leaders A learning environment where you can dive deep into the latest technologies and make an impact.  A professional development budget to support other modes of learning. Thrive in an environment where no matter what race, ethnicity, gender, origin, or culture they identify with, every employee is a respected, valued, and empowered part of the team. Ripple is Flexible First: you have the option to work from home, from our offices, or a combination of the two around our centers of gravity (15 global offices). Weekly all-company meeting - business updates and ask me anything style discussion with our Leadership Team We come together for moments that matter which include team offsites, team bonding activities, happy hours and more! Take Control of Your Finances Competitive salary, bonuses, and equity Competitive benefits that cover physical and mental healthcare, retirement, family forming, and family support Employee giving match Mobile phone stipend Take Care of Yourself Twice a quarter R&amp;amp;R days so you can rest and recharge Generous wellness reimbursement and weekly onsite &amp;amp; virtual programming Generous vacation policy - work with your manager to take time off when you need it Industry-leading parental leave policies. Family planning benefits. Catered lunches, fully-stocked kitchens with premium snacks/beverages, and plenty of fun events Benefits listed above are for full-time Ripple employees. For all Metaco roles, please discuss benefits with your recruiter.  Ripple is an Equal Opportunity Employer. We re committed to building a diverse and inclusive team. We do not discriminate against qualified employees or applicants because of race, color, religion, gender identity, sex, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by local law or ordinance.   Please find our UK/EU Applicant Privacy Notice and our California Applicant Privacy Notice for reference.When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-18T07:02:56+07:00",
    "companyId": 17
}