{
    "id": "string(optional)",
    "title": "Senior Growth Lead",
    "slug": "senior-growth-lead-keyp",
    "jobType": "Full-time",
    "role": "growth",
    "tags": [
        "growth",
        "lead",
        "senior",
        "copywriting",
        "growth hacker"
    ],
    "compensationMin": 90000.0,
    "compensationMax": 130000.0,
    "location": "Anywhere",
    "applyLink": "https://wellfound.com/company/usekeyp/jobs/2743374-growth-lead?utm_campaign=startup_share&utm_content=startup_share_module&utm_medium=social&utm_source=web3.career&utm_term=usekeyp",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "About Us Keyp builds products that make using crypto safer and easier.  OpenDollar by Keyp is a new over-collateralized stablecoin protocol that is more flexible, built on top of Liquid Staking Derivatives. As more types of assets are tokenized they become more powerful when we can borrow against them at stable rates, protecting users from inflation, market instability, and liquidity limits. Our goal is to make crypto safer and more powerful for everyone by building a secure product and a trustworthy reputable brand. We are a US based team and operate within the legal and regulated framework of the law.   We are launching a new product and entering a growth stage, having raised a $2M USD seed round earlier this year.  About the Role Our products are built in public, and we prioritize open source code, transparency with our community, and documentation. We iterate quickly to expand our product offers and design incentives through insights from continuous research of the industry, competition, and trends.  The OpenDollar team is seeking a senior growth lead, who will develop and orchestrate our growth strategy across all channels toward making OpenDollar a widely adopted stablecoin across various DeFi protocols, institutions, traders, cross border payment apps, LSD holders, RWA holders, and more. About You • Experienced and comfortable with creating a growth strategy for a startup, taking on planning, assigning tasks and collaborating with the cofounders.  • You re inspired by the potential of Web3 and crypto and share our values that puts users first by protecting their privacy, maintaining transparency and security. We are looking for someone who is a seasoned Web3 native and has been an active user and community member of DeFi related projects. • You have experience with early stage startups and are comfortable working on high-level, long term strategies while also maintaining short term goals. Our team is small and includes a lot of collaborative effort while also depending on all team member s ability to be self directed and independent. We encourage experimentation, iterating on ideas and resourcefulness. We work to support each other as best we can.  What You ll Do • Build end-to-end growth marketing programs to accelerate new customer acquisition, improve conversion, and increase awareness. • Optimize existing channels and programs to achieve goals. • Identify, test, scale new and emerging channels for new customer acquisition and track what works or doesn t. • Identify potential paid and niche channel opportunities to amplify reach. • Help craft messaging and collaborate with the design team to build campaign assets. • Support growth of acquisition KPIs and report on them regularly. • Work with executives to set high-level growth targets, KPIs, model growth, and own go-to-market goals. • Guide the whole team in executing campaigns and initiatives that activate community and build, sustain, and grow momentum. • Source, prioritize and implement creative growth ideas and run experiments across channels to continuously improve toward most impactful paths to growth. • Keep a detailed pulse of the crypto market and channel the voice of partners and competitor narratives as input to inform roadmap and priorities. • Collaborate openly with community leaders. • Manage external resources to exercise oversight over OpenDollar s DeFi presence, collaborate on content strategy, social media engagement, and PR partners.  Requirements • 3+ years experience as a growth or marketing leader, with a portfolio demonstrating track record of success and learnings • 2+ years in crypto/web3 professionally and as a user. Experience with DeFi communities is a major plus • Experience at an early stage startup and working in a remote work environment • Excellent, high-empathy communication skills, both written and spoken • High level of discernment  • Experience finding and managing influencers to produce content that supports the brand • Ability to write and edit content for a general audience • Hands-on experience with digital media platforms.When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-07-22T05:44:39+07:00",
    "companyId": 13
}