{
    "id": "string(optional)",
    "title": "Senior Product Manager (Asset Trading)",
    "slug": "senior-product-manager-asset-trading-immutable",
    "jobType": "Full-time",
    "role": "product manager",
    "tags": [
        "product manager",
        "non tech",
        "senior",
        "blockchain",
        "ethereum"
    ],
    "compensationMin": 100000,
    "compensationMax": 201000,
    "location": "Anywhere",
    "applyLink": "https://jobs.lever.co/immutable/bf4a4124-3ef9-4b8c-b073-ebf4ef2df8a5/apply?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&lever-origin=applied&lever-source%5B%5D=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Senior Product Manager (Asset Trading) APAC / Platform Engineering – Platform | Product / Full Time Permanent / Remote  Apply for this job  A bit about us: Immutable is a global technology company, powering the world of NFTs on Ethereum. We are on a mission to be the number one ecosystem for NFTs which empowers and rewards users.  Founded in 2018, Immutable is one of the fastest Australian companies to hit unicorn status, having raised more than AUD $300M+ and a valuation of AUD $3.5 billion. Currently, the Immutable Group consists of the Immutable Platform, the preferred developer platform for building &amp;amp; scaling web3 games on Ethereum, and Immutable Games, a global leader in web3 game development and publishing with leading titles Gods Unchained and Guild of Guardians. It is our ambition to make digital worlds real; we have incredible global growth plans as we strive to become the number one ecosystem for NFTs.  Come and join us as we pioneer in this space! A bit about the role: Here at Immutable, we are rapidly scaling. Hence, we are on the lookout for an amazing Senior Product Manager to join our Assets Trading team within the Immutable Platform. This team is responsible for solving a core problem of making it simple for marketplaces and game studios to allow trading of in-game assets on the blockchain.  The successful candidate will bring with them a strong mix of product strategy skills and the ability to execute a very technical product. You will help guide us as we grow the market from early adopter game studios and gamers into the mainstream market, which is a crucial part of our overarching product strategy.   You ll have the opportunity to: Build product strategy &amp;amp; vision in collaboration with the team Drive a long term product roadmap Work to ensure close alignment between product and GTM Drive impact in market through delivery of differentiated product offerings Leverage your technical knowledge so that we can invest in the right decisions and build a scalable platform product Understand industry trends and gaming studio needs to make strong strategic decisions   We would love you to have: A demonstrated ability to work closely with engineering teams and designers to deliver impact in a product area Great communication skills in order to generate alignment amongst stakeholders and clearly and concisely communicate the team s mission and vision to senior leadership A proven ability to thrive in a highly technical environment where you are able to rapidly master technical concepts, speak the same language as engineers, and to identify the right path forward when encountering technical barriers. A strong product craft. Being able to make the right trade-off and prioritisation decisions   Some extra experience that would be awesome: A strong interest in web 3 or the gaming industry A technical and/or tertiary background in Engineering, Computer Science, or related field   A bit about the team: This role will be part of the Immutable X platform team. At Immutable, you ll be able to build next-generation infrastructure for NFTs on Ethereum and get deep access to the most exciting projects, technology and opportunities in the space. If you want to make it easier to build high-quality, scalable Ethereum NFT projects, working in the product team at Immutable is the best way to have a huge impact!  We are proud of the benefits that we offer for all of our employees globally.  Here is a snapshot:   Attracting the best global talent: 💸We commit to paying globally competitive salaries and contributions &amp;amp; we share our products success through Employee Stock Options. We also support our US Employees with Medical and 401K Insurance 💻 While we offer flexible working arrangements, we have an epic head office in the heart of Sydney and offer remote office hubs around the globe via a WeWork all-access pass 📲We offer USD $500 WFH allowance to set up your home office and USD $600 per annum to put toward your internet and phone usage. Levelling up your growth 🌱 We offer up to USD $1,350 per annum for any classes, courses or events to support your growth and development 📚 Enjoy access to free online courses via Udemy Helping you thrive 💆🏽‍♀️ Enjoy USD $800 per year to put toward your health and wellbeing 🤗 Get 24/7 access to unlimited counselling for you and your family when you need it through our EAP Service 🎁 Get premium access to mindfulness resources, online fitness classes and discounts at major retailers through Perkbox Leave when you need it the most:  👨‍👧‍👦New parents receive 12 weeks of paid leave in our gender-neutral offer. The birthing parent also gets an additional six weeks of leave for rest and recovery leading up to and after birth. We also offer Miscarriage Leave and extra leave for IVF treatments 🎂 Enjoy 2 additional paid annual leave days at the end of the year and a paid day off for your birthday  Additional Information:  Immutable is committed to building and fostering an inclusive, diverse workplace. We believe in incorporating everyone s perspectives and experiences as this has been a significant driver of our success so far. For this reason, we strongly encourage candidates of all backgrounds to get in touch. Even if you don t meet all the job listing requirements, do yourself (and us) a favour by still applying! You ll likely bring something to the workplace that we haven t thought of yet, and we would love to hear from you.  We are a 2022 Circle Back Initiative Employer – we commit to responding to every applicant. *A note to recruitment agencies: Our internal team has this role covered, so there is no need to reach out - We don t accept unsolicited agency resumes and are not responsible for any fees related to unsolicited resumes. Thank you! #LI-Remote  Apply for this jobWhen applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-15T12:00:00+07:00",
    "companyId": 9
}