{
    "id": "string(optional)",
    "title": "Senior Finance Manager",
    "slug": "senior-finance-manager-crypto-com",
    "jobType": "Full-time",
    "role": "finance",
    "tags": [
        "finance",
        "non tech",
        "senior",
        "crypto"
    ],
    "compensationMin": 125600,
    "compensationMax": 225000,
    "location": "South Korea",
    "applyLink": "https://jobs.lever.co/crypto/543fbd9a-fb49-48ea-9d26-697d5b77439c/apply?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&lever-origin=applied&lever-source%5B%5D=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Senior Finance Manager Seoul, South Korea / Corporate – Regional Finance / Full-time / Hybrid  Apply for this job  The F&amp;amp;A team comprises multiple functions from Financials Control &amp;amp; Business Performance Management, Procurement, Digital Transformation, Tax, Treasury and Operations. Together, the team optimizes our global finance initiatives and enjoys being detailed-oriented while multitasking across various exciting project scopes We are seeking a Finance Manager to support the financial planning, forecasting and reporting for Korea. This role will assist in implementing internal finance controls, managing day-to-day banking relationships, conducting reviews of the Company s payments, accounting, and finance procedures, and ensuring proper reporting, both internally and externally. This role reports directly to the EVP, Finance and will work closely with the local General Manager in Korea.   Responsibilities Assist in preparing and maintaining operating budgets, local accounting and reconciliation mechanisms, and oversee the cash flow of the company ensuring it has appropriate treasury controls. Support the development and execution of a comprehensive financial strategy to support business growth goals and regulatory requirements, ensuring all accounting activities and internal audits comply with financial regulations. Assist in generating monthly, quarterly, and annual financial reports to the Korea General Manager, Finance Director, and Board of Directors. Assist in conducting profit and cost analyses, identifying funding requirements and cost reduction strategies. Assist in maintaining and overseeing banking relationships.   Requirements 3-5 years of finance experience, preferably in regulated institutions. Good commend of English and Korean. Understanding of cash flow management, bank reconciliation, and bookkeeping. Basic knowledge of budgeting and risk management with a willingness to learn data analysis and forecasting models. Familiarity with Korean regulatory frameworks and requirements related to Financial institutions, Electronic Money, and crypto assets is a plus. Proficiency in accounting software. Interest in and knowledge of the fintech industry and products. Excellent written, verbal, and interpersonal communication skills and a proven history of working effectively with people at all levels both inside and outside the Company. Good analytical, organizational, and decision-making skills. Demonstrated ability to execute under pressure while meeting deadlines. High degree of integrity, initiative, perseverance, and leadership skills. Bachelor s degree in Accounting, Finance, or relevant field, or equivalent work experience. Relevant certifications (e.g. CFA/CPA/ACA/ACCA) is a plus.   #LI-CW1 #LI-Hybrid #LI-MidSenior  Life @ Crypto.com Empowered to think big. Try new opportunities while working with a talented, ambitious and supportive team. Transformational and proactive working environment. Empower employees to find thoughtful and innovative solutions. Growth from within. We help to develop new skill-sets that would impact the shaping of your personal and professional growth. Work Culture. Our colleagues are some of the best in the industry; we are all here to help and support one another. One cohesive team. Engage stakeholders to achieve our ultimate goal - Cryptocurrency in every wallet.  Work Flexibility Adoption. Flexi-work hour and hybrid or remote set-up Aspire career alternatives through us - our internal mobility program offers employees a new scope.   Work Perks: crypto.com visa card provided upon joining  Are you ready to kickstart your future with us?  Benefits Competitive salary Attractive annual leave entitlement including: birthday, work anniversary Work Flexibility Adoption. Flexi-work hour and hybrid or remote set-up Aspire career alternatives through us. Our internal mobility program can offer employees a diverse scope.   Work Perks: crypto.com visa card provided upon joining  Our Crypto.com benefits packages vary depending on region requirements, you can learn more from our talent acquisition team.  About Crypto.com:  Founded in 2016, Crypto.com serves more than 80 million customers and is the world s fastest growing global cryptocurrency platform. Our vision is simple: Cryptocurrency in Every Wallet™. Built on a foundation of security, privacy, and compliance, Crypto.com is committed to accelerating the adoption of cryptocurrency through innovation and empowering the next generation of builders, creators, and entrepreneurs to develop a fairer and more equitable digital ecosystem. Learn more at https://crypto.com.   Crypto.com is an equal opportunities employer and we are committed to creating an environment where opportunities are presented to everyone in a fair and transparent way. Crypto.com values diversity and inclusion, seeking candidates with a variety of backgrounds, perspectives, and skills that complement and strengthen our team.  Personal data provided by applicants will be used for recruitment purposes only. Please note that only shortlisted candidates will be contacted.  Apply for this jobWhen applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-07-17T12:00:00+07:00",
    "companyId": 7
}