{
    "id": "string(optional)",
    "title": "Senior Product Manager, Risk",
    "slug": "senior-product-manager-risk-okx",
    "jobType": "Full-time",
    "role": "product manager",
    "tags": [
        "product manager",
        "non tech",
        "senior",
        "blockchain",
        "crypto"
    ],
    "compensationMin": 120000,
    "compensationMax": 220000,
    "location": "Singapore",
    "applyLink": "https://boards.greenhouse.io/okx/jobs/5719553003?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&gh_src=web3.career#application_form",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Who We Are At OKX, we believe our future is reshaped with technology. As one of the world s leading cryptocurrency spot and derivatives exchanges, OKX uses innovative blockchain technology to redefine the financial ecosystem. With millions of global users and an array of diverse and sophisticated products, solutions, and trading tools, we strive to empower everyone to explore the world of crypto. What You ll Be Doing:    Help shape and drive the vision and strategy for Risk Perform research to understand the market, customer needs, and existing solutions and experiences Own product development of features and capabilities to manage fraud risk from inception to launch Perform research to understand the market, customer needs, and existing solutions and experiences Work closely with product designers, data analysts, and engineering teams to define detailed product specification, review technical capabilities, prioritize projects, and create &amp;amp; steer fraud risk product roadmap    What We Look For In You:  Experience with ATO, scams, traffic abuse, fraud prevention, or identity solutions Ability to work with internal and external risk, data scientist, and engineering teams Strong analytical, prioritization, and problem solving skills and willingness to roll up one s sleeves to get the job done Passion for crypto and blockchain innovations Bachelor s degree in Computer Science, Engineering, or a related technical discipline  Nice to Haves:  Experience in building Crypto/Web3/Blockchain products Mandarin speaking ability to liaise with mandarin speaking clients/stakeholders.   Perks &amp;amp; Benefits:  Competitive total compensation  Comprehensive insurance coverage for employees and their dependants  More that we love to tell you along the process!When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-21T12:00:00+07:00",
    "companyId": 6
}