{
    "id": "string(optional)",
    "title": "Senior Manager, People Technology",
    "slug": "senior-manager-people-technology-ripple",
    "jobType": "Full-time",
    "role": "hr",
    "tags": [
        "hr",
        "non tech",
        "recruiter",
        "senior",
        "crypto"
    ],
    "compensationMin": 244858.0,
    "compensationMax": 254858.0,
    "location": "United States",
    "applyLink": "https://ripple.com/careers/all-jobs/job/5307783?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "At Ripple, we re building a world where value moves like information does today. It s big, it s bold, and we re already doing it. Through our crypto solutions for financial institutions, businesses, governments and developers, we are improving the global financial system and creating greater economic fairness and opportunity for more people, in more places around the world. And we get to do the best work of our career and grow our skills surrounded by colleagues who have our backs.  If you re ready to see your impact and unlock incredible career growth opportunities, join us, and build real world value.  THE WORK: Lead Ripple sPeople Technology team and manage the global People Technology ecosystem. Develop and coach a teamof direct reports responsible for all People related systems and analytics across the company. Implement,configure, test, maintain, and monitor Ripple s HR computer programs and systems, includingcoordinating installation. Review Ripple s existing systems and processes and develop new changes toimprove existing people operations from onboarding to orientation, to employee education programs andpromotions, to off-boarding and termination. Review Ripple s People systems and makerecommendations on improvement of current platforms, or implement new systems and platforms tomeet our business needs. Manage new Workday implementation, and go-live process. Identify processes,programs or capabilities that could benefit from automation, process enhancements or re-engineering.Develop and maintain People/workforce dashboards that provide actionable insights to leaders. Designand develop tools for automation, monitoring, and auditing to reduce operational risk, manualworkaround, and increase HR Ops efficiency. Create solutions for People Ops challenges faced by Ripple.Telecommuting permitted 50% or more but less than 100% per week within same geographic location asassigned office location. WHAT YOU LL DO: Must have a Bachelor s Degree in Computer Science, Management Information Systems, HR or a related field, plus five (5) years of progressive post-baccalaureate related experience. Of the required experience, must have four (4) years of experience in the following (which may be gained concurrently): Implementing and configuring Human Resources computer programs and systems. Working with HR Systems and People Analytics, including developing changes to improve existing people operations from onboarding to employee education programs and promotions, to off-boarding Fully responsible for Workday HCM for business entities globally Fully responsible for Workday integrations BI/SQL Managing systems vendor and implementation partner engagements, including contract, change order, and staffing negotiation Of the required experience, must have one (1) year of experience in the following (which may be gained concurrently): Managing a team of direct reports Working as the team leader responsible for People- related systems globally  For positions that will be based in CA, the annual salary range for this position is below. Actual salaries may vary based on numerous factors including, among other things, an individual applicant s experience, and qualifications for the position.  #LI-DNS  For positions that will be based in CA, the annual salary range for this position is below. Actual salaries may vary based on numerous factors including, among other things, an individual applicant s experience and qualifications for the position. This range does not include equity or additional compensation, such as bonuses or commissions.  CA Annual Base Salary Range $244,858—$254,858 USD   WHO WE ARE: Do Your Best Work The opportunity to build in a fast-paced start-up environment with experienced industry leaders A learning environment where you can dive deep into the latest technologies and make an impact.  A professional development budget to support other modes of learning. Thrive in an environment where no matter what race, ethnicity, gender, origin, or culture they identify with, every employee is a respected, valued, and empowered part of the team. Ripple is Flexible First: you have the option to work from home, from our offices, or a combination of the two around our centers of gravity (15 global offices). Weekly all-company meeting - business updates and ask me anything style discussion with our Leadership Team We come together for moments that matter which include team offsites, team bonding activities, happy hours and more! Take Control of Your Finances Competitive salary, bonuses, and equity Competitive benefits that cover physical and mental healthcare, retirement, family forming, and family support Employee giving match Mobile phone stipend Take Care of Yourself Twice a quarter R&amp;amp;R days so you can rest and recharge Generous wellness reimbursement and weekly onsite &amp;amp; virtual programming Generous vacation policy - work with your manager to take time off when you need it Industry-leading parental leave policies. Family planning benefits. Catered lunches, fully-stocked kitchens with premium snacks/beverages, and plenty of fun events Benefits listed above are for full-time Ripple employees. For all Metaco roles, please discuss benefits with your recruiter.  Ripple is an Equal Opportunity Employer. We re committed to building a diverse and inclusive team. We do not discriminate against qualified employees or applicants because of race, color, religion, gender identity, sex, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by local law or ordinance.   Please find our UK/EU Applicant Privacy Notice and our California Applicant Privacy Notice for reference.When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-18T07:04:01+07:00",
    "companyId": 17
}