{
    "id": "string(optional)",
    "title": "(Senior) Software Engineer - Java (Prime Services)",
    "slug": "senior-software-engineer-java-prime-services-okx",
    "jobType": "Full-time",
    "role": "accounting",
    "tags": [
        "accounting",
        "dev",
        "java",
        "senior",
        "blockchain"
    ],
    "compensationMin": 30000,
    "compensationMax": 50000,
    "location": "Hong Kong",
    "applyLink": "https://boards.greenhouse.io/okx/jobs/5719734003?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career&gh_src=web3.career#application_form",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "Who We Are At OKX, we believe our future is reshaped with technology. Founded in 2017, OKX is one of the world s leading cryptocurrency spot and derivatives exchanges. OKX innovatively adopted blockchain technology to reshape the financial ecosystem by offering some of the most diverse and sophisticated products, solutions, and trading tools on the market. Trusted by more than 20 million users in over 180 regions globally, OKX strives to provide an engaging platform that empowers every individual to explore the world of crypto. In addition to its world-class DeFi exchange, OKX serves its users with OKX Insights, a research arm that is at the cutting edge of the latest trends in the cryptocurrency industry. With its extensive range of crypto products and services, and unwavering commitment to innovation, OKX vision is a world of financial access backed by blockchain and the power of decentralized finance. We invest in our people as much as we invest in technology. We are united by our engaging culture, here we win as a team, embrace changes, and do the right thing. We are committed to creating a friendly, rewarding and diverse environment for OKers. It doesn t matter where you come from, here everyone feels valued, respected and has the same opportunities to develop and thrive — we want to bring out the best in you.   About Prime The Prime Team builds services that offer professional and institutional traders the ability to trade large blocks of crypto products using arbitrarily complex multi-leg strategies. We design and build highly-automated services that go far beyond basic exchange order book trading. We are the team behind Liquid Marketplace, with well over USD 1 Billion in Institutional Trading Volume so far in 2023, and the newly-launched Nitro Spreads, which offers high-frequency order-book trading of spreads with atomic execution.   The Role You will be involved in every aspect of creating innovative solutions, from influencing product development to the full software engineering lifecycle of an institutional-grade trading platform. Our diverse team is composed of veterans from both trad-fi and other pioneering crypto firms, offering a unique opportunity for you to contribute and grow at the cutting edge of the industry.   What You ll Be Doing:   Designing and implementing innovative trading solutions with a focus on institutional clients.  Maintaining and enhancing our existing back-end platforms, including new features, improving robustness, and adopting improved technologies.  Collaborating closely with product managers and cross-functional teams to deliver new features.  Performance optimization of overall trading architecture aiming for low latency, high availability and scalability.    What We Look For In You:   Strong logical thinking and problem-solving skills with a solid STEM educational background.  Fluent with high-performance Java and async programming patterns.  Prior experience in trading systems development is a big plus.  Familiar with distributed systems and micro service architecture.  Practical experience with automated testing and continuous integration.  Willing to learn all aspects of trading products in financial and crypto markets including spot, future, swap, and options.    Perks &amp;amp; Benefits  Competitive total compensation Comprehensive insurance coverage for employees and their dependants More that we love to tell you along the process!  When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-21T12:00:00+07:00",
    "companyId": 6
}