{
    "id": "string(optional)",
    "title": "Vice President",
    "slug": "vice-president-dittopr",
    "jobType": "Full-time",
    "role": "crypto",
    "tags": [
        "crypto",
        "nft"
    ],
    "compensationMin": 100000.0,
    "compensationMax": 150000.0,
    "location": "United States",
    "applyLink": "https://www.linkedin.com/jobs/view/vice-president-at-ditto-pr-3694248626?utm_source=web3.career&ref=web3.career&src=web3.career&source=web3.career",
    "sticky": "",
    "highlight": "",
    "remote": true,
    "description": "p&amp;gt; strong&amp;gt; em&amp;gt;Clients, Industries and Work /em&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt;Ditto works with cutting-edge clients in the fastest growing industries. From taking stealth startups to unicorns, to launching the latest NFT and Web3 experiences, to helping fintech find their footing, to guiding consumer brands on connecting with their audiences, Ditto leads communications and digital services for some of the most exciting projects and smartest Founders and CEOs both in the U.S and globally. /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt;We are a results-focused team, which requires us to be experts in our clients  industries and bring creative leadership on big plans and smart ideas that deliver impactful outputs. /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt;At Ditto, we work hard, fast and smart. We cover social strategy, content development, influencer management, messaging, media training, media relations, events and conferences, crisis support, and more. While we collaborate to talk through issues and come up with new ideas, plans and strategies, employees at Ditto also maintain a high-level of personal responsibility. This means each team member at Ditto understands their role and responsibilities, expectations on accounts and how to accomplish the work expected of them. /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt; em&amp;gt;About The Job /em&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt;At Ditto, we start with a very simple philosophy on accounts: As the senior lead on the account, you should be doing the senior lead work. You are responsible for the success of accounts and a positive work experience for your teams. You deliver strategic and tactical results, see the bigger picture, and form strong client relationships. You spend time meeting, motivating and helping others. /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt;You are selflessly motivational, patient, always available to provide feedback but also set boundaries to ensure roles are maintained. /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt; em&amp;gt;What You Will Do /em&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt;- Client Relations: You are the client s go-to communications professional /p&amp;gt; ul&amp;gt; li&amp;gt;Understand the client s needs, expectations and business and provide on-going strategic communications counsel /li&amp;gt; li&amp;gt;Lead client facing meetings with authority and confidence /li&amp;gt; li&amp;gt;Answer client questions in real-time /li&amp;gt; li&amp;gt;Earn the trust and confidence of the client /li&amp;gt; /ul&amp;gt; p&amp;gt;- Account Success: You are a hands-on leader and daily senior presence /p&amp;gt; ul&amp;gt; li&amp;gt;Communicate clearly, maintain account organization, define roles and responsibilities to ensure account health /li&amp;gt; li&amp;gt;Motivate and lead by example /li&amp;gt; li&amp;gt;Deliver results, understanding what success looks like /li&amp;gt; li&amp;gt;Balance the week-to-week with overarching long term vision /li&amp;gt; li&amp;gt;Think creatively, contribute ideas regularly, and identify new opportunities /li&amp;gt; li&amp;gt;Manage 3-5 account teams and collaborate with peers and junior team to keep the account moving forward /li&amp;gt; li&amp;gt;Ensure successful 30,60,90 day client onboarding /li&amp;gt; /ul&amp;gt; p&amp;gt;- Work: You execute timely and high quality outputs on an ongoing basis /p&amp;gt; ul&amp;gt; li&amp;gt;Provide communications counsel to client /li&amp;gt; li&amp;gt;Develop strategy memos and presentations /li&amp;gt; li&amp;gt;Craft messaging and conduct media training /li&amp;gt; li&amp;gt;Write or edit op-eds, content, press releases, pitches /li&amp;gt; li&amp;gt;Generate Tier One client features in media /li&amp;gt; li&amp;gt;Contribute to account growth and business development /li&amp;gt; /ul&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt; em&amp;gt;Who You Are /em&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; ul&amp;gt; li&amp;gt; strong&amp;gt;PR /strong&amp;gt;: Can demonstrate success in messaging, media training, media relations, writing, events, social media /li&amp;gt; li&amp;gt; strong&amp;gt;Industries /strong&amp;gt;: Experience in edtech, fintech, crypto, consumer and B2B preferred. /li&amp;gt; li&amp;gt; strong&amp;gt;Work Ethic And Intensity /strong&amp;gt;: Proven mastery of a mid-level role: ongoing media relations, smart, organized, client facing, leader. Has shown the ability to work in a fast-paced environment. /li&amp;gt; li&amp;gt; strong&amp;gt;Accounts /strong&amp;gt;: Successfully led accounts and can clearly articulate “success” on these accounts and personal ownership of outputs /li&amp;gt; li&amp;gt; strong&amp;gt;Strategic Thinking: /strong&amp;gt; Delivered smart strategy to clients in a way that led to an output and can provide examples of short term and long term strategic thinking on accounts /li&amp;gt; li&amp;gt; strong&amp;gt;Leadership /strong&amp;gt;: Has demonstrated the ability to lead / hold people accountable, meet deadlines, and manage conflict resolution /li&amp;gt; li&amp;gt; strong&amp;gt;New Business:  /strong&amp;gt;Has successfully brought in new business at their last agency and/or has participated in pitching, proposal, and contract writing /li&amp;gt; li&amp;gt; strong&amp;gt;Clients /strong&amp;gt;: Has been directly responsible for managing a client / managed a client through a problem and can give examples of client relations /li&amp;gt; /ul&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt; em&amp;gt;What We Offer /em&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; ul&amp;gt; li&amp;gt; strong&amp;gt;🤩  /strong&amp;gt;Being part of a fast-paced and high-output communications agency /li&amp;gt; li&amp;gt;🤓 Rewarding, challenging, and high-empathy team culture /li&amp;gt; li&amp;gt;❤️🩹 Monthly rewards to spend on health and wellness /li&amp;gt; li&amp;gt;💻 This role can be remote, hybrid, or in-office with a diverse and decentralized team /li&amp;gt; li&amp;gt;💵 Performance bonuses (can be monthly, quarterly, new business, MVP, and more) /li&amp;gt; li&amp;gt;📈 Health insurance covering medical, dental, vision, disability, and FSA /li&amp;gt; li&amp;gt;🎒 Continuing education /li&amp;gt; li&amp;gt;💪 401(k) Plan with 5% match /li&amp;gt; li&amp;gt;🧳 Unlimited PTO /li&amp;gt; li&amp;gt;🚼 12 weeks fully paid parental leave /li&amp;gt; /ul&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt; strong&amp;gt; em&amp;gt;Diversity &amp;amp;amp; Equality /em&amp;gt; /strong&amp;gt; /p&amp;gt; p&amp;gt; br&amp;gt; /p&amp;gt; p&amp;gt;Ditto PR is committed to the principles of equal employment. We are committed to complying with all federal, state, and local laws providing equal employment opportunities, and all other employment laws and regulations. It is our intent to maintain a work environment that is free of harassment, discrimination, or retaliation because of age (40 and older), race, color, national origin, ancestry, religion, sex (including sexual orientation and gender identity), pregnancy (including childbirth, lactation, and related medical conditions), physical or mental disability, genetic information (including testing and characteristics), veteran status, uniformed servicemember status, or any other status protected by federal, state, or local laws. Ditto PR is dedicated to the fulfillment of this policy in regard to all aspects of employment, including but not limited to recruiting, hiring, placement, transfer, training, promotion, rates of pay, and other compensation, termination, and all other terms, conditions, and privileges of employment. /p&amp;gt;When applying, mention the word CANDYSHOP to show you read the job post completely. This is a beta feature to avoid spam applicants. Companies can search these words to find applicants that read this and see they are human ROTEuMzguNDEuMjUwM",
    "createdOn": "2023-08-18T18:21:16+00:00",
    "companyId": 15
}