{
    "id": "645071e78f5a0b0002d7fbfa",
    "title": "Brand Strategist & Copywriter - Otherlife",
    "slug": "brand-strategist-copywriter-otherlife-moonpay-toronto-canada",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "non-tech",
    "tags": [
        "non-tech",
        "marketing",
        "research",
        "content",
        "full-time",
        "web3",
        "social-media",
        "director"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Toronto, Canada",
    "applyLink": "https://boards.greenhouse.io/moonpay/jobs/5591823003#app",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>Job Location: Toronto, Canada</p>\n<p>Job Type: Full-time, in-office</p>\n<p>Otherlife by MoonPay is a creative agency specializing in web3 product strategy, design, development, and branding for the world's leading companies and brands including Arsenal Football Club, Coinbase, OpenSea, and Shopify. We are a team of passionate creators who are committed to designing and building innovative and impactful solutions for our clients in the web3 space. Our goal is to push the boundaries of what's possible with web3 technology, and we are always on the lookout for talented individuals who share our vision.</p>\n<p><strong>About the Position</strong>:</p>\n<p>We are currently seeking a Brand Strategist &amp; Copywriter to join our team in Toronto. As the Brand Strategist &amp; Copywriter, you will work closely with the Creative Director, Art Director and Strategy Team to develop and execute creative concepts and strategies that align with our clients' brand values and vision. Your role will involve developing brand strategy and creating captivating and persuasive content for a range of creative initiatives, such as websites, presentations, social media posts, email campaigns, and other marketing materials.</p>\n<p><strong>Key Responsibilities, Skills &amp; Experience</strong>:</p>\n<ul>\n<li>Collaborate with the Creative Director, Art Director, Project Managers, Designers, Strategists and Clients to develop creative concepts and strategies for brand development and marketing campaigns across web2 and web3 projects</li>\n<li>Develop and execute creative copy that resonates with target audiences and reflects brand values and messaging</li>\n<li>Develop and adhere to brand guidelines and tone of voice documents to ensure consistent messaging across all platforms</li>\n<li>Conduct research on industry trends, target audience, and competitors to inform creative direction and messaging</li>\n<li>Work with designers to ensure that copy and visual assets work together seamlessly to create a cohesive brand experience</li>\n<li>Ensure all copy is delivered on time and within budget</li>\n<li>Continuously monitor and analyze the effectiveness of creative campaigns and strategies and adjust as necessary</li>\n</ul>\n<p><strong>Requirements</strong>:</p>\n<ul>\n<li>A strong portfolio of creative copywriting work, including websites, presentations, social media posts, email campaigns, and other marketing materials</li>\n<li>Excellent communication and collaboration skills</li>\n<li>Ability to develop and execute creative strategies that align with brand values and vision</li>\n<li>Deep understanding of web3 technologies </li>\n<li>Experience with conducting research on industry trends, target audience, and competitors to inform creative direction and messaging</li>\n<li>Proficiency in project management tools and software</li>\n<li><strong>Minimum Experience</strong>: 5+ years of experience in a brand strategy and copywriting role, preferably in an agency environment.</li>\n</ul><p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/non-tech\">Non Tech Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/marketing\">Marketing Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/research\">Research Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/content\">Content Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/social-media\">Social Media Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/director\">Director Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-03T02:10:30.881Z",
    "companyId": 51
}