{
    "id": "64cdaf95719f55000210c448",
    "title": "Compliance Officer/Money Laundering Reporting Officer (CO/MLRO) - MEASA",
    "slug": "compliance-officer-money-laundering-reporting-officer-co-mlro-measa-binance-uae-dubai",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "legal",
    "tags": [
        "legal",
        "engineering",
        "exchange",
        "web3",
        "aml",
        "compliance",
        "kyc",
        "finance",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "UAE, Dubai",
    "applyLink": "https://jobs.lever.co/binance/29f44b6e-b328-49d0-96c9-ac53f51f1d31/apply",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>Binance is the leading global blockchain ecosystem and cryptocurrency infrastructure provider whose suite of financial products includes the world’s largest digital-asset exchange. Our mission is to accelerate cryptocurrency adoption and increase the freedom of money.If you’re looking for a fast-paced, mission-driven organization where opportunities to learn and excel are endless, then Binance is the place for you.Binance is seeking an experienced and highly-motivated Compliance Officer/Money Laundering Reporting Officer to oversee our compliance activities in the MEASA (Middle East, Africa and South Asia), ideally with prior exposure in regulated jurisdictions including: the  DIFC, ADGM or Bahrain.As a CO/MLRO, you will play a crucial role in implementing and maintaining effective compliance programs to protect the organization from regulatory risks, as well as ensuring adherence to local and international anti-money laundering and compliance standards.<h3>Responsibilities:</h3><ul><ul><li>Develop, implement, and maintain comprehensive compliance programs in line with regional and international regulations such as AML/CFT, KYC, and sanctions compliance.</li><li>Monitor and review internal controls to ensure compliance with applicable laws, regulations, and policies, specifically in the MEASA region.</li><li>Liaise and maintain relationships with regulatory bodies and manage any regulatory inquiries and reporting obligations for the organization in the region.</li><li>Coordinate with global compliance teams to align compliance objectives, processes, and goals, ensuring consistent practices across the organization.</li><li>Conduct ongoing risk assessments to identify potential gaps in the compliance framework and develop action plans to address identified areas of risk.</li><li>Provide training and guidance to staff on compliance-related matters, promoting a culture of integrity, compliance, and transparency throughout the organization.</li><li>Implement continuous improvement to the compliance program&#39;s effectiveness, recommending changes as needed to ensure adaptation to a rapidly evolving regulatory environment.</li></ul></ul><h3>Requirements:</h3><ul><ul><li>A bachelor&#39;s degree in Finance, Law, Engineering, or a related discipline.</li><li>Minimum 8 years of experience in compliance, AML/CFT, or regulatory affairs, with a focus on the financial services or related industries within the MEASA region.</li><li>Extensive knowledge of and experience in MEASA including DFSA, FSRA or CBB regulations and compliance standards.</li><li>Exceptional communication skills, with the ability to effectively present complex information to both internal and external stakeholders.</li><li>Strong analytical and problem-solving skills, with a proactive approach to identifying, addressing, and preventing compliance risks.</li><li>Fluency in English is required; proficiency in Arabic or other relevant languages would be considered as an advantage.</li><li>Distinguished leadership capabilities and experience in managing cross-functional teams.</li></ul></ul><b>Working at Binance</b>• Be a part of the world’s leading blockchain ecosystem that continues to grow and offers excellent career development opportunities.• Work alongside diverse, world-class talent in an environment where learning and growth opportunities are endless.• Tackle fast-paced, challenging and unique projects.• Work in a truly global organization, with international teams and a flat organizational structure.• Competitive salary and benefits.• Balance life and work with flexible working hours and casual work attire.Learn more about how Binancians embody the organization’s <a href=\"https://www.binance.com/en/blog/ecosystem/what-exactly-is-binances-culture-5487396240897265423\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">core values</a>, creating a unified culture that enables collaboration, excellence, and growth. Apply today to be a part of the Web3 revolution! Binance is committed to being an equal opportunity employer. We believe that having a diverse workforce is fundamental to our success. <i>By submitting a job application, you confirm that you have read and agree to our </i><a href=\"https://www.binance.com/en/candidate/privacy/notice\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\"><i>Candidate Privacy Notice</i></a><i>.</i></p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/legal\">Legal Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/engineering\">Engineering Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/exchange\">Exchange Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/aml\">Aml Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/compliance\">Compliance Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/kyc\">Kyc Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/finance\">Finance Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-05T03:00:00.043Z",
    "companyId": 10
}