{
    "id": "64a37fa797882b00026aec6e",
    "title": "Developer Relations - Sygma",
    "slug": "developer-relations-sygma-chainsafe-systems-toronto-canada-or-remote",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "non-tech",
        "marketing",
        "research",
        "community",
        "content",
        "developer",
        "engineering",
        "web3",
        "rust",
        "discord",
        "typescript",
        "polkadot",
        "solidity",
        "devrel",
        "ethereum",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Toronto, Canada OR Remote",
    "applyLink": "https://boards.greenhouse.io/chainsafesystems/jobs/4923274004#app",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p><a href=\"http://chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">ChainSafe</a> is a leading blockchain research and development firm specializing in infrastructure solutions for the decentralized web. Alongside its contributions to significant ecosystems such as Ethereum, Polkadot, Filecoin, Mina, and more, ChainSafe creates solutions for developers and teams across the web3 space utilizing our expertise in <a href=\"http://gaming.chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">gaming</a>, <a href=\"https://chainbridge.chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">bridging</a>, NFTs, and <a href=\"http://storage.chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">decentralized storage.</a> As part of the mission to build innovative products for users and better tooling for developers, ChainSafe embodies an open-source and community-oriented ethos.</p>\n<p>To learn more about ChainSafe, look at our <a href=\"https://discord.com/invite/xSAwrnCWcg\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Discord</a>, <a href=\"https://github.com/chainsafe\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">GitHub</a>, and <a href=\"https://chainsafe.io/projects\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">website</a>.</p>\n<p><strong>Here’s what you need to know before reading on:</strong></p>\n<ul>\n<li>Our progressive tech stack includes Go, Rust, and TypeScript</li>\n<li>We spearhead ecosystem projects like <a href=\"https://github.com/ChainSafe/lodestar\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Lodestar</a>, <a href=\"https://github.com/ChainSafe/web3.js\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Web3.js</a>, <a href=\"https://github.com/ChainSafe/forest\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Forest</a>, <a href=\"https://github.com/ChainSafe/mina-rs\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Mina-rs</a>, and <a href=\"https://github.com/ChainSafe/gossamer\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Gossamer</a></li>\n<li>We are global, remote-friendly, and open to contractors</li>\n</ul>\n<p>At ChainSafe, you’ll be part of a team that believes in the community's vital importance and contributes to advancing humanity with open-source and decentralized technology.</p>\n<p><em>The following details a description, responsibilities, requirements, and otherwise supporting information for those seeking to work in a Developer Relations/Advocacy role for Sygma.</em></p>\n<h3>Description</h3>\n<p>ChainSafe is seeking a motivated Developer Relations individual to represent <em>Sygma</em> - The interoperability layer for building cross-blockchain applications.</p>\n<p>We believe that cross-chain interoperability is the fundamental enabler for the next wave of growth in the blockchain industry. Sygma will empower builders to create streamlined experiences where users are not confined to one ecosystem. By enabling elaborate cross-chain functionality and putting most of the steps under the hood, Sygma will enable smooth, web2-like user experiences. Please find more information about Sygma on the Sygma <a href=\"https://buildwithsygma.com/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Website.</a></p>\n<p>The ideal candidate will have experience working in the software product development cycle with an emphasis on developer user experience, including education and community engagement.</p>\n<p>An individual in this role will work closely with the Marketing, Communications teams as well as with specific-product teams within ChainSafe. Much of the work will consist of engaging with our ever-growing Discord community, contributing to or participating in ecosystem events (ie, Devcon, ETHDenver), and otherwise supporting ChainSafe's vision of educating and empowering the next million developers into the web3 ecosystem, by way of Sygma.</p>\n<p>We’re looking for a versatile individual who understands developer's needs and struggles and is ready and able to apply creative strategies to solve interesting problems surrounding community engagement and helping to educate a global audience of developers transitioning into web3.</p>\n<h3>Responsibilities</h3>\n<ol>\n<li><strong>Content Creation</strong>\n<ul>\n<li>Writing content (technical by nature) to be used for a variety of purposes including: video walkthroughs, tutorials, blog posts, conducting interviews (working with the Sygma PM), drafting questionnaires related to community engagement/growth statistics and otherwise contributing technical expertise to the communications and marketing teams efforts when necessary.</li>\n</ul>\n</li>\n<li><strong>Documentation</strong>\n<ul>\n<li>Supporting Sygma’s community by providing accessible written documentation and producing educational materials and engagement initiatives.</li>\n<li>Testing, fixing and improving existing software documentation.</li>\n</ul>\n</li>\n<li><strong>Community Engagement</strong>\n<ul>\n<li>Offering mentoring, support and guidance for Sygma’s developer ecosystem and its communities (Discord, Twitter); both online as well as offline/physical events (ie, meetups, hackathons, conferences).</li>\n<li>Engaging with the Sygma’s ecosystem of developers and extended community to collect feedback and report back to the team for continued product improvement.</li>\n</ul>\n</li>\n<li><strong>Ecosystem-Driven Feedback</strong>\n<ul>\n<li>Absorbing a wide scope of understanding of the entire web3 ecosystem and working with the Sygma PM to better inform the product’s market-fit.</li>\n<li>Create an engagement vault and create Bi-Weekly Reports</li>\n</ul>\n</li>\n</ol>\n<h3>Requirements</h3>\n<ul>\n<li>Previous experience as engineer/DevRel on comparable interoperability protocols.</li>\n<li>Proof in action (showcasing knowledge; eg, Discord, Stack Overflow, Reddit, Medium, <a href=\"http://Dev.to\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Dev.to</a>).</li>\n<li>Ability to explain technical concepts in an easy to understand manner.</li>\n<li>Ability to read and understand a programming language and work with various technologies in our stack.\n<ul>\n<li>Examples:\n<ul>\n<li>Go, Solidity, Typescript, Rust, Shell, Docker</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Ability to multitask and balance a variety of initiatives.</li>\n<li>Strong soft skills in customer relations, marketing, and communications.</li>\n<li>Strong comprehension of industry trends and product-market fit.</li>\n<li>Passionate about distributed systems and what web3 can do for the world.</li>\n</ul>\n<h3>Nice to have</h3>\n<ul>\n<li>Engineering background.</li>\n<li>Experience in building, deploying, or otherwise maintaining web3 applications and protocols, especially those of the open-sourced variety.</li>\n<li>Experience working in the interoperability space.</li>\n</ul>\n<p>If you feel like you’re the perfect fit for the role, please apply even if you don’t match all the requirements.</p>\n<p><strong>Hiring Steps</strong></p>\n<ul>\n<li>Selected candidates will be invited to a 30-to–45-minute screening call with one of our tech recruiters</li>\n<li>Next, candidates will be invited to a 60-minute values interview with one of our team members</li>\n<li>Then, candidates will be asked to complete a technical task in under 4 hours, but we provide up to 5 business days to complete it</li>\n<li>Lastly, candidates will be invited to a 60-minute interview with the hiring team members</li>\n</ul>\n<p><strong>Why Join ChainSafe</strong></p>\n<p>Founded by developers for developers, ChainSafe is a remote-first company with an international team. We continue to provide opportunities for personal and professional growth, value autonomy and responsibility, have a results-driven environment, and offer flexible work hours.</p>\n<p>We care deeply about <a href=\"https://chainsafe.io/corevalues\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">our values</a> and look for these attributes in every new team member. In addition, we recognize the benefits of cultivating a diverse team and aspire to embed respect for all people into our culture. We encourage women, the LGBTQIA+ community, people of colour, and members of any other group underrepresented in the blockchain space (or tech in general) to apply.</p>\n<p><strong>How to Apply</strong></p>\n<p>Please fill out the Greenhouse application form below and ensure that you attach your resume and link your Github/Gitlab profile or any software project you have contributed to (if applicable).</p><p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/non-tech\">Non Tech Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/marketing\">Marketing Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/research\">Research Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/community\">Community Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/content\">Content Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/developer\">Developer Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/engineering\">Engineering Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/rust\">Rust Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/discord\">Discord Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/typescript\">Typescript Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/polkadot\">Polkadot Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/solidity\">Solidity Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/devrel\">Devrel Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/ethereum\">Ethereum Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-04T02:11:22.525Z",
    "companyId": 54
}