{
    "id": "629033956a0e15000406e073",
    "title": "DevOps Engineer",
    "slug": "devops-engineer-art-blocks-remote",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "devops",
        "developer",
        "engineering",
        "web3",
        "python",
        "javascript",
        "typescript",
        "data",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Remote",
    "applyLink": "https://jobs.lever.co/ArtBlocks/4e52826d-da65-4816-b126-d0d89a9097f1/apply",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p>Art Blocks is a first of its kind platform focused on genuinely programmable on demand generative content that is stored immutably on the Ethereum Blockchain. Our team is a group of passionate builders focused on creating the best ecosystem for on-chain generative content. We are moving rapidly to create the platform for all kinds of generative design projects. To learn more about what we are building, please visit <a href=\"https://artblocks.io/learn\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">artblocks.io/learn</a>, follow us on Twitter (<a href=\"https://twitter.com/artblocks_io\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">twitter.com/artblocks_io</a>), or come hang out in our community Discord (<a href=\"http://discord.gg/artblocks\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">discord.gg/artblocks</a>).Art Blocks has multiple openings for curious and collaborative engineers who are excited about digital ownership and generative art. We are looking for candidates who are team oriented that treat each other with kindness and respect. We are looking to fill roles for engineers with varying prior experience levels–your exact level of experience is less important to us than your general aptitude to tackle hard problems, your desire to learn, your ability to work within a fast paced environment, and your willingness to collaborate as a team player.This position is a remote position–we’re looking for the best candidates to join our team regardless of location (though currently we are only able to hire candidates within the United States).<h3>Potential Projects</h3><ul><ul><li>Working to scale out the Art Blocks Processing pipeline to process terabytes of data per day across the many partners who have deployed AB projects.</li><li>Building reliable, performant backend services and APIs, both for internal use as well as the many third parties who rely on this data (OpenSea, OnCyber, Deca, Gallery, etc.)</li><li>Researching new integrations into our pipeline to expand the rendering capabilities that Artists can utilize.</li></ul></ul><h3>Responsibilities</h3><ul><ul><li>Develop and deliver on new backend features and technical infrastructure investments.</li><li>Document and maintain software and technical infrastructure.</li><li>Prioritize testability and reliability for both existing and new systems and components.</li><li>Collaborate with other engineers and stakeholders to deliver on reliable services, APIs and other critical backend needs.</li></ul></ul><h3>Base Requirements</h3><ul><ul><li>Bachelor&#39;s degree in Computer Science, Software Engineering, or a related field <b>OR </b>relevant experience developing and shipping software products.</li><li>1 year of professional experience as a programmer, software engineer, data scientist, or similar role.</li><li>Experience with one or more object oriented programming language (e.g. JavaScript, Java, Python, etc.).</li><li>Solid communication and collaboration skills.</li><li>Highly adaptable and willing to work on a wide variety of projects and initiatives.</li><li>Passion for generative art, digital ownership, or the benefits of decentralization–ideally all of the above!</li></ul></ul><h3>Preferred Qualifications</h3><ul><ul><li>Experience scaling modular architectures and pipelines</li><li>Experience working with and building containerized applications/services (Docker, Kubernetes)</li><li>Experience with a variety of AWS products, namely: Step Functions, ECS (or EKS), Lambda, API Gateway.</li><li>Excited about Infrastructure as Code, CI/general automation around DevOps, deployment and testing. </li></ul></ul><h3>Benefits</h3><ul><ul><li>Competitive salary, bonus, and equity.</li><li>Health/vision/dental insurance, STD, LTD, life insurance.</li><li>Competitive parental leave.</li><li>Unlimited PTO: take time when you need it, but we’ll require that you take at least 20 days of PTO per year (plus 9 company holidays).</li><li>Flexible hours and a supportive remote work environment.</li><li>2 company in-person team offsite meet-up weeks per year.</li><li>Company provided WFH setup (laptop, monitor, headphones, keyboard, etc.) to make sure you have the hardware and tools needed to do great work.</li><li>Participation in an organization that has facilitated over $20 million dollars in charitable giving.</li></ul></ul><h3>Tech Stack</h3><ul><ul><li>Next.js</li><li>React</li><li>Node.js</li><li>Typescript</li><li>GraphQL</li><li>Hasura</li><li>The Graph</li><li>Vercel</li><li>Solidity</li><li>Infura, Alchemy</li><li>Popular web3 libraries (ethers.js, web3.js)</li><li>AWS</li><li>Github</li><li>Asana</li></ul></ul>Your experience with our specific technical stack (or any specific stack) is of secondary importance to us. We care much more about finding candidates who have solid fundamentals, general aptitude, a desire to learn, and are compassionate and collaborative people to work with. We understand that it will take time to ramp up and are excited to consider non-traditional candidates who are excited about what we are building. That said, we’re excited about the technology we’re building and our tech/productivity stack is included as a reference above.</p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/devops\">Devops Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/developer\">Developer Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/engineering\">Engineering Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/python\">Python Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/javascript\">Javascript Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/typescript\">Typescript Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/data\">Data Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-03T02:10:42.642Z",
    "companyId": 53
}