{
    "id": "64cf0135aa3e6d000291d5bb",
    "title": "Director of Core Compliance Programs",
    "slug": "director-of-core-compliance-programs-binance-ireland-dublin",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "exchange",
    "tags": [
        "exchange",
        "web3",
        "compliance",
        "director",
        "executive",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Ireland, Dublin",
    "applyLink": "https://jobs.lever.co/binance/454be22d-4547-46e8-982b-dd7d95e50b1a/apply",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>Binance is the leading global blockchain ecosystem and cryptocurrency infrastructure provider whose suite of financial products includes the world’s largest digital-asset exchange. Our mission is to accelerate cryptocurrency adoption and increase the freedom of money.If you’re looking for a fast-paced, mission-driven organization where opportunities to learn and excel are endless, then Binance is the place for you.<h3>Responsibilities:</h3><ul><ul><li>Help Binance handle complex global challenges by providing executive level leadership and problem-solving abilities</li><li>Identify chances to support and carry out business objectives by working together with executive leadership across the entire organization</li><li>Mentor, develop, and provide leadership to a team of Compliance professionals across multiple disciplines including : Monitoring &amp; Testing,  Policy &amp; Program, 3rd party Due Diligence, M&amp;A Diligence, Corporate Training, Compliance Risk Management &amp; Enterprise Wide Risk Assessments (EWRA)</li><li>Develop a Compliance Risk Management Program to cover the current and contemplated products, services, and subsidiaries working with Compliance Officers and executives globally and carry out the EWRA</li><li>Enhance the Monitoring &amp; Testing program to test the effectiveness of the Compliance Program and its key controls </li><li>Timely communicate findings and recommendations to management and stakeholders, both at periodic intervals and as needed regarding escalated or high-risk compliance issues, in order to accomplish compliance goals</li><li>Overseeing the drafting and ongoing maintenance of robust policies and procedures</li><li>Enhance our exam and audit management program to ensure consistency in communication with all stakeholders globally</li></ul></ul><h3>Requirements</h3><ul><ul><li>Prior experience as a Head of Compliance/Compliance Officer, MLRO, or similar role</li><li>Significant experience in a previous regulatory or compliance managerial position at a fintech company or global financial institution</li><li>Skilled in collaborating with stakeholders at all levels</li><li>Experience and/or passion for crypto preferred</li></ul></ul><b>Working at Binance</b>• Be a part of the world’s leading blockchain ecosystem that continues to grow and offers excellent career development opportunities.• Work alongside diverse, world-class talent in an environment where learning and growth opportunities are endless.• Tackle fast-paced, challenging and unique projects.• Work in a truly global organization, with international teams and a flat organizational structure.• Competitive salary and benefits.• Balance life and work with flexible working hours and casual work attire.Learn more about how Binancians embody the organization’s <a href=\"https://www.binance.com/en/blog/ecosystem/what-exactly-is-binances-culture-5487396240897265423\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">core values</a>, creating a unified culture that enables collaboration, excellence, and growth. Apply today to be a part of the Web3 revolution! Binance is committed to being an equal opportunity employer. We believe that having a diverse workforce is fundamental to our success. <i>By submitting a job application, you confirm that you have read and agree to our </i><a href=\"https://www.binance.com/en/candidate/privacy/notice\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\"><i>Candidate Privacy Notice</i></a><i>.</i></p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/exchange\">Exchange Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/compliance\">Compliance Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/director\">Director Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/executive\">Executive Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-06T03:00:00.071Z",
    "companyId": 10
}