{
    "id": "6477fe1303fc2100026693da",
    "title": "Director of Total Rewards",
    "slug": "director-of-total-rewards-moonpay-uk-eu",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "web3",
        "director",
        "data",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "UK, EU",
    "applyLink": "https://boards.greenhouse.io/moonpay/jobs/5632370003#app",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>The Head of Total Rewards will be key in ensuring our Reward strategy supports our company goals and  MoonPay’s overall mission to onboard the world to web3.</p>\n<p>Managing all of MoonPay’s compensation, benefits and equity programs globally, the Head of Total Rewards performs best and delivers at speed, in a fast paced and dynamic environment. </p>\n<h3>What you’ll do 👀 </h3>\n<ul>\n<li>Develop and implement a Total Rewards strategy and compensation principles that align with, and support, MoonPay’s broader company strategy.</li>\n<li>Use industry insights, trends, and benchmarking to provide expert guidance and deliver global Reward related programs (including salary, equity and benefits) that help MoonPay to recruit and retain the best Talent.</li>\n<li>Establish and measure key metrics, benchmarking company programs and monitoring external trends to ensure market competitiveness while ensuring internal equity.</li>\n<li>Apply analytics to drive better decision-making and increase impact of our Reward programs.</li>\n<li>Develop and maintain effective communication strategies to drive employee awareness and understanding of Total Reward programs.</li>\n<li>Build relationships with Department Leads to ensure alignment between Reward strategy and Talent Management objectives, whilst optimizing our workforce and helping to drive productivity.</li>\n<li>Manage brokers in delivering on target renewal bids that meet the needs and cost structure of the organization.</li>\n<li>Build out MoonPay’s job leveling framework to provide clarity on career development across MoonPay’s departments.</li>\n<li>Providing hands-on operational support globally, including handling day to day Reward queries, reporting and analytics, where required</li>\n</ul>\n<h3>You should apply if you have ✅ </h3>\n<ul>\n<li>Experience delivering scalable Reward programs in a Global Tech environment (spanning compensation, benefits and equity)</li>\n<li>Flexibility to adapt to changing priorities and business needs, and adopt a problem-solving approach when dealing with ambiguity</li>\n<li>Strong proficiency in Excel and working with data</li>\n<li>Strong interpersonal skills, and can communicate effectively across all levels of an organization</li>\n<li>Able to work autonomously, exercising sound judgment, whilst also being a strong team player</li>\n</ul>\n<h3>Logistics ⚒️</h3>\n<p>Unfortunately, we are unable to offer visas of any kind at this time!</p>\n<p>Our interview process takes place on Zoom and consists of the following stages:</p>\n<ul>\n<li>Initial interview (30-45 minutes)</li>\n<li>Remote take-home task</li>\n<li>Virtual Onsite (2-3 30 minute interviews)</li>\n<li>Final interview (30 minutes)</li>\n</ul><p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/director\">Director Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/data\">Data Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>.</p>",
    "createdOn": "2023-08-03T02:10:31.213Z",
    "companyId": 51
}