{
    "id": "64df996756c15d0002355d20",
    "title": "Engineering Manager, Blockchain Integrations",
    "slug": "engineering-manager-blockchain-integrations-chainlink-labs-remote",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "research",
        "security",
        "business-development",
        "developer",
        "engineering",
        "web3",
        "golang",
        "python",
        "typescript",
        "defi",
        "finance",
        "manager",
        "data",
        "move",
        "full-time"
    ],
    "compensationMin": null,
    "compensationMax": null,
    "location": "",
    "applyLink": "https://jobs.lever.co/chainlink/6d181c9c-948f-4fb3-9407-6036e2816526?lever-origin=applied&lever-source%5B%5D=CryptoJobsList.com",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p><em>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST). We encourage you to apply regardless of your location. </em>\n \n<strong>About Us</strong> \nChainlink is the industry-standard Web3 services platform that enables developers to build feature-rich Web3 applications with seamless access to real-world data and off-chain computation.\n \n• Chainlink has helped enable $8T+ in transaction value since the start of 2022.\n• Over 1,700 Web3 projects have integrated Chainlink services.\n• Chainlink is live on 15+ blockchains with many having joined the Chainlink SCALE program.\n• Chainlink is relied upon by industry-leading protocols like Aave, Compound, Paxos, Synthetix, and ENS.\n• Chainlink has delivered 7.4B+ data points on-chain and onboarded 900+ decentralized oracle networks.\n• Chainlink has established collaborations with Associated Press, Accuweather, AWS, Google Cloud, Meta, and Twilio.\n• The world-class Chainlink Labs research team has won various awards for its work on distributed systems, security, and more.\n \n<strong>Who we’re looking for: </strong>\n• You’re focused on what matters most and ignore unimportant industry distractions. \n• You take extreme ownership and deliver outstanding results. \n• You have a growth mindset, seek out feedback and engage in constructive dialogue with others to help them grow.\n• You move fast and evolve with rapidly advancing technologies. \n• You want to be part of a team that excels and is committed to building the Chainlink Network and growing the Web3 ecosystem over the long term. \n• You are welcoming toward a diverse network of participants joining an open, global standard.\n• You’re excited about the future of Web3 and building a world powered by cryptographic truth. \n \nAt Chainlink Labs, our engineering team pushes the scale and capabilities of decentralized applications across the industry. The Chainlink Network holds &gt;70% market share in the oracle space, solving real-world problems by enabling smart contracts to securely interact with off-chain data/computation.\n \nWe value talented and driven craftsmen who work collaboratively to tackle complex challenges, deliver product impact, and grow as builders. Join us and shape the future of blockchain technology and decentralized finance. \n \nWe are looking for a Blockchain Integrations Engineering Manager who can keep business development in mind while managing our relationships with various blockchains. Our integrations team is tasked with growing Chainlink, and this role has tremendous growth potential as we rapidly expand our coverage of any/all blockchains\n \nYou are the technical leader on all integration discussions, responsible for supporting and managing integration partners as a member of an inclusive, and multi-functional team. For our partners, you act as a trusted sparring partner helping them from building their business case, managing the integration, to finalizing the rollout of their integration into the Chainlink platform.\n </p>\n<h3>Your Impact</h3>\n<ul>\n<ul>\n<li>Lead and manage a team of software engineers, setting clear goals, managing project timelines, and maintaining team cohesion and morale.</li>\n<li>Proactively monitor integration performance and troubleshoot issues. You will surface the issues and work to make/recommend changes (where needed) and reach a resolution</li>\n<li>Execute on the roadmap and plan for launching Chainlink onto additional blockchains</li>\n<li>Nurture relationships with key stakeholders of other blockchains</li>\n<li>Contribute technically to projects, including code reviews and occasionally coding.</li>\n<li>Participate in the hiring and onboarding process to ensure we're bringing on high-quality engineers who fit our culture and requirements.</li>\n</ul>\n</ul>\n\n\n\n\n<h3>Requirements</h3>\n<ul>\n<ul>\n<li>Minimum of 6 years experience in software engineering, with at least 2 years in a leadership or managerial role.</li>\n<li>You have a commercial mindset and are driven by results and has a passion for solving tough problems</li>\n<li>An excellent communicator that is able to collaborate closely with internal and external partners on a broad range of technical and business topics</li>\n<li>Servant leadership and a natural ability to inspire and motivate others</li>\n<li>Ability to work on a globally-distributed team with a high degree of ownership</li>\n<li>Experience coordinating technical stakeholders, multiple blockchains, solutions architecture, people skills, and tech side</li>\n<li>Proficiency in Golang, Python, and/or TypeScript</li>\n</ul>\n</ul>\n\n\n\n\n<h3>Preferred Requirements</h3>\n<ul>\n<ul>\n<li>Technical and/or product management experience on a blockchain project</li>\n<li>Experience or interest in the blockchain or crypto space</li>\n</ul>\n</ul>\n\n\n\n<p><strong>Privacy Policy and an Equal Opportunity Employer: </strong>\nChainlink Labs is an Equal Opportunity Employer. To request an accommodation in our recruitment process, please contact us at .\n \nPlease see our <a href=\"https://chainlinklabs.com/privacy-policy\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Privacy Policy</a> for more information about how we collect and use your application information.</p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/research\">Research Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/security\">Security Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/business-development\">Business Development Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/developer\">Developer Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/engineering\">Engineering Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/golang\">Golang Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/python\">Python Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/typescript\">Typescript Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/defi\">DeFi Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/finance\">Finance Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/manager\">Manager Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/data\">Data Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/move\">Move Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-19T00:55:02.694Z",
    "companyId": 11
}