{
    "id": "64cc5e2ca935960002d96926",
    "title": "Executive Assistant to the CEO",
    "slug": "executive-assistant-to-the-ceo-subspace-labs-palo-alto-ca",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "non-tech",
        "content",
        "business-development",
        "engineering",
        "web3",
        "social-media",
        "executive",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Palo Alto, CA",
    "applyLink": "https://jobs.lever.co/subspacelabs/991f00e2-c478-4fe7-ac80-62cc84d788d7/apply",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>We are seeking an experienced Executive Assistant with a non-traditional background, preferably in CoStaff, project, product, or engineering roles, to support the CEO and Founder of multiple rapidly expanding startup organizations across AI, Web3, and the Metaverse. The ideal candidate should be equipped to navigate the immediate and growing needs of these organizations, displaying a solid technical background in these technologies and familiarity with the market landscape. The successful candidate will be self-motivated, solution-oriented, smart, articulate, results-driven, analytical, and not tied to titles or role specificities. You will demonstrate a strong attention to detail, while actively documenting and sharing your work. This role requires someone willing to go above and beyond, working extended hours and traveling up to two weeks out of each month.<b>Note: </b>WhileSubspace Labs is a fully-remote company and most day-to-day work can be completed remotely, candidates must be located within regular commuting distance from Palo Alto, CA, in order to complete tasks related to our Stanford Hacker House (or willing to relocate; however we cannot guarantee relocation assistance).<h3>In this position you will:</h3><ul><ul><li>Utilize your technical background to provide comprehensive support across various projects related to blockchain, AI, and the metaverse.</li><li>Showcase exceptional project and product management skills by leading and executing across a wide range of initiatives with minimal guidance.</li><li>Attend all meetings with the founder, documenting action items and ensuring thorough follow-ups across the organization.</li><li>Organize and run meetings on behalf of the founder, ensuring seamless communication and timely completion of objectives.</li><li>Attend industry conferences, with and without the founder, while evaluating, prioritizing, and managing  business development opportunities.</li><li>Proactively assume direct responsibility for tasks without delegation, demonstrating capacity as a strong individual contributor.</li><li>Assist with writing long-form technical content and blog posts on behalf of the founder, ensuring accuracy and relevance.</li><li>Manage the founder’s social media presence, curating and producing engaging content that aligns with his personal and professional brands.</li><li>Oversee the founders calendar, arranging flights, booking hotels, and managing the daily agenda to ensure optimal productivity.</li><li>Provide ‘Office Management’ as needed for our Hacker House and support a variety of Personal Assistant tasks. </li></ul></ul><h3>Key Requirements:</h3><ul><ul><li>A strong technical understanding of blockchain, AI, and the metaverse.</li><li>An up to date knowledge of the market landscape for the above industries.</li><li>Detail-oriented approach with excellent organizational skills.</li><li>Proactive, anticipating needs and taking initiative without being prompted.</li><li>Proficient in project or product management and relevant software tools.</li><li>Excellent written and verbal communication skills.</li><li>Ability to manage and prioritize a plethora of competing tasks efficiently.</li><li>Active on twitter, following thought leaders, while posting your reactions.</li><li>Willingness to travel and work extended hours as required.</li><li>Strong track record as an individual contributor. </li></ul></ul><h3>Bonus Experience:</h3><ul><ul><li>Experience working with a remote-first, open-source engineering organization.</li><li>Experience working at an early stage startup in Web3, AI, or the Metaverse</li><li>Experience supporting an Engineering leader or CTO.</li><li>Experience working with tools such as Notion, Trello, Asana, Lucid, and Figma</li></ul></ul><h3>What We Offer:</h3><ul><ul><li>A competitive salary with generous equity and token grants.</li><li>Medical, dental, and vision insurance.</li><li>A unique opportunity to shape the future of several early stage projects</li><li>Team offsites in various locations around the world. </li></ul></ul><b>What We Offer</b>The ability to work from anywhere in the world 𐄁 A competitive salary with generous equity and token grants 𐄁 Medical, dental, and vision insurance (US-based only) 𐄁 A unique opportunity to shape the future of the 𐄁 Subspace Network and grow into a long term leadership role at Subspace Labs 𐄁 Team offsites in various locations around the globe</p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/non-tech\">Non Tech Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/content\">Content Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/business-development\">Business Development Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/engineering\">Engineering Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/social-media\">Social Media Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/executive\">Executive Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>.</p>",
    "createdOn": "2023-08-04T03:00:00.059Z",
    "companyId": 58
}