{
    "id": "647aa2de519f4f0002e06744",
    "title": "Front End Engineer",
    "slug": "front-end-engineer-aptos-palo-alto",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "content",
    "tags": [
        "content",
        "full-time",
        "developer",
        "web3",
        "react",
        "javascript",
        "typescript",
        "frontend"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Palo Alto",
    "applyLink": "https://boards.greenhouse.io/aptoslabs/jobs/4249483005#app",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p><strong>About the role:</strong></p>\n<p>We are searching for a Front End Engineer to join us here at Aptos. As part of the Ecosystem team, you will be working on various projects and frameworks to foster a thriving developer ecosystem. You will build industry-leading Web applications and tools for interacting with the Web3 world from Web.</p>\n<p>The scope is open-ended, but projects will be in the following areas: interactive Web sites, developer tooling, SDKs, wallets, APIs, standards &amp; protocols, and much more.</p>\n<p><strong>What you’ll be doing:</strong></p>\n<ul>\n<li>Build new Web3 experiences for ecosystem engagement</li>\n<li>Add new features and integrations into existing experiences</li>\n<li>Build new Web products and applications for Aptos</li>\n<li>Support and maintain existing platforms and web surfaces</li>\n<li>Write performant, clean and tested code</li>\n<li>Collaborate with designers, backend engineers, and other frontend engineers</li>\n</ul>\n<p><strong>We’re looking for:</strong></p>\n<ul>\n<li>5+ years experience in a similar role</li>\n<li>Experienced with Javascript, Typescript, React</li>\n<li>Familiarity with websockets/streaming content is a plus</li>\n<li>UX/UI Design experience is a plus</li>\n<li>Experience working with Web3 is a plus</li>\n<li>Self-motivated, proactive, and organized</li>\n</ul>\n<p><em>The base salary range for this full-time position is $150k - $250k. The range displayed on each job posting reflects the minimum and typical maximum target for new hire salaries for the position of a candidate based in the Bay Area at any level. We do hire exceptionally talented professionals with decades of experience in their field. As such, our range may be higher than what is displayed. Our base salary ranges are determined by experience and location, and we hire at all levels for multiple roles. Within the range, individual pay is determined by work location, job-related skills demonstrated during the interviews, working experience, and relevant education or training. Please note that the compensation details listed in role postings reflect the base salary only and do not include equity, tokens, or benefits.</em></p><p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Cryptocurrency Jobs</a>, <a href=\"https://cryptojobslist.com/content\">Content Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/developer\">Developer Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/react\">React Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/javascript\">Javascript Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/typescript\">Typescript Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/frontend\">Frontend Web3 Jobs</a>.</p>",
    "createdOn": "2023-08-04T02:10:54.883Z",
    "companyId": 56
}