{
    "id": "63d878f8f0fb5b0004fe6dd3",
    "title": "Global Head of Business Development &amp; Partnerships (Remote)",
    "slug": "global-head-of-business-development-amp-partnerships-remote-metaschool-singapore",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "content",
        "business-development",
        "polygon",
        "web3",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Singapore",
    "applyLink": "https://metaschool.freshteam.com/jobs/_h8kuVyfuu_0/global-head-of-business-development-partnerships-remote",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p>Metaschool is looking for a Global Business Dev and Partnerships Head to identify, partner with, and help blockchain companies bring more devs in the web3 ecosystem through metaschool. </p><p>There are 30M developers in the world but only 24k devs are actively contributing to the web3 ecosystem as of now. Blockchain and protocol companies need more devs in web3 to survive and thrive. metaschool helps these companies by building fun, free and exciting projects for web2 devs to propel to web3. Find this exciting? Keep reading.</p><p>Working at Metaschool</p><p>Metaschool produces courses for devs to build, ship, and learn web3. We have over 70K devs signed up from 50+ countries within 5 months of launch.</p><p>We’re a decentralized, remote-first company with teammates based in Singapore, India, and Pakistan (for now 😉). We are divided by borders but our common mission to help devs build and flourish in the web3 ecosystem has brought us very close. If you are in any timezone of Asia and are a web3 native, we would love to have you onboard. </p><p>Our Values</p><ul><li>Buidl dope shit! - We care about what you have built, not your degrees or MAANG experience.</li><li>Stay weird -  Own yourself, be yourself! Diversity is our strength! </li><li>Improve daily - Daily efforts compound. Don’t underestimate them.</li><li>Developers come first - We are building for devs. Put them first, always!</li><li>Learners for life - Leave your ego outside, learn whenever you can.</li><li>Collaborate to win - If you want to go far, collaborate and go with a team.</li></ul><p>The Role</p><p>This role is super important for Metaschool. This is the first time we are going to onboard an individual for business development and partnerships. You will be working independently with help from Fama and other teammates who have been driving business development previously. </p><p>An example of a Business Dev activity could be:</p><ol><li>A partnership between Metaschool and Polygon to create a learning path around their infrastructure to help devs embrace their network. You will own the process of reaching out to stakeholders at Polygon, pitching them the idea, closing the partnership, and then helping the devs at Metaschool execute the partnership scope.</li><li>A partnership between Metaschool and a Web3 Conference where we will help them with dev participation from our platform. You will own the process of reaching out to the conference organizers, pitching them a partnership, and then taking the help of teammates to execute that. </li><li>Traveling to Singapore, Dubai, India, US and meeting with web3 company founders, building relationships with them, and figuring out unique ways to add them as a Metaschool partner. Business is for one time, friendship is eternal! </li></ol><p>You</p><p>We don’t have a straightforward answer to what is the ideal profile for this position but we believe an ideal person to lead this role will: </p><ul><li>Be a web3 advocate</li><li>Doesn’t like repetition and can automate the basic stuff</li><li>Be tech savvy (duh)</li><li>Loves to go out, make web3 frens and meet companies</li><li>Come up with unique content ideas in the web3 space</li><li>Loves to travel and/or lives on Zoom</li><li>Has nurtured some kickass web3 relationships in the past</li><li>Embraces chaos!</li></ul><p>If any of the above doesn’t apply to you and you still strongly feel you can do it. Don’t let us stop you.. Please apply for the opportunity.</p><p>Perks</p><p>We have an essential mission to help devs enter web3 and bring the power back to the individuals. At Metaschool, you will have exposure to the product, business, growth, technology, and everything in between. Additionally, you will get:</p><ul><li>Competitive Salary</li><li>Generous Equity</li><li>Health Insurance </li><li>Paid Time off</li><li>Macbook + Workstation Allowance</li><li>Multiple Tech subscription(s) to make your life easier</li><li>And an amazing bunch of weird frens!!</li></ul><p>We are so excited to see you around. Don’t forget to apply.</p><p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/content\">Content Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/business-development\">Business Development Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/polygon\">Polygon Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>.</p>",
    "createdOn": "2023-08-07T02:11:10.378Z",
    "companyId": 60
}