{
    "id": "63d878f6f0fb5b0004fe6dcf",
    "title": "Graphic Designer (Remote)",
    "slug": "graphic-designer-remote-metaschool-singapore",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "marketing",
        "web3",
        "discord",
        "designer",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Singapore",
    "applyLink": "https://metaschool.freshteam.com/jobs/whK-YXGFd1wS/graphic-designer-remote",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p>Metaschool is looking for a Graphic Designer to turn ideas and verbiage into visually engaging, marketable communication for our current and potential dev audience. </p><p>There are 30M developers in the world but only 24k devs are actively contributing to the web3 ecosystem as of now. Blockchain and protocol companies need more devs in web3 to survive and thrive. Metaschool helps these companies by building fun, free and exciting projects for web2 devs to propel to web3. Find this exciting? Keep reading.</p><p>Working at Metaschool</p><p>Metaschool produces courses for devs to build, ship and learn web3. We have over 70K devs signed up from 50+ countries within 5 months of launch.</p><p>We’re a decentralized, remote-first company with teammates based in Singapore, India and Pakistan (for now 😉). We are divided by borders but our common mission to help devs build and flourish in the web3 ecosystem has brought us very close. If you are in any timezone of Asia and are a web3 native, we would love to have you onboard. </p><p>Our Values</p><ul><li><p>Buidl dope shit! - We care about what you have built, not your degrees or FAANG experience.</p></li><li><p>Stay weird -  Own yourself, be yourself! Diversity is our strength! </p></li><li><p>Improve daily - Daily efforts compound. Don’t underestimate them.</p></li><li><p>Developers come first - We are building for devs. Put them first, always!</p></li><li><p>Learners for life - Leave your ego outside, learn whenever you can.</p></li><li><p>Collaborate to win - If you want to go far, collaborate and go with a team.</p></li></ul><p>The Role</p><p>We’ve tried hiring for this role multiple times, like on 5 separate occasions. Till now our team member Sinwan, who doesn’t have a degree in design, has been creating designs for us but she’s got other stuff to do and would really like someone to come in and completely manage this role. You’ll be in charge of setting up the entire design function (cuz we don’t have one yet) and create some of the most bomb creatives for Metaschool. Our audience engages with us on Discord, blogs, emails &amp; socials and for that we need some cool creative material coming in regularly. Moreover, we’ve got NFTs to give out every month - and for that we need someone who comes with fresh design ideas and delivers them. </p><p>Our Graphic Designer can possibly: </p><ul><li><p>Participate in the creative ideation process, lead in bringing new ideas to the table and offering a fresh perspective on pre-existing themes &amp; concepts</p></li><li><p>Work with the marketing team to build effective, direct-response ads that cater to various user personas on different platforms &amp; take initiative to understand how individual creatives perform and if they are impacting metrics, learn from it and adjust accordingly</p></li><li><p>Have knowledge of the web3 space and what visuals + themes are trending in order to take inspiration and incorporate them into our designs </p></li><li><p>Create the dopest and memorable NFTs that tie in with the Metaschool brand and keep devs coming back for more</p></li><li><p>Organize monthly creative calendars with relevant team members, as well as be able to (sometimes) accommodate short notice requests</p></li></ul><p>YOU:</p><ul><li><p>Be the coolest, raddest designer out there, even if not on paper</p></li><li><p>Have a clear understanding of the web3 space</p></li><li><p>Be a solid communicator and take feedback like a boss</p></li><li><p>Ideate, draft and create the coolest set of icons, graphics, illustrations known to the web3 space (hey, no pressure!!)</p></li><li><p>Own the process and function from start to finish</p></li><li><p>Be a learner at heart and stay updated on all the newest design concepts and developments making it online</p></li><li><p>Know and have considerable experience in Adobe Photoshop, InDesign, Illustrator and (bonus) Figma!</p></li><li><p>Bonus: know your way around motion graphics or willing to learn!</p></li></ul><p>If any of the above doesn’t apply to you and you still strongly feel you can do it. Don’t let us stop you.. Apply for the opportunity.</p><p>Perks</p><p>At Metaschool, you will have exposure to product, business, growth, technology and everything in between. Additionally, you will get:</p><ul><li><p>Competitive Salary</p></li><li><p>Generous Equity</p></li><li><p>Health Insurance </p></li><li><p>Paid Time off</p></li><li><p>Macbook + Workstation Allowance</p></li><li><p>Multiple Tech subscription(s) to make your life easier</p></li><li><p>And an amazing bunch of weird frens!!</p></li></ul><p>We are so excited to see you around. Please reach out to us and we’d be happy to speak to you. </p><p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/marketing\">Marketing Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/discord\">Discord Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/designer\">Designer Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>.</p>",
    "createdOn": "2023-08-07T02:11:10.311Z",
    "companyId": 60
}