{
    "id": "64a773f99686f60002edc6a9",
    "title": "Growth Marketing Manager",
    "slug": "growth-marketing-manager-uniswap-labs-new-york-new-york-united-states",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "non-tech",
    "tags": [
        "non-tech",
        "marketing",
        "content",
        "full-time",
        "web3",
        "social-media",
        "defi",
        "manager",
        "data"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "New York, New York, United States",
    "applyLink": "https://boards.greenhouse.io/uniswaplabs/jobs/4291728005#app",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>We are seeking an experienced Growth Marketer to join our team and drive the growth of our consumer web and mobile app. You will be responsible for developing and executing strategies to acquire and retain users, increase engagement, and optimize conversion rates.</p>\n<p>This role requires a strong background in digital marketing, including expertise in running paid ads, as well as experience managing agency relationships. An added bonus if this individual has experience with designing and running affiliate and incentive based campaigns as well. The ideal candidate should be highly analytical, creative, and results-driven. </p>\n<p><strong>Responsibilities: </strong></p>\n<ul>\n<li>Drive new users through paid digital marketing channels: social media advertising, digital ad networks and search ads. This includes running and optimizing always on campaigns, and supporting integrated campaigns.</li>\n<li>Conduct thorough analysis of campaign performance and optimize ads to improve key metrics, including conversion rates, click-through rates, and return on ad spend.</li>\n<li> Manage relationship with external agency to align paid marketing initiatives with overall marketing goals and KPIs. </li>\n<li>Continuously test and iterate on marketing strategies, messaging, and creative assets to drive user acquisition. This includes managing app store presences and SEO optimization of website landing pages. </li>\n<li>Collaborate with internal teams, including product, design, and content, to align marketing campaigns and landing pages with overall marketing goals and company brand guidelines </li>\n<li>Collaborate with cross-functional teams to develop, manage, and execute affiliate campaigns and incentive-based programs that align with overall growth goals and strategies. </li>\n<li>Track and report key performance indicators (KPIs) across all acquisition channels and provide regular updates to the management team, highlighting successes, challenges, and recommendations. Work with data to implement proper acquisition attribution. </li>\n<li>Monitor and analyze user behavior, market trends, and competitor activities to identify growth opportunities and provide actionable insights. </li>\n</ul>\n<p><strong>Requirements: </strong></p>\n<ul>\n<li>Experience 5-7 years experience as a Growth Marketer or similar role, preferably in the consumer web and mobile app space. </li>\n<li>A track record of running successful paid campaigns (hands on execution). </li>\n<li>Experience managing agency relationships and coordinating external partners to achieve marketing objectives. </li>\n<li>Strong analytical skills and the ability to derive actionable insights from data to drive decision-making. Solid understanding of A/B testing methodologies and conversion rate optimization (CRO) techniques. </li>\n<li>Proficiency in using digital marketing tools and platforms, such as Google Ads, Facebook Business Manager, and marketing automation tools. </li>\n<li>Experience with product and business analytics tools such as Amplitude </li>\n<li>Excellent written and verbal communication skills, with the ability to effectively communicate complex ideas and strategies. </li>\n<li>Creative mindset with a demonstrated ability to think outside the box and develop innovative marketing campaigns. </li>\n<li>Strong project management skills with the ability to prioritize and manage multiple initiatives simultaneously. </li>\n<li>Exceptional communication and interpersonal skills. </li>\n<li>Self-motivated and able to work both independently and collaboratively in a fast-paced, dynamic environment. </li>\n</ul>\n<p><strong>Nice to Have </strong></p>\n<ul>\n<li>Consumer fintech experience </li>\n<li>Web3 or DeFi specific experience</li>\n</ul>\n<p><em>Minimum full-time salary of $130,000-$145,000. Disclosure in accordance with New York City's Pay Transparency Law. Full Time employees at Uniswap Labs are also eligible for other compensation elements, including equity, tokens, and benefits, dependent on the position type.</em></p><p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/non-tech\">Non Tech Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/marketing\">Marketing Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/content\">Content Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/social-media\">Social Media Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/defi\">DeFi Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/manager\">Manager Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/data\">Data Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-07T02:10:17.929Z",
    "companyId": 59
}