{
    "id": "6477fead03fc210002669408",
    "title": "Head of Infrastructure",
    "slug": "head-of-infrastructure-chainsafe-systems-remote",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "research",
        "community",
        "security",
        "developer",
        "engineering",
        "web3",
        "rust",
        "typescript",
        "polkadot",
        "ethereum",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Remote",
    "applyLink": "https://boards.greenhouse.io/chainsafesystems/jobs/4899158004#app",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p><a href=\"http://chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">ChainSafe</a> is a leading blockchain research and development firm specializing in infrastructure solutions for the decentralized web. Alongside its contributions to significant ecosystems such as Ethereum, Polkadot, Filecoin, and more, ChainSafe creates solutions for developers across the web3 space utilizing our expertise in <a href=\"http://gaming.chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">gaming</a>, <a href=\"https://chainbridge.chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">bridging</a> and <a href=\"http://storage.chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">decentralized storage.</a> As part of the mission to build innovative products for users and better tooling for developers, ChainSafe embodies an open-source and community-oriented ethos.</p>\n<p>At ChainSafe, you’ll be part of a global remote team that believes in the community's vital importance and contributes to advancing humanity with open-source and decentralized technology. To learn more about ChainSafe, look at <a href=\"https://chainsafe.io/projects\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">our website</a> or check out our work on <a href=\"https://github.com/chainsafe\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">GitHub</a>.</p>\n<p>About our engineering</p>\n<ul>\n<li>Our progressive tech stack includes Go, Rust, and TypeScript</li>\n<li>We spearhead ecosystem projects like <a href=\"https://github.com/ChainSafe/lodestar\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Lodestar</a>, <a href=\"https://github.com/ChainSafe/web3.js\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Web3.js</a>, <a href=\"https://github.com/ChainSafe/forest\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Forest</a>, and <a href=\"https://github.com/ChainSafe/gossamer\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Gossamer</a></li>\n<li>Service provider in the decentralized software ecosystem where we successfully manage a couple of thousand production nodes and 10x more testnet nodes.</li>\n<li>We are global, remote-friendly, and open to contractors</li>\n</ul>\n<p><strong>Who we need</strong></p>\n<p>The <strong>Head of Infrastructure</strong> will be responsible for the overall management and prosperity of our technology infrastructure, including server architecture, hosting, security, and reliability.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Develop and implement a comprehensive infrastructure strategy to support the company's growth and expansion plans</li>\n<li>Manage and lead the infrastructure team, including hiring, training, mentoring team members and building best practices</li>\n<li>Monitor and manage the infrastructure budget, ensuring alignment with business objectives</li>\n<li>Identify and recommend improvements to the infrastructure to enhance performance, scalability, and security, as well as associated monitoring, logging, reporting and alerting</li>\n<li>Establish and maintain relationships with technology vendors and service providers</li>\n<li>Develop and regularly update disaster recovery, running infrastructure maintenance and operational policies</li>\n<li>Manage team and processes to ensure reliable 24x7 delivery of our internal and external services</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>At least 5 years of solid experience in orchestrating infrastructure, with a proven track record of team management capabilities</li>\n<li>Deep knowledge of managing massive infrastructure systems, including redundancy, failovers, monitoring, real-time alerts as well as hardening and security</li>\n<li>Fluent in GNU/Linux command line, containerization, virtualization, and orchestration</li>\n<li>Excellent communication and leadership skills</li>\n<li>Ability to work independently and as part of a team</li>\n<li>Experience managing 24x7 infrastructure operational support</li>\n<li>Problem-solving attitude and service mentality</li>\n</ul>\n<p><strong>Bonus points</strong></p>\n<ul>\n<li>You are passionate about web3 and decentralized systems</li>\n<li>You have run decentralized or federated infrastructure, such as a Bitcoin, Matrix, or Mastodon clusters before</li>\n</ul>\n<p>If you feel like you’re the perfect fit for the role, please apply even if you don’t match all the requirements.</p>\n<p><strong>Hiring Steps</strong></p>\n<ul>\n<li>Selected candidates will be invited to a 15-minute screening call with one of our tech recruiters</li>\n<li>Next, candidates will be invited to a 60-minute alignment interview </li>\n<li>Then, candidates will be invited to a 60-minute technical interview </li>\n</ul>\n<p><strong>Why Join ChainSafe</strong></p>\n<p>Founded by developers for developers, ChainSafe is a remote-first company with an international team. We continue to provide opportunities for personal and professional growth, value autonomy and responsibility, have a results-driven environment, and offer flexible work hours.</p>\n<p>We care deeply about <a href=\"https://chainsafe.io/about\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">our values</a> and look for these attributes in every new team member. In addition, we recognize the benefits of cultivating a diverse team and aspire to embed respect for all people into our culture. We encourage women, the LGBTQIA+ community, people of color, and members of any other group underrepresented in the tech space to apply.</p>\n<p><strong>How to Apply</strong> Please fill out the Greenhouse application form below and ensure that you attach your resume and link your Github/Gitlab profile or any software project you have contributed to (if applicable).</p><p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/research\">Research Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/community\">Community Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/security\">Security Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/developer\">Developer Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/engineering\">Engineering Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/rust\">Rust Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/typescript\">Typescript Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/polkadot\">Polkadot Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/ethereum\">Ethereum Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>.</p>",
    "createdOn": "2023-08-03T02:10:56.800Z",
    "companyId": 54
}