{
    "id": "6274d27264848d000447ca7d",
    "title": "Internship - Development",
    "slug": "internship-development-certik-new-york-seattle-bay-area-remote",
    "jobType": [
        "INTERN"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "internship",
        "security",
        "full-time",
        "developer",
        "phd",
        "polygon",
        "web3",
        "golang",
        "compliance",
        "evm",
        "entry-level",
        "python",
        "c-plus-plus",
        "javascript",
        "data",
        "bsc"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "New York / Seattle / Bay Area / Remote",
    "applyLink": "https://jobs.lever.co/certik/2e33570a-f495-44ef-9d7d-a0c5a7fd8190/apply",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p>We are seeking talented interns to experience, contribute and grow at a fast-moving Blockchain Startup in NYC!<b>Why Us?</b>CertiK is a pioneer in blockchain security, leveraging best-in-class AI technology to protect and monitor blockchain protocols and smart contracts. Founded in 2018 by professors from Yale University and Columbia University, CertiK’s mission is to secure the web3 world. CertiK applies cutting-edge innovations from academia to enterprise, enabling mission-critical applications to scale with safety and correctness.<b>What We Expect you</b>Thriving in a fast-paced, dynamic working environment.Self-driven and passionate about cutting-edge technologies. Problem solver and fast learner with good analysis skills.Strong team-player and always willing to make a positive impact on the team. Good verbal and written communication skills.<h3>Requirements</h3><ul><ul><li>Minimum of BS degree in CS or related field. Preference is MS or PhD</li><li>Mastery of one or more backend languages: Python, Javascript(NodeJS), Golang, Ruby, Scala, Java, C/C++, etc.</li><li>Solid computer science fundamentals in object-oriented design, data structure and algorithms, computer networks, database systems, distributed systems, etc.</li><li>Excellent written communication/presentation skills, able to conduct client-facing meetings, output technical blogs addressing general/security topics, great team collaborations.</li><li>CI/CD, Docker, Git, Shell, Databases, Messaging Systems, Data Processing (Spark).</li><li>[Preferred] Fundamental knowledge and working experiences on Bitcoin, Ethereum (EVM), Cosmos or other industry-leading blockchain platforms.</li><li>[Preferred] Strong interests and focuses on security tooling developments and researches.</li></ul></ul><b>About the Company</b>One of the fastest-growing and most trusted companies in blockchain security, CertiK is a true market leader. To date, CertiK has worked with over 3,200 Enterprise clients, secured over $310 billion worth of digital assets, and has detected over 60,000 vulnerabilities in blockchain code. Our clients include leading projects such as Aave, Polygon, Binance Smart Chain, Terra, Yearn, and Chiliz.Investors = Insight Partners, Sequoia, Tiger Global, Coatue Management, Lightspeed, Advent International, SoftBank, Hillhouse Capital, Goldman Sachs, Coinbase Ventures, Binance, Shunwei Capital, IDG Capital, Wing, Legend Star, Danhua Capital and other investors.<b>Compensation</b>$2000 - $6000/month (fulltime). The exact compensation at which this job is filled will be determined by the skills and experience of qualified candidates.#blockchain#startups#hiringCertiK is proud to offer medical, vision, and dental insurance, 401(k) plan with company matching, life and accidental death and dismemberment insurance, HSA (with high deductible plan), FSA, and other benefits to all full-time employees, along with flexible paid time off and holidays. In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire. CertiK is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, creed, religion, sex, sexual orientation, gender, gender identity or expression, medical condition, national origin, ancestry, citizenship, marital status or civil partnership/union status, physical or mental disability, pregnancy, childbirth, genetic information, military and veteran status, or any other basis prohibited by applicable federal, state or local law.CertiK will consider for employment qualified applicants with criminal histories in a manner consistent with local and federal requirements.<a href=\"https://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">https://www.eeoc.gov/sites/default/files/migrated_files/employers/poster_screen_reader_optimized.pdf</a>All CertiK employees are expected to actively support diversity on their teams, and in the Company.</p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/internship\">Internship Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/security\">Security Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/developer\">Developer Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/phd\">Phd Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/polygon\">Polygon Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/golang\">Golang Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/compliance\">Compliance Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/evm\">Evm Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/entry-level\">Entry Level Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/python\">Python Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/c-plus-plus\">C++ Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/javascript\">Javascript Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/data\">Data Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/bsc\">Bsc Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-03T02:10:32.852Z",
    "companyId": 52
}