{
    "id": "64cc5e4fa935960002d9692e",
    "title": "KYC Analyst - Japan",
    "slug": "kyc-analyst-japan-binance-asia",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "non-tech",
    "tags": [
        "non-tech",
        "legal",
        "analyst",
        "operations",
        "exchange",
        "web3",
        "aml",
        "compliance",
        "kyc",
        "social-media",
        "customer-support",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Asia",
    "applyLink": "https://jobs.lever.co/binance/5340695a-7a3d-4536-b34b-63093f16bbab/apply",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>Binance is the leading global blockchain ecosystem and cryptocurrency infrastructure provider whose suite of financial products includes the world’s largest digital-asset exchange. Our mission is to accelerate cryptocurrency adoption and increase the freedom of money.If you’re looking for a fast-paced, mission-driven organization where opportunities to learn and excel are endless, then Binance is the place for you.At Binance, our Customer Support team is dedicated to delivering unparalleled service, going the extra mile for our <a href=\"http://users.With\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">users.With</a> their expertise in over 20 languages, the team provides exceptional round-the-clock assistance through multiple channels, including chat, email and social media. They embody our unwavering commitment to top-notch support, striving to create industry-leading experiences for our users. Their dedication helps us ensure that every user receives attention and support, reinforcing our fundamental principle of being a customer-centric platform.We are seeking a KYC/KYB Analyst to support our expansion into all global frontiers and provide support on compliance operations.<h3>Job Responsibilities </h3><ul><ul><li>Handle and review all enquiries raised by clients regarding client onboarding (Individual/Corporates).</li><li>Manage personal workload and priority items and ensure timely escalation of key risks/issues to management.</li><li>As a lead role, work closely with the Front Office and the Relationship Partner Teams and assist clients as required, to obtain all necessary supporting evidence to fulfill KYC due diligence.</li><li>Work closely with checker to ensure an effective 2 eye 4 eye customer due diligence process.</li><li>Monitor, document and escalate unusual activities or AML flags.</li><li>Participate in internal and external training programs related to AML / CFT and other subjects that may form part of the day to day work requirements.</li><li>Liaise with team leads within country and region to facilitate knowledge sharing.</li><li>Any general administration and ancillary activities as may be required and related to the above functions in accordance with the business requirements of the Company.</li></ul></ul><h3>Job Requirements</h3><ul><ul><li>At least 3-5 years directly related experience in a KYC onboarding / Compliance role with substantial knowledge of relevant rules and regulations and the day-to-day compliance affairs.</li><li>Good knowledge on provisions of local laws, directives, regulations and otherwise standards applicable to subject persons and knowledge of upcoming regulation of virtual currency policies is a strong plus.</li><li>Good proficiency in conducting risk assessments, trigger reviews and enhanced due diligence.</li><li>Proficiency in compliance applications such as Thomson Reuters World-Check,Liquid, Refenitive etc.</li><li>Strong sense of accountability and ownership over end-to-end client onboarding process (knowing different entity type is a plus).</li><li>Self-motivated, ability to multitask and work effectively under pressure and stress.</li><li>Detail-oriented with strong controls mindset and time management skills.</li><li>Strong communication skills both in Japanese and English.</li></ul></ul><b>Working at Binance</b>• Be a part of the world’s leading blockchain ecosystem that continues to grow and offers excellent career development opportunities.• Work alongside diverse, world-class talent in an environment where learning and growth opportunities are endless.• Tackle fast-paced, challenging and unique projects.• Work in a truly global organization, with international teams and a flat organizational structure.• Competitive salary and benefits.• Balance life and work with flexible working hours and casual work attire.Learn more about how Binancians embody the organization’s <a href=\"https://www.binance.com/en/blog/ecosystem/what-exactly-is-binances-culture-5487396240897265423\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">core values</a>, creating a unified culture that enables collaboration, excellence, and growth. Apply today to be a part of the Web3 revolution! Binance is committed to being an equal opportunity employer. We believe that having a diverse workforce is fundamental to our success. <i>By submitting a job application, you confirm that you have read and agree to our </i><a href=\"https://www.binance.com/en/candidate/privacy/notice\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\"><i>Candidate Privacy Notice</i></a><i>.</i></p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Cryptocurrency Jobs</a>, <a href=\"https://cryptojobslist.com/non-tech\">Non Tech Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/legal\">Legal Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/analyst\">Analyst Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/operations\">Operations Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/exchange\">Exchange Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/aml\">Aml Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/compliance\">Compliance Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/kyc\">Kyc Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/social-media\">Social Media Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/customer-support\">Customer Support Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-04T10:00:00.057Z",
    "companyId": 10
}