{
    "id": "64cc5e32a935960002d96927",
    "title": "Region Lead - South East Asia",
    "slug": "region-lead-south-east-asia-scroll-io-singapore",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "non-tech",
        "research",
        "community",
        "content",
        "web3",
        "defi",
        "ethereum",
        "zk",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Singapore",
    "applyLink": "https://jobs.lever.co/ScrollFoundation/6540534c-6ce4-47a2-a556-9512c5968bc0/apply",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>Scroll is looking for an entrepreneurial and highly motivated individual who can drive, and help lead the growth of Scroll across South East Asia.<b>About Scroll…</b>Scroll is building an open source, bytecode level compatible zkEVM layer 2 solution for Ethereum. Our mission is to scale Ethereum while maintaining our values of credible neutrality, open-ness, and execution.<h3>Duties and Responsibilities</h3><ul><ul><li>Work closely with local projects to ideate, build, and GTM.</li><li>Collaborate with Scroll’s Comms &amp; Outreach team to coordinate, organise and promote local events and hackathons.</li><li>Provide technical product education to local businesses and existing Web 3 projects.</li><li>Coordinate and originate local language content, and to build awareness.</li></ul></ul><h3>Required Skills and Experience</h3><ul><ul><li>2+ years of experience in a professional setting.</li><li>2+ years of working in the blockchain industry.</li><li>Deep understanding of the latest DeFi and On-chain product.</li><li>Strong interest in ZK and cutting edge research.</li><li>Experience running a start up.</li><li>Proven content generator, who has built influence locally.</li><li>Experience helping or facilitating other’s entrepreneurial success.</li></ul></ul><h3>About You</h3><ul><ul><li>You are interested in open source collaboration and decentralised systems.</li><li>You are highly motivated and naturally curious when it comes to helping new projects on the cutting edge of ZK, Account Abstraction, Defi, DAOs and NFTs.</li><li>You are thorough in your work and pay attention to detail.</li><li>You are skilled at communicating in a remote, global team.</li><li>You are resourceful.</li><li>You are already an active participant of the local Web3 community.</li><li>You are a great communicator who can breakdown complex ideas and easily explain to others.</li><li>You are an open-minded person who listens well, learns quickly and engages with colleagues.</li><li>You have a balanced and calm nature which allows you to navigate the ups and down of working for a growing, ever-developing web3 start-up.</li></ul></ul><i>Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#39;ll do our best to accommodate.</i></p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/non-tech\">Non Tech Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/research\">Research Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/community\">Community Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/content\">Content Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/defi\">DeFi Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/ethereum\">Ethereum Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/zk\">Zk Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-04T02:10:58.618Z",
    "companyId": 57
}