{
    "id": "63d878f7f0fb5b0004fe6dd0",
    "title": "Sales Manager",
    "slug": "sales-manager-metaschool-singapore",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "sales",
        "web3",
        "manager",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Singapore",
    "applyLink": "https://metaschool.freshteam.com/jobs/XCoQzaUCFTuQ/sales-manager",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>Metaschool is a fast growing web3 education platform for devs funded by Sequoia and Blockchain Founders Fund. The startup has acquired over 120k devs in 11 months of launch. We are looking for a high energy and passionate Sales Specialist to join our team.There are 30M developers in the world but only 24k devs are actively contributing to the web3 ecosystem as of now. Blockchain and protocol companies need more devs in web3 to survive and thrive. Metaschool helps these companies by building fun, free and exciting projects for web2 devs to propel to web3. Find this exciting? Keep reading.<strong>Working at Metaschool </strong>We’re a decentralized, remote-first company with teammates based in Singapore, India and Pakistan (for now 😉). We are divided by borders but our common mission to help devs build and flourish in the web3 ecosystem has brought us very close. If you are in any timezone of Asia and are a web3 native, we would love to have you onboard.  <p><strong>Our Values</strong></p><ul><li>Buidl dope shit! - We care about what you have built, not your degrees or FAANG experience.</li><li>Stay weird -  Own yourself, be yourself! Diversity is our strength! </li><li>Improve daily - Daily efforts compound. Don’t underestimate them.</li><li>Developers come first - We are building for devs. Put them first, always!</li><li>Learners for life - Leave your ego outside, learn whenever you can.</li><li>Collaborate to win - If you want to go far, collaborate and go with a team.</li></ul><strong>In the Role you will</strong><ul><li>Develop and implement sales strategies to achieve revenue and growth targets</li><li>Identify and pursue new business opportunities, including prospecting, networking, and lead generation</li><li>Maintain and grow relationships with existing customers, providing excellent customer service and support</li><li>Track and report on sales metrics and performance, and provide regular updates to management</li><li>Attend industry events and trade shows to network and promote the company&#39;s products and services</li></ul><strong>YOU</strong><ul><li>Hustler, entrepreneurial, energetic, negotiator, numbers oriented, and a great listener</li><li>Excited for the 0 to 1 journey of startup, wants to get into web3</li><li>Has done high ticket sales of $10K to $100K previously</li><li>At least 2-3 years of experience in sales, preferably in the tech industry</li><li>Demonstrated ability to achieve and exceed sales targets</li></ul>If any of the above doesn&#39;t apply to you and you still strongly feel you can do it. Don&#39;t let us stop you.. Please apply for the opportunity<p><strong>Perks</strong></p><p>We have an important mission to help devs enter web3 and bring the power back to the individuals. At Metaschool, you will have exposure to product, business, growth, technology and everything in between. Additionally, you will get:</p><ul><li>Competitive Salary</li><li>Generous Equity</li><li>Health Insurance </li><li>Paid Time off</li><li>Workstation Allowance</li><li>Multiple Tech subscription(s) to make your life easier</li><li>And an amazing bunch of weird frens!!</li></ul><p>We are so excited to see you around. Don’t forget to apply</p></p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Cryptocurrency Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/sales\">Sales Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/manager\">Manager Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-07T02:11:10.466Z",
    "companyId": 60
}