{
    "id": "64cc5e4aa935960002d9692d",
    "title": "Senior Agile Practitioner",
    "slug": "senior-agile-practitioner-chainsafe-systems-remote",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "non-tech",
        "research",
        "community",
        "developer",
        "engineering",
        "web3",
        "rust",
        "discord",
        "senior",
        "typescript",
        "polkadot",
        "manager",
        "ethereum",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Remote",
    "applyLink": "https://boards.greenhouse.io/chainsafesystems/jobs/4947936004#app",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p><a href=\"http://chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">ChainSafe</a> is a leading blockchain research and development firm specializing in infrastructure solutions for the decentralized web. Alongside its contributions to significant ecosystems such as Ethereum, Polkadot, Filecoin, and more, ChainSafe creates solutions for developers and teams across the web3 space utilizing our expertise in <a href=\"http://gaming.chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">gaming</a>, <a href=\"https://buildwithsygma.com/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">bridging</a>, NFTs, and <a href=\"http://storage.chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">decentralized storage.</a> As part of the mission to build innovative products for users and better tooling for developers, ChainSafe embodies an open-source and community-oriented ethos.</p>\n<p>To learn more about ChainSafe, look at our <a href=\"https://discord.com/invite/xSAwrnCWcg\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Discord</a>, <a href=\"https://github.com/chainsafe\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">GitHub</a>, and <a href=\"https://chainsafe.io/\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">website</a>.</p>\n<p><strong>Here’s what you need to know before reading on:</strong></p>\n<ul>\n<li>Our progressive tech stack includes Go, Rust, and TypeScript</li>\n<li>We spearhead ecosystem projects like <a href=\"https://github.com/ChainSafe/lodestar\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Lodestar</a>, <a href=\"https://github.com/ChainSafe/web3.js\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Web3.js</a>, <a href=\"https://github.com/ChainSafe/forest\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Forest</a>, and <a href=\"https://github.com/ChainSafe/gossamer\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Gossamer</a></li>\n<li>We are global, remote-friendly, and open to contractors</li>\n</ul>\n<p>At ChainSafe, you’ll be part of a team that believes in the community's vital importance and contributes to advancing humanity with open-source and decentralized technology.</p>\n<p><strong>Who you are</strong></p>\n<p>As a <strong>Senior Agile Practitioner,</strong> you understand yourself as an enabler of people and teams on all levels. You help establish the right mindset and culture on agile ideas and reliable delivery but you also know the importance of processes in general.</p>\n<p>You're an experienced Scrum Master and Agile Coach, but you know that Scrum is not a religion. You're an experienced Process Manager, but you know that ITIL is not the law. You bring professional processes to life, but at the same time, you know that every company is unique and that processes need to be in balance with goals, vision, and culture.</p>\n<p>ChainSafe is thriving in multiple fast-moving markets, with new developments every day. We need to adapt quickly and sometimes go unconventional ways. You will love your job if you feel comfortable in a fast-paced environment, embrace challenges as they come and enjoy bringing dynamics, growth, and stability in balance.</p>\n<p><strong>Responsibilities</strong></p>\n<ul>\n<li>Establish an agile mindset and understanding of overarching processes within the company</li>\n<li>Drive forward the cross-functional approach of our teams and initiatives and programs</li>\n<li>Implement and improve agile software development processes with our engineering teams</li>\n<li>Facilitate meetings and workshops (e.g. team building, strategy, Goals/Vision/OKRs, handling change, decision making, and conflict resolution)</li>\n<li>Lead project management rituals such as standup, sprint planning, &amp; retrospectives</li>\n<li>Define relevant metrics, help establish a conclusive reporting structure and necessary rituals, and educate stakeholders on interpreting and utilizing the metrics</li>\n<li>Work closely with Project and Product Leads, Engineering Teams and Management to keep the operational structure aligned</li>\n<li>Maintain a high level of transparency, thorough communication &amp; documentation</li>\n<li>Servant leader, fostering a collaborative and positive work environment</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Several years of experience working with and expert knowledge of Agile process frameworks, such as <strong>Scrum</strong> and <strong>Kanban</strong></li>\n<li>Demonstrated ability to introduce and optimize process frameworks in distributed environments</li>\n<li>Experience in design and implementation of processes like Risk Management, Incident Management, Problem Management</li>\n<li>Good understanding of organizational and operational structures</li>\n<li>Experience with change management and transformation projects</li>\n<li>Extremely organized, responsive, &amp; accountable</li>\n<li>Experience with OKRs, metrics and reporting concepts</li>\n<li>Excellent written &amp; verbal communication (English)</li>\n<li>High level of emotional intelligence &amp; empathy</li>\n<li>Excellent active listening skills</li>\n<li>Demonstrated ability to independently navigate and understand an organization</li>\n<li>Demonstrated ability to evaluate trade-offs and make effective decisions</li>\n</ul>\n<p><strong>Bonus points</strong></p>\n<ul>\n<li>Experience with Agile at Scale, such as Scrum@Scale or LeSS</li>\n<li>A passion for open-source software</li>\n<li>A passion for blockchain technology</li>\n</ul>\n<p>We strongly encourage you to apply even if you don’t fit all the requirements. You don’t have to match all the listed requirements exactly to be considered for this role.</p>\n<p><strong>Why Join ChainSafe</strong></p>\n<p>Founded by developers for developers, ChainSafe is a remote-first company with an international team. We continue to provide opportunities for personal and professional growth, value autonomy and responsibility, have a results-driven environment, and offer flexible work hours.</p>\n<p>We care deeply about <a href=\"https://chainsafe.io/about\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">our values</a> and look for these attributes in every new team member. In addition, we recognize the benefits of cultivating a diverse team and aspire to embed respect for all people into our culture. We encourage women, the LGBTQIA+ community, people of color, and members of any other group underrepresented in the blockchain space (or tech in general) to apply.</p>\n<p><strong>How to Apply</strong> Please fill out the Greenhouse application form below and ensure that you attach your resume and link your Github/Gitlab profile or any software project you have contributed to (if applicable).</p><p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/non-tech\">Non Tech Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/research\">Research Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/community\">Community Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/developer\">Developer Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/engineering\">Engineering Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/rust\">Rust Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/discord\">Discord Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/senior\">Senior Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/typescript\">Typescript Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/polkadot\">Polkadot Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/manager\">Manager Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/ethereum\">Ethereum Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>.</p>",
    "createdOn": "2023-08-04T02:11:23.329Z",
    "companyId": 54
}