{
    "id": "64df982556c15d0002355d1a",
    "title": "Senior People Business Partner",
    "slug": "senior-people-business-partner-chainlink-labs-remote",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "research",
        "security",
        "engineering",
        "web3",
        "director",
        "senior",
        "data",
        "move",
        "full-time"
    ],
    "compensationMin": null,
    "compensationMax": null,
    "location": "",
    "applyLink": "https://jobs.lever.co/chainlink/27caeca2-d55c-47f8-9439-f93e834dbb1d?lever-origin=applied&lever-source%5B%5D=CryptoJobsList.com",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p><em>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST). We encourage you to apply regardless of your location. </em>\n \n<strong>About Us</strong> \nChainlink is the industry-standard Web3 services platform that enables developers to build feature-rich Web3 applications with seamless access to real-world data and off-chain computation.\n \n• Chainlink has helped enable $8T+ in transaction value since the start of 2022.\n• Over 1,700 Web3 projects have integrated Chainlink services.\n• Chainlink is live on 15+ blockchains with many having joined the Chainlink SCALE program.\n• Chainlink is relied upon by industry-leading protocols like Aave, Compound, Paxos, Synthetix, and ENS.\n• Chainlink has delivered 7.4B+ data points on-chain and onboarded 900+ decentralized oracle networks.\n• Chainlink has established collaborations with Associated Press, Accuweather, AWS, Google Cloud, Meta, and Twilio.\n• The world-class Chainlink Labs research team has won various awards for its work on distributed systems, security, and more.\n \n<strong>Who we’re looking for: </strong>\n• You’re focused on what matters most and ignore unimportant industry distractions. \n• You take extreme ownership and deliver outstanding results. \n• You have a growth mindset, seek out feedback and engage in constructive dialogue with others to help them grow.\n• You move fast and evolve with rapidly advancing technologies. \n• You want to be part of a team that excels and is committed to building the Chainlink Network and growing the Web3 ecosystem over the long term. \n• You are welcoming toward a diverse network of participants joining an open, global standard.\n• You’re excited about the future of Web3 and building a world powered by cryptographic truth. \n \nAt Chainlink Labs, the People Team plays a pivotal role in driving the company&#39;s growth and shaping its future. We strive to make Chainlink Labs the premier destination in the Web3 space. Our goal is to attract, inspire, and retain a global, diverse and highly skilled workforce that continually raises the bar for performance and in driving impact. We foster an environment in which career-defining moments are created, offering meaningful challenges that unlock unprecedented opportunities for personal and professional growth. We compete fiercely in the Web3 labor market and extend our reach into the Web2 talent pool, always aiming to share knowledge and onboard non-Web3 talent into our company and industry. The People Team is at the forefront of these endeavors, playing a crucial role in nurturing a culture where the business and our employees win.\n \nThis is a career defining opportunity to be a part of a scaling blockchain company that is successfully implementing a key piece of the world’s blockchain infrastructure powering the digital agreements of the future.\n \nIn this People Business Partner role, you will work directly with the leaders of our G&amp;A or Engineering functions.  You will enable organizational, leadership, and management capabilities while representing individual and team needs through our specialist COE teams,  You will partner closely with leaders on organizational health and design, engagement, coaching, and change management. \n \nAs a key member of our team, you will directly influence the people strategy of your business units.  \nWe are looking for someone who is focused on enabling best-in-class employee experience within a remote-first, high performing culture.</p>\n<h3>Your Impact</h3>\n<ul>\n<ul>\n<li>Advise leaders on the development, engagement, and retention of highly sought after global talent</li>\n<li>Increase organizational effectiveness through targeted employee listening and action planning</li>\n<li>Enable managers within assigned business units to effectively manage talent; this includes enabling managers to provide clear, results-oriented feedback and facilitating performance calibration and promotion processes that promote consistent &amp; fair decision-making</li>\n<li>Improve the PBP engagement model within assigned business units, aligning time and focus with organizational impact; partner with leaders to proactively develop solutions for org health and org design needs</li>\n<li>Develop methods to track and increase management-related capabilities engagement scores across assigned business units, especially in the areas of feedback, coaching, development, communication, and open dialogue</li>\n</ul>\n</ul>\n\n\n\n\n<h3>Requirements</h3>\n<ul>\n<ul>\n<li>3-5 years’ experience in HRBP role</li>\n<li>5+ years of experience in HR</li>\n<li>Demonstrated success in HR functional areas and partnership with COEs, including talent management, organizational design, total rewards, employee relations, organizational health, and program management</li>\n<li>Proven ability to partner with senior leaders, including leaders Sr Director and above</li>\n<li>HRBP experience in the tech industry, especially with a globally distributed workforce, remote preferable</li>\n<li>Demonstrated success in scaling and differentiating people programs to align with business need/strategy </li>\n<li>Deep experience partnering with highly skilled employee populations and competitive labor markets</li>\n</ul>\n</ul>\n\n\n\n\n<h3>Desired Qualifications</h3>\n<ul>\n<ul>\n<li>Experience working at or advising a web3 company</li>\n<li>Interest in blockchain technology and/or smart contracts</li>\n<li>Prior experience as HRBP for G&amp;A or Engineering </li>\n</ul>\n</ul>\n\n\n\n<p><strong>Privacy Policy and an Equal Opportunity Employer: </strong>\nChainlink Labs is an Equal Opportunity Employer. To request an accommodation in our recruitment process, please contact us at .\n \nPlease see our <a href=\"https://chainlinklabs.com/privacy-policy\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Privacy Policy</a> for more information about how we collect and use your application information.</p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Cryptocurrency Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/research\">Research Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/security\">Security Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/engineering\">Engineering Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/director\">Director Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/senior\">Senior Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/data\">Data Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/move\">Move Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>.</p>",
    "createdOn": "2023-08-19T00:55:07.463Z",
    "companyId": 11
}