{
    "id": "64cdaf9b719f55000210c44a",
    "title": "Suspicious Activity Report (SAR) Investigator",
    "slug": "suspicious-activity-report-sar-investigator-binance-asia",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "non-tech",
    "tags": [
        "non-tech",
        "legal",
        "exchange",
        "web3",
        "aml",
        "compliance",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Asia",
    "applyLink": "https://jobs.lever.co/binance/5e9bddd4-c35a-4981-a6e8-d6477d0df46f/apply",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>Binance is the leading global blockchain ecosystem and cryptocurrency infrastructure provider whose suite of financial products includes the world’s largest digital-asset exchange. Our mission is to accelerate cryptocurrency adoption and increase the freedom of money.If you’re looking for a fast-paced, mission-driven organization where opportunities to learn and excel are endless, then Binance is the place for you.We are seeking a SAR Investigator to support our compliance growth into all global frontiers and provide support on suspicious activity reviews to ensure we stay in continuous compliance with regulations and internal policy requirements. <h3>Responsibilities:</h3><ul><ul><li>Handle and review assigned cases within available SLAs, including advising relevant stakeholders on next steps</li><li>Maintain escalation log and ensure all escalations to the team are promptly reviewed and resolved</li><li>Maintain client off-boarding log and support client off-boarding process where required</li><li>Where there are grounds for suspicion or requirement for guidance in relation to a case, escalate accordingly to the team lead and relevant MLROs</li><li>Partner with relevant internal stakeholders to strengthen quality of SARs, and ensure consistency and accuracy</li><li>Proficient in compliance applications and programmes such as ComplyAdvantage, Actimize, Thomson Reuters World-Check, Elliptic etc.</li><li>Good knowledge on provisions of local laws, directives, regulations and otherwise standards applicable to subject persons and knowledge of upcoming regulation of virtual currency policies is a strong plus</li><li>Participate in internal and external programs related to AML/ CFT and other subjects that may form part of the day to day work requirements</li><li>Any general administration and ancillary activities as may be required and related to the above functions in accordance with the business requirements of the Company</li></ul></ul><h3>Requirements:</h3><ul><ul><li>Bachelor&#39;s degree in a Business, Legal, or related field, or equivalent practical experience</li><li>3-5 years of experience in investigations, including filing SARs, or related audit/regulatory experience at a financial institution or fintech company</li><li>Ability to navigate through ambiguity in a fast-paced, dynamic environment</li><li>Excellent attention to detail, with the ability to be action-oriented and seek to meet high standards</li><li>Excellent written and verbal communication, time management, analytical, and investigative skills</li></ul></ul>Please note, all positions at Binance require relevant experience. Applications without the required experience will not be considered. <b>Working at Binance</b>• Be a part of the world’s leading blockchain ecosystem that continues to grow and offers excellent career development opportunities.• Work alongside diverse, world-class talent in an environment where learning and growth opportunities are endless.• Tackle fast-paced, challenging and unique projects.• Work in a truly global organization, with international teams and a flat organizational structure.• Competitive salary and benefits.• Balance life and work with flexible working hours and casual work attire.Learn more about how Binancians embody the organization’s <a href=\"https://www.binance.com/en/blog/ecosystem/what-exactly-is-binances-culture-5487396240897265423\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">core values</a>, creating a unified culture that enables collaboration, excellence, and growth. Apply today to be a part of the Web3 revolution! Binance is committed to being an equal opportunity employer. We believe that having a diverse workforce is fundamental to our success. <i>By submitting a job application, you confirm that you have read and agree to our </i><a href=\"https://www.binance.com/en/candidate/privacy/notice\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\"><i>Candidate Privacy Notice</i></a><i>.</i></p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Cryptocurrency Jobs</a>, <a href=\"https://cryptojobslist.com/non-tech\">Non Tech Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/legal\">Legal Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/exchange\">Exchange Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/aml\">Aml Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/compliance\">Compliance Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>.</p>",
    "createdOn": "2023-08-05T08:00:00.048Z",
    "companyId": 10
}