{
    "id": "64df9ac656c15d0002355d22",
    "title": "Technical Account Manager",
    "slug": "technical-account-manager-chainlink-labs-remote",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "non-tech",
        "research",
        "community",
        "developer",
        "web3",
        "dao",
        "defi",
        "finance",
        "manager",
        "data",
        "solidity",
        "full-time"
    ],
    "compensationMin": null,
    "compensationMax": null,
    "location": "",
    "applyLink": "https://jobs.lever.co/chainlink/a5aac4e6-6102-44d8-b7db-d393e488d755?lever-origin=applied&lever-source%5B%5D=CryptoJobsList.com",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p>As a Technical Account Manager at Chainlink Labs, you will be a vital member of our team, responsible for nurturing and enhancing our relationships with strategic partners in the top DeFi protocols. Your primary focus will be to understand our partners&#39; technical requirements, facilitate smooth product integration, and deliver exceptional account management support. By leveraging your extensive experience in technical account management and deep knowledge of web3 and DeFi, you will drive customer satisfaction, promote product usage, and foster long-term partnerships. Your expertise and interpersonal skills will be instrumental in shaping the success of both our partners and Chainlink Labs.</p>\n<h3>Objectives of this Role</h3>\n<ul>\n<ul>\n<li>Establish a Comprehensive Account Management Plan encompassing various aspects such as community engagement, DAO governance landscape, delegate outreach, product integration, and roadmap alignment.</li>\n<li>Create and oversee team structure for the account management plan.</li>\n<li>Establish good working relationships with key stakeholders.</li>\n<li>Grow the product usage of existing products.</li>\n<li>Take user feedback to help product generate new features and products to drive user satisfaction.</li>\n</ul>\n</ul>\n\n\n\n\n<h3>Skills &amp; Qualifications</h3>\n<ul>\n<ul>\n<li>5+ Years of Extensive Technical Account and Relationship Management: You should possess at least 5 years of experience in technical account management, managing large and complex accounts, and successfully engaging stakeholders at all levels and functions within organizations.</li>\n<li>Deep knowledge of web3 / blockchain technology and strong experience with DeFi</li>\n<li>Strong Technical Aptitude: You should have the ability to read and comprehend code, such as Solidity, and navigate large-scale software development projects.</li>\n<li>Strong business acumen and experience driving commercial negotiations</li>\n<li>2+ years working in web3 environments</li>\n<li>2+ years experience working with decentralized applications (DApps), smart contracts, and blockchain technology.</li>\n</ul>\n</ul>\n\n\n\n\n<h3>Preferred Qualifications</h3>\n<ul>\n<ul>\n<li>Business acumen and experience driving commercial negotiations</li>\n<li>2 years working in web3 environments</li>\n<li>2 years experience working with decentralized applications (DApps), smart contracts, and blockchain technology.</li>\n</ul>\n</ul>\n\n\n\n<p><strong>Our Principles</strong>\n \nAt Chainlink Labs, we’re committed to the key operating principles of ownership, focus, and open dialogue. We practice complete ownership, where everyone goes the extra mile to own outcomes into success. We understand that unflinching focus is a superpower and is how we channel our activity into technological achievements for the benefit of our entire ecosystem. We embrace open dialogue and critical feedback to arrive at an accurate and truthful picture of reality that promotes both personal and organizational growth.\n \n<strong>About Chainlink Labs</strong>\n \nChainlink is the industry standard oracle network for connecting smart contracts to the real world. With Chainlink, developers can build hybrid smart contracts that combine on-chain code with an extensive collection of secure off-chain services powered by Decentralized Oracle Networks. Managed by a global, decentralized community of hundreds of thousands of people, Chainlink is introducing a fairer model for contracts. Its network currently secures billions of dollars in value for smart contracts across the decentralized finance (DeFi), insurance, and gaming ecosystems, among others. The full vision of the Chainlink Network can be found in the <a href=\"https://research.chain.link/whitepaper-v2.pdf\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">Chainlink 2.0 whitepaper</a>. Chainlink is trusted by hundreds of organizations—from global enterprises to projects at the forefront of the blockchain economy—to deliver definitive truth via secure, reliable data.  \n \nThis role is location agnostic anywhere in the world, but we ask that you overlap some working hours with Eastern Standard Time (EST).\n \nWe are a fully distributed team and have the tools and benefits to support you in your remote work environment.\n \n<em>Chainlink Labs is an Equal Opportunity Employer.</em></p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/non-tech\">Non Tech Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/research\">Research Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/community\">Community Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/developer\">Developer Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/dao\">Dao Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/defi\">DeFi Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/finance\">Finance Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/manager\">Manager Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/data\">Data Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/solidity\">Solidity Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-19T00:54:58.236Z",
    "companyId": 11
}