{
    "id": "64cdafc5719f55000210c44c",
    "title": "VP, Communications",
    "slug": "vp-communications-yuga-labs-remote",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "remote",
    "tags": [
        "remote",
        "non-tech",
        "community",
        "content",
        "web3",
        "executive",
        "discord",
        "data",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Remote",
    "applyLink": "https://boards.greenhouse.io/yugalabs/jobs/4218848005#app",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "<p><strong>Our Team</strong></p>\n<p>The brand-builders and storytellers communicating both our unique history and our ambitious vision of the future. From Discord chit chat and GM tweets to global press releases and memorable events, this team works across channels and platforms to define and evolve how Yuga engages with the world.</p>\n<h4><strong>Who We’re Looking For</strong>We are seeking a strategic and visionary leader with a passion for solving new and exciting problems in the world of communications. As a member of the Executive Leadership Team, the VP of Communications will report to the CEO and play a pivotal role in shaping the company's messaging, brand identity, and stakeholder engagement.</h4>\n<h4><strong>The Job</strong></h4>\n<ul>\n<li>Develop and implement a comprehensive communications strategy aligned with Yuga Labs' overall mission, vision, and business objectives. Lead and guide the Corporate Communications, Social/Content Production, and Community teams towards achieving key performance indicators.</li>\n<li>Oversee the development and maintenance of Yuga Labs' brand identity and reputation. Ensure consistency in messaging across all communication channels, both internally and externally.</li>\n<li>Establish and maintain relationships with key media outlets, journalists, and industry influencers. Proactively manage media inquiries and serve as the company's spokesperson when necessary.</li>\n<li>Collaborate with the Social/Content Production team to create engaging and impactful content across various platforms. Drive content strategies that resonate with the Web3 community and target audiences.</li>\n<li>Develop and implement crisis communication plans to effectively address potential issues and protect the company's reputation during challenging situations.</li>\n<li>Work closely with the Community team to foster a strong and vibrant community and keep our community members abreast of developments in the Yuga Labs ecosystem. Implement strategies to engage and nurture the community's interests and feedback.</li>\n<li>Utilize data-driven insights to assess the effectiveness of communication strategies and campaigns. Continuously improve and optimize approaches based on key performance metrics.</li>\n</ul>\n<p><strong>Your Skills</strong></p>\n<ul>\n<li>10+ years of experience in Communications roles at high-growth companies. 5+ years in a people management role.</li>\n<li>Proven track record of effectively managing and leading cross-functional teams to achieve organizational goals.</li>\n<li>Outstanding verbal and written communication skills, with the ability to craft compelling narratives and deliver impactful messages.</li>\n<li>Strong strategic planning and analytical skills, with the ability to think critically and make data-driven decisions.</li>\n<li>Experience in media relations and crisis communications, with a thorough understanding of the media landscape.</li>\n<li>Ability to thrive in a fast-paced and evolving environment, embracing change and uncertainty.</li>\n<li>A team player with the capacity to collaborate with colleagues at all levels of the organization.</li>\n<li>Experience with building and coaching a world-class Communications team.</li>\n<li>Constantly seeking new and creative ways to enhance Yuga Labs' communication efforts and amplify its reach.</li>\n</ul>\n<p>The annual salary for this position ranges from $275,000 to $325,000. The actual annual salary paid for this position will be based on several factors, including but not limited to, skills, prior experiences, training, company needs, and current market demands.  The annual salary range for this position is subject to change and may be adjusted in the future. This position may also be eligible for salary increases, bonuses, equity awards, and benefits.</p><p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/remote\">Remote Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/non-tech\">Non Tech Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/community\">Community Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/content\">Content Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/executive\">Executive Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/discord\">Discord Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/data\">Data Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Web3 Jobs</a>.</p>",
    "createdOn": "2023-08-05T02:11:17.823Z",
    "companyId": 41
}