{
    "id": "64cc5e52a935960002d9692f",
    "title": "Wallet Operations Specialist",
    "slug": "wallet-operations-specialist-binance-asia",
    "jobType": [
        "FULL_TIME"
    ],
    "role": "trading",
    "tags": [
        "trading",
        "operations",
        "exchange",
        "web3",
        "full-time"
    ],
    "compensationMin": 0,
    "compensationMax": 0,
    "location": "Asia",
    "applyLink": "https://jobs.lever.co/binance/185d7720-c486-4a4f-ae7a-4950d2ee3add/apply",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "<p>Binance is the leading global blockchain ecosystem and cryptocurrency infrastructure provider whose suite of financial products includes the world’s largest digital-asset exchange. Our mission is to accelerate cryptocurrency adoption and increase the freedom of money.If you’re looking for a fast-paced, mission-driven organization where opportunities to learn and excel are endless, then Binance is the place for you.<h3>Responsibilities</h3><ul><ul><li>Coordinate with internal and external stakeholders to achieve given KPI</li><li>Assist the team lead to implement structured workflow, guidelines and improve team efficiency</li><li>Monitor and control all stages of the project life cycle and ensure that team’s project targets are met within the project timeline </li><li>Monitor and resolve wallet issues by coordinating with internal and external stakeholders. </li><li>Investigate business demands and provide overall solutions and implementation.</li><li>Analysis of issues faced by users and propose solutions</li><li>Other related duties allocated by the team leader</li></ul></ul><h3>Requirements</h3><ul><ul><li>3-5 years of experience in operations or managing projects or management consulting.</li><li>Good understanding of financial and blockchain trading business</li><li>Great logical thinking ability, communication skills, self-driven, and quick-learner</li><li>Have a sense of responsibility, self-motivation and a strong capability to work under pressure</li></ul></ul><b>Working at Binance</b>• Be a part of the world’s leading blockchain ecosystem that continues to grow and offers excellent career development opportunities.• Work alongside diverse, world-class talent in an environment where learning and growth opportunities are endless.• Tackle fast-paced, challenging and unique projects.• Work in a truly global organization, with international teams and a flat organizational structure.• Competitive salary and benefits.• Balance life and work with flexible working hours and casual work attire.Learn more about how Binancians embody the organization’s <a href=\"https://www.binance.com/en/blog/ecosystem/what-exactly-is-binances-culture-5487396240897265423\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\">core values</a>, creating a unified culture that enables collaboration, excellence, and growth. Apply today to be a part of the Web3 revolution! Binance is committed to being an equal opportunity employer. We believe that having a diverse workforce is fundamental to our success. <i>By submitting a job application, you confirm that you have read and agree to our </i><a href=\"https://www.binance.com/en/candidate/privacy/notice\" rel=\"noopener noreferrer nofollow ugc\" target=\"_blank\"><i>Candidate Privacy Notice</i></a><i>.</i></p>\n<p class=\"cjl-hid-lnk\">Listed in: <a href=\"https://cryptojobslist.com\">Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/trading\">Trading Crypto Jobs</a>, <a href=\"https://cryptojobslist.com/operations\">Operations Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/exchange\">Exchange Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/web3\">Web3 Web3 Jobs</a>, <a href=\"https://cryptojobslist.com/full-time\">Full Time Crypto Jobs</a>.</p>",
    "createdOn": "2023-08-04T10:30:01.808Z",
    "companyId": 10
}