{
    "id": 3286,
    "title": "Associate PR Manager",
    "slug": "associate-pr-manager",
    "jobType": "full-time",
    "role": "blockchain",
    "tags": [
        "blockchain",
        "discord",
        "manager"
    ],
    "compensationMin": "70000",
    "compensationMax": "90000",
    "location": "",
    "applyLink": "https://boards.greenhouse.io/yugalabs/jobs/4300260005",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "Yuga Labs is a web3 company exploring big ideas in identity, ownership, utility, and interoperability to push the crypto and NFT space forward. As The Defiant recently said, “The story of Yuga Labs is one where the improbable has become reality in the blink of an eye.” Since debuting with our flagship collection Bored Ape Yacht Club in April 2021, we’ve created new IP for the ape ecosystem (Mutant Ape Yacht Club, Bored Ape Kennel Club), acquired other top collections (CryptoPunks and Meebits), and pulled off successful events (ApeFest) and partnerships (Rolling Stone). And we made both web3 and gaming history — the biggest NFT mint ever followed by a game demo with record-breaking synchronized player participation —  for our newest initiative, Otherside.</p>\nOur Team</h3>\nThe brand-builders and storytellers, communicating both our unique history and our ambitious vision of the future. From Discord chit chat and GM tweets to global press releases and memorable events, this team works across channels and platforms to define and evolve how Yuga engages with the world.</p>\nWho We’re Looking For</h3>\nWe are hiring an Associate PR Manager to join our Communications team. We have tons to do, building the future of web3, and we need help supporting the  execution, research and logistics of our communication strategy. You’ll be part of a fast-paced and collaborative team.</p>\nThe Job</h3>\n\nDevelop and maintain strong relationships with key journalists, bloggers, and influencers within the Web3 and mainstream media.</li>\nDrive earned media coverage through creative pitches and unique story angles.</li>\nRespond to media inquiries promptly and professionally, ensuring accurate representation of the company’s activities and vision.</li>\nSupport on the execution of company and product announcements as well as public relations campaigns and activations – preparing all necessary research.</li>\nAct as a liaison to the full communication team by keeping community managers and social leads up to speed on PR campaigns, and offer strategic PR insight into launch initiatives to make sure we are executing well-rounded campaigns.</li>\nCollaborate with the marketing team to create engaging and informative press releases, blog posts, and other PR materials.</li>\nAct as liaison for all conferences, summits, and events across internal and external channels.</li>\nWork closely with Community Team Leads to manage calendar and grant submissions for Yuga-supported community events.</li>\nMonitor media coverage and industry trends to identify opportunities and proactively address any emerging issues.</li>\nRegularly analyze and organize media lists, agendas, and schedules.</li>\nProvide regular reports and analysis on PR efforts, including media metrics and key performance indicators (KPIs).</li>\n</ul>\nYour Skills</h3>\n\n 3+ years of experience in public relations or communications</li>\nProven track record of successful PR campaigns and securing media coverage.</li>\nExceptional written and verbal communication skills, with an ability to craft compelling narratives and press materials.</li>\nDemonstrated ability to build and maintain media relationships with key industry influencers.</li>\nExcellent organizational and project management skills, with the ability to handle multiple tasks and priorities effectively.</li>\nCrisis management experience and the ability to remain calm and composed under pressure.</li>\nPassion for emerging technologies and a willingness to stay up-to-date with industry trends.</li>\n</ul>\n </p>\nThe annual salary for this position ranges from $75,000 to $90,000. The actual annual salary paid for this position will be based on several factors, including but not limited to, skills, prior experiences, training, company needs, and current market demands.  The annual salary range for this position is subject to change and may be adjusted in the future. This position may also be eligible for salary increases, bonuses, equity awards, and benefits.</p>\nWhat We Offer</h3>\n\nWorking with the best-in-class talent creating innovative technologies and bringing the forefront of culture to web3</li>\nExposure to innovative technologies in cryptocurrency, blockchain technology, and game development</li>\nCollaboration with blue chip projects and AAA studios and partners</li>\nGreat internal growth and development</li>\n100% remote</li>\nCompetitive compensation, benefits, and perks</li>\n</ul>\nApply anyway.</h3>\nWe believe true innovation in web3 requires diversity in perspectives, experiences, and backgrounds. But historically marginalized groups are underrepresented in the space, not just as participants but as leaders and creators. Luckily, we — and every web3 company — have the opportunity to bake necessary process and mindset shifts into our company DNA from the early days.</p>\n </p>\nTo help build a web3 that’s diverse and inclusive, we strive to build Yuga’s workplace to be diverse and inclusive. Not just how we do things day to day, but who does them and who decides what needs to be done.</p>\n </p>\nSo if you’re excited about one of our roles but your resume doesn’t align perfectly with the job description, please apply anyway. If you’re enthusiastic about web3 but come from an industry you think is unrelated, apply anyway. If you’re a great thinker and doer, apply anyway. The fate of web3 kiiinda depends on it.</p>\nLife at Yuga Labs</h3>\nAt Yuga Labs, being an Equal Opportunity Employer means more than upholding discrimination-free hiring practices. It means that we cultivate an environment where people can be their most authentic selves and find both belonging and support. We’re shaping the future of identity, community, and technology—an experience made whole by our unique backgrounds and perspectives.</p>\n </p>\nAs a remote-first company, we encourage our employees to care for their whole selves through comprehensive medical benefits, generous paid-time off, paid parental leave, retirement plans, company social events, wellness programs, and volunteer opportunities.</p>\nReasonable Accommodation</h3>\nYuga Labs applicants are considered solely based on their qualifications, without regard to applicant’s disability or need for accommodation. Any Yuga Labs applicant who requires reasonable accommodations during the application process should contact the Yuga Labs Benefits Team (accommodations@yugalabs.com) to make the need for an accommodation known.</p>\n",
    "createdOn": "2023-08-18T18:11:34",
    "companyId": 41
}