{
    "id": 3268,
    "title": "Community Manager (Associate)",
    "slug": "community-manager-associate",
    "jobType": "full-time",
    "role": "community manager",
    "tags": [
        "community manager",
        "defi",
        "discord",
        "manager",
        "marketing"
    ],
    "compensationMin": "20000",
    "compensationMax": "110000",
    "location": "Bogotá, Bogota, Colombia",
    "applyLink": "https://apply.workable.com/zkx/j/2B8F4099B9/",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "ZKX is the first permissionless protocol for derivatives built on StarkNet. We’re building a decentralized exchange that lets users trade derivatives using reward mechanisms, liquidity provisioning, and simplified access to complex trading strategies. We’re passionate about democratizing access to global yields so anyone can invest in them.</p>\n </p>\nYou can read more about our vision, what we’re building, and our roadmap here</a>.</p>\n </p>\nWe’re backed by well-known venture funds in the ecosystem. By joining us, you have the opportunity to work with a global team and the chance to shape the future at ZKX.</p>\nRequirements</h3>\nWe’re a community 1st approach project, and all the responsibilities will be centric on this approach. Major responsibilities include:</p>\n </p>\n\nDrive and nurture vibrant communities across channels (Discord, Telegram, etc.), lead engaging events, and champion key contributors & our community leaders.</li>\nBuild a strong community support system with contributors, and manage feedback, resolve queries across all channels.</li>\nEducate the community about the ZKX updates, new features, and industry best practices (periodic tutorials, guides, and FAQs etc).</li>\nContribute to identifying the right partnerships for the Trader community growth.</li>\nTrack community growth, engagement metrics, and feedback to report on community health and activity.</li>\nShare insights and learnings with the broader team to shape strategy.</li>\nActively review the performance of Contributors and guide them to succeed.</li>\nGather community feedback, understand the ground insights to refine products, and steer internal team decisions.</li>\nDeliver OKRs set on Community goals all throughout the year.</li>\n</ul>\nPreferred Qualifications</h3>\n\nMultilingual capabilities with excellent writing & verbal skills in English are a MUST have.</li>\nMin. 1 year of work experience in community management, preferably within the crypto or DeFi space.</li>\nA degen by heart who speaks the CT language and has a secret meme repository.</li>\nAbility to work in a dynamic work environment, and balance multiple projects if required.</li>\nFocus on the quality of work and attention to detail.</li>\nFamiliarity with community management tools and platforms.</li>\nFlexible hours to engage with international community members.</li>\n</ul>\nBenefits</h3>\n\nGlobal Team – Join to work with a team with extensive experience across venture building, technology scaleups, and financial derivatives structuring in 10+ countries across the globe.</li>\nFinancial Incentives – Competitive salary, token package, and high-performance incentives.</li>\nHealth and Wellness – We believe that each person’s well-being is essential to our success, and we try to create a work environment where people are supported in their physical, social and mental health.</li>\nLife@ZKX – Opportunity to travel the world, work with a talented team and connect with key people in the industry.</li>\nFlexible working hours and vacation Policy</li>\nOffice/co-working space and equipment reimbursement</li>\n</ul>\n </p>\nWe’re working to address some of the core problems in DeFi and are proud to be creating new fundamentals for the ecosystem. We constantly challenge ourselves, value transparency and trust, and love what we do.</p>\n </p>\nJoin us in delivering DeFi as it’s meant to be!</p>\n",
    "createdOn": "2023-08-16T20:50:40",
    "companyId": 70
}