{
    "id": 3282,
    "title": "Content / Growth Marketer",
    "slug": "content-growth-marketer",
    "jobType": "full-time",
    "role": "blockchain",
    "tags": [
        "blockchain",
        "content writer",
        "ethereum",
        "marketing"
    ],
    "compensationMin": "80000",
    "compensationMax": "120000",
    "location": "",
    "applyLink": "https://livepeer.teamtailor.com/jobs/3069092-content-growth-marketer?ref=myweb3jobs.com",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "About You</h3>\nAre you excited to bring a disruptive video streaming infrastructure to a rapidly growing market? Do you find it interesting to experiment with growth channels and growth strategies? Are you a self-motivated person who loves the flexibility of remote-first culture at a small startup? If you are a marketer with strong go-to-market experience and a passion for video streaming, you should consider joining Livepeer as a Content / Growth Marketer.</p>\nAbout Livepeer</h3>\nLivepeer’s mission is to build the world’s open video infrastructure, enabling instantly scalable, reliable, and affordable video streaming. Users of Livepeer can access instantly reliable and scalable video infrastructure while saving over 10x in cost compared to traditional cloud infrastructure providers.</p>\n </p>\nAs a blockchain-based protocol that has been live on Ethereum since 2018, Livepeer is one of the first web3 networks to deliver real-world value to an existing multi-billion dollar industry. We do this by using our open-source, blockchain coordinated, p2p network to enable a worldwide community of hardware operators to run infrastructure for video streaming. In trying times like this, Livepeer provides a unique video solution that helps communities and businesses innovate, adapt, and grow through the power of video.</p>\n </p>\nLivepeer is proud to be an Equal Opportunity Employer that is committed to inclusion and diversity. We are committed to providing a community and environment for mutual respect, without regard to race, color, religion, sex, pregnancy, national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, gender expression, genetic information, military and veteran status, and any other characteristic protected by applicable law. We believe diversity and inclusion are crucial to our success and seek to recruit/develop from a diverse candidate pool.</p>\nAbout the Role</h3>\nAs Livepeer’s Content / Growth Marketer, you will play a crucial role in bringing a disruptive video streaming service to market. You will be responsible for building out and executing on Livepeer’s content and growth strategy, using a combination of data and creativity to iterate on marketing experiments / validate growth channels.</p>\n </p>\nYou will work directly with the founder of Livepeer on a small but experienced go-to-market team. You will also collaborate closely with Livepeer’s world-class product and engineering team, all with the same goal of shifting the paradigm for digital video by changing our assumptions on what’s possible.</p>\nRequirements</h3>\n\nTechnical proficiency: you can quickly grasp the technical nuances of Livepeer’s developer facing video streaming product, and convey strong credibility in marketing communication.</li>\nData driven decision making: you are experienced with a range of analytics tools and platforms. You enjoy the work to iteratively measure / analyze / optimize campaign performance.</li>\nContent creation and SEO: you like to create and guide high-quality / technical content that appeal to key technical decision makers, and have strong experience in search engine optimization for niche terms.</li>\nMulti-channel marketing: you have experience across a range of channels such as online events, webinars, content syndication, email marketing, paid ads. You are familiar with developer growth channels like Github, Stack Overflow, Product Hunt, and Hacker News.</li>\nEarly startup experience: you have demonstrated success at an early stage startup or comparable environments. You default to taking initiatives and communicating with clarity.</li>\nRemote first experience: you are excited to work on a remote first team, sift through Discord / Slack threads to gain context, and enjoy written communication as much as verbal communication.</li>\n</ul>\nHere is what to expect during the interview process:</h3>\n\nInitial Phone Interview</li>\nFirst and Second Round Interview</li>\nReference Checks</li>\n</ul>\nSalary Range:</h3>\n\n$85,000 – $120,000 for candidates residing in US</li>\nAdjustments apply for international employees</li>\n</ul>\n",
    "createdOn": "2023-08-18T16:11:32",
    "companyId": 64
}