{
    "id": 3276,
    "title": "Full Stack Software Engineer (Mid-Level)",
    "slug": "full-stack-software-engineer-mid-level",
    "jobType": "full-time",
    "role": "blockchain",
    "tags": [
        "blockchain",
        "engineering",
        "full stack",
        "node",
        "react"
    ],
    "compensationMin": "60000",
    "compensationMax": "130000",
    "location": "London, United Kingdom",
    "applyLink": "https://jobs.lever.co/ledger/67e92d7d-990d-4cc1-8c36-4ecf6a87a89a/",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "We’re making the world of digital assets accessible and secure for everyone. Join the mission. </b></p>\n </p>\nFounded in 2014, Ledger is the global platform for digital assets and Web3. Over 20% of the world’s crypto assets are secured through our Ledger Nanos. Headquartered in Paris and Vierzon, with offices in the UK, US, Switzerland and Singapore, Ledger has a team of more than 900 professionals developing a variety of products and services to enable individuals and companies to securely buy, store, swap, grow and manage crypto assets – including the Ledger hardware wallets line with more than 6 millions units already sold in 200 countries.</p>\n </p>\nAt Ledger, we embody the values that make us unique: Pragmatism, Audacity, Commitment, Trust and Transparency. Hear from our employees how they shape the work we do here.</p>\n </p>\nJoining us means integrating with our core web engineering group, the brains behind ledger.com. From piloting an ecommerce system that manages transactions worth over €100 million annually to pioneering blockchain applications, they’re at the forefront of innovation.</p>\n </p>\nAs a mid-level engineer on our team, you’ll be crucial in the next phase of our growth. Leveraging your growing experience, you’ll contribute to the redesign of our primary systems, aiming to unveil features and products that resonate with our users. Embrace this phase, rich in learning opportunities and autonomy, and carve out a role that’s both stimulating and rewarding.</p>\nYour mission:</h3>\n\nEngage in the creation of new features and functionalities, consistently elevating our customer experience and refining the core systems’ overall productivity.</li>\nDevelop, manage, and oversee vital systems, ensuring the reliability, speed, and accessibility of our primary e-commerce platforms.</li>\nCollaboratively test ideas on users with your team, harnessing feedback to refine and enhance our product.</li>\nContribute to decisions concerning tools, architecture, and Agile practices in specific areas of development.</li>\nAdvocate for and implement best practices and engineering standards, drawing from your experience to collaborate with and support the team.</li>\n</ul>\nWhat we’re looking for:</h3>\n\nExperience in a commercial tech setting with a record of designing scalable and sturdy applications.</li>\nExperience with our main technologies: React, Typescript, Node.js & AWS.</li>\nProficiency in software development; you produce clean, efficient code across various languages, all under version control.</li>\nFlexibility in tool selection for the task is essential.</li>\nExpertise in crafting clean, semantic HTML and CSS that ensures a consistent and responsive user experience across platforms.</li>\nExperience with high-traffic transactional websites and a sound understanding of performance-enhancing best practices</li>\n</ul>\nWhat’s in it for you?</h3>\n\nEquity: Employees are the foundation of our success, and we award stock options so you can share in that success as we grow.</li>\nFlexibility: A hybrid work policy</li>\nSocial: Frequent social events, snacks and drinks</li>\nMedical: Comprehensive health insurance policy with AXA offering extensive medical, dental and vision care coverage.</li>\nHoliday: 28 days of paid leave per year, in addition to national holidays.</li>\nHigh tech: Access to high performance office equipment and gadgets, including Apple products.</li>\nTransport: Ledger subsidises the cost of your Oyster card!</li>\nDiscounts: Employee discount on all our products</li>\n</ul>\n </p>\nWe are an equal opportunity employer for all without any distinction of gender, ethnicity, religion, sexual orientation, social status, disability or age.</i></p>\n",
    "createdOn": "2023-08-17T18:55:31",
    "companyId": 67
}