{
    "id": 3280,
    "title": "Junior Compliance Analyst",
    "slug": "junior-compliance-analyst",
    "jobType": "full-time",
    "role": "analyst",
    "tags": [
        "analyst",
        "blockchain",
        "defi",
        "junior",
        "nft"
    ],
    "compensationMin": "90000",
    "compensationMax": "130000",
    "location": "",
    "applyLink": "https://www.coinbase.com/careers/positions/5268555?gh_jid=5268555?gh_src=myweb3jobs.com",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "At Coinbase, our mission is to increase economic freedom around the world, and we couldn’t do this without hiring the best people. We’re a group of hard-working overachievers who are deeply focused on building the future of finance and Web3 for our users across the globe, whether they’re trading, storing, staking or using crypto. Know those people who always lead the group project? That’s us.</p>\n </p>\nThere are a few things we look for across all hires we make at Coinbase, regardless of role or team. First, we look for candidates who will thrive in a culture like ours, where we default to trust, embrace feedback, and disrupt ourselves. Second, we expect all employees to commit to our mission-focused approach to our work. Finally, we seek people who are excited to learn about and live crypto, because those are the folks who enjoy the intense moments in our sprint and recharge work culture. We’re a remote-first company looking to hire the absolute best talent all over the world.</p>\nReady to #LiveCrypto? Who you are:</h3>\n\nYou’ve got positive energy. You’re optimistic about the future and determined to get there.</li>\nYou’re never tired of learning. You want to be a pro in bleeding edge tech like DeFi, NFTs, DAOs, and Web 3.0.</li>\nYou appreciate direct communication. You’re both an active communicator and an eager listener – because let’s face it, you can’t have one without the other. You’re cool with candid feedback and see every setback as an opportunity to grow.</li>\nYou can pivot on the fly. Crypto is constantly evolving, so our priorities do, too. What you worked on last month may not be what you work on today, and that excites you. You’re not looking for a boring job.</li>\nYou have a “can do” attitude. Our teams create high-quality work on quick timelines. Owning a problem doesn’t scare you, but rather empowers you to take 100% responsibility for achieving our mission.</li>\nYou want to be part of a winning team. We’re stronger together, and you’re a person who embraces being pushed out of your comfort zone.</li>\n</ul>\nWe are seeking a junior level compliance professional to report into the Coinbase Canada Chief Compliance Officer (CCO). In this role, you will support the CCO with implementing and administering the compliance program. We are looking for someone who shares our values, is a team player but can work independently, and who thrives in a dynamic environment.</p>\nWhat you’ll be doing (ie. job duties):</h3>\n\nProviding regulatory and compliance guidance to the Coinbase Canada business as it grows and expands.</li>\nSupport the Coinbase Canada CCO on a day to day basis</li>\nAssist with the preparation of key compliance reporting and governance deliverables</li>\nEstablish and develop processes to cater for the expanding Canadian regulatory environment</li>\nRemain knowledgeable of changing industry initiatives.</li>\nMonitor the regulatory environment including review & analysis of regulatory announcements, reports, and legislative changes</li>\nMaintain detailed documentation to demonstrate compliance with regulations and internal policies and procedures</li>\nDrive small adhoc targeted projects focusing on elements of the Canadian compliance program</li>\nFrom time to time provide assistance to the Compliance Department by completing other activities over and above those listed in the duties listing, appropriate to your skills and experience</li>\n</ul>\nWhat we look for in you (ie. job requirements):</h3>\n\n2+ years experience in compliance at financial services, with particular focus on cryptocurrency and fintech</li>\nKnowledge of Canadian compliance and regulatory matters, specifically FINTRAC guidelines</li>\nCapacity to meet deadlines while maintaining quality standards and ensuring effective time management</li>\nAbility to thrive in fast-paced remote environment</li>\nKeen interest in digital assets</li>\nTeam player, willing to tackle tasks large or small</li>\nOrganized and detail-oriented</li>\nBachelors degree or equivalent</li>\n</ul>\nNice to haves:</h3>\n\nProfessional Compliance or finance qualification and membership of a recognised professional body would be advantageous, but not a prerequisite</li>\n</ul>\n </p>\nPay Transparency Notice:  Depending on your work location, the target annual salary for this position is CAD $103,000 + target bonus + target equity + benefits.</p>\nCommitment to Equal Opportunity</h3>\nCoinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer.  All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law.  For US applicants, you may view Pay Transparency, Employee Rights and Know Your Rights notices by clicking on their corresponding links.  Additionally, Coinbase participates in the E-Verify program in certain locations, as required by law.</p>\n </p>\nCoinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to accommodations[at]coinbase.com and let us know the nature of your request and your contact information.  For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here).</p>\n </p>\nGlobal Data Privacy Notice for Job Candidates and Applicants</h3>\nDepending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here. By submitting your application, you are agreeing to our use and processing of your data as required. For US applicants only, by submitting your application you are agreeing to arbitration of disputes as outlined here.</p>\n",
    "createdOn": "2023-08-18T15:15:47",
    "companyId": 65
}