{
    "id": 3284,
    "title": "Lead Front End Engineer",
    "slug": "lead-front-end-engineer",
    "jobType": "full-time",
    "role": "blockchain",
    "tags": [
        "blockchain",
        "engineering",
        "front-end",
        "javascript",
        "react",
        "senior"
    ],
    "compensationMin": "60000",
    "compensationMax": "180000",
    "location": "Madrid",
    "applyLink": "https://jobs.lever.co/polymerlabs/2c8a1632-54ce-4516-a7d4-3a4e07f07607/",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "About The Role:</h3>\nAs our second hire in Spain, you will be joining our core blockchain engineering team focused on User Interface and building our presence in Vietnam. You will apply your experience in web2 on both OSS work around IBC (https://ibcprotocol.org/) and the core Polymer protocol. Web3 and blockchain experience is explicitly not required but is a strong plus.</p>\nYou Will:</h3>\n\nPrimarily be using React and TypeScript, focusing on the UIs of an OSS dashboard for IBC, and other Polymer specific ones.</li>\nImplementing initial prototypes and proofs of concept, and taking them all the way to production interfacing with developers building on the future standard networking layer of web3.</li>\nFocus on improving developer UX through the OSS IBC dashboard.</li>\nMaintain integrations with our work on an OSS IBC-SDK and other tooling.</li>\nMaintaining a robust suite of tests to ensure that the UI functionality of our products is of the highest quality.</li>\n</ul>\nWhat You Will Achieve:</h3>\n\nIn the first month, you will build a deep understanding of Polymer Lab’s core protocol and begin contributing to documentation of the product. You will have time to learn about the space, our customer’s needs, and the underlying technology.</li>\nWithin 2 months, you will be fully integrated into the team and own the development of the OSS IBC dashboard. Success looks like sustainable growth and scaling the adoption of IBC and Polymer’s IBC transport hub.</li>\n</ul>\nYou Have:</h3>\n\n5+ years of Frontend and/or Full Stack development utilizing HTML5 and JavaScript.</li>\nExperience with React or similar interactive web UI libraries.</li>\nA passion for growing and up-leveling your peers, and have pre-existing mentoring experience and a nuanced view around how to help junior engineers grow</li>\nDegree in Computer Science or related field.</li>\nExperience working with distributed development and engineering teams.</li>\nExposure to start-up or scale-up environment.</li>\nInterest in infrastructure, crypto, DeFi or willing to learn quickly.</li>\nStrong communication skills and fluent in English (written and spoken).</li>\n</ul>\nAbout The Team:</h3>\n\nThe engineering team is a diverse group of people with backgrounds working at a variety of both web2 and web3 organizations like Google, Uber, Chronosphere, Arista Networks, etc. Polymer Labs is a software development shop supporting the Polymer protocol and IBC (https://ibcprotocol.org/).</li>\n</ul>\nOur Benefits:</h3>\n\nCompetitive salary, equity/token grants, incentive compensation</li>\nAutonomous, distributed work environment collaborating with a diverse, global team</li>\nOpportunity to shape and contribute to industry-disrupting infrastructure</li>\nA place to openly learn bleeding edge innovation in a fast growing industry</li>\nHealth insurance coverage</li>\n</ul>\n </p>\nPolymer Labs is an equal opportunity employer. You’re encouraged to apply even if your experience doesn’t line up exactly with the job description.</p>\n",
    "createdOn": "2023-08-18T17:11:32",
    "companyId": 63
}