{
    "id": 3265,
    "title": "Product Marketer",
    "slug": "product-marketer-2",
    "jobType": "full-time",
    "role": "blockchain",
    "tags": [
        "blockchain",
        "content writer",
        "marketing"
    ],
    "compensationMin": "50000",
    "compensationMax": "150000",
    "location": "",
    "applyLink": "https://jobs.lever.co/Coinshift/82bfe0f7-76c0-4b9b-adec-cabe92b66720/",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "About Coinshift</h3>\nCoinshift is a leading non-custodial treasury management platform built on top of Gnosis safe. We provide a smart and sophisticated user experience application to manage treasury ops in an efficient manner. Our mission is to help improve the financial health of organisations</p>\n </p>\nLearn more about our values, culture, and career opportunities here: Life at Coinshift</p>\n </p>\nSince launching the MVP in June 2021, we’ve seen crazy traction from having nearly $215M+ in processed payments and having a billion dollars in assets under management. We now serve thousands of users across three continents and over 10 different countries. And we’re just getting started.</p>\nProduct Marketer</h3>\nWe’re on the hunt for a dynamic and action-oriented marketer to be the first marketing addition to our team. The ideal candidate will possess the perfect blend of strategy and execution, thriving in the high-octane environment of a startup. Your strategic acumen will align with our cross-functional teams, enabling the delivery of product marketing and campaign execution.</p>\n </p>\nReporting directly to our Product Lead, you will straddle the realms of Product Marketing and Growth Marketing. Your role encompasses launching, tracking, and optimising campaigns across various channels. The aim? To seamlessly guide our prospects and customers through the marketing funnel while effectively communicating the benefits of our product.</p>\n </p>\nYou will constantly ideate on our key messages and the right audience for them, ensuring our brand’s voice reaches the market effectively.</p>\nResponsibilities</h3>\n\nDevelop and implement robust product marketing strategies encompassing positioning, messaging, competitive analysis, and go-to-market plans.</li>\nSupport Go-To-Market (GTM) strategies with product, sales enablement, pricing, partner marketing, and competitive analysis.</li>\nCraft Coinshift’s overarching messaging and positioning, collaborating closely with our product and growth teams.</li>\nManage our distribution channels, demand generation, inbound marketing, website, marketing tech stack, paid advertising, and marketing analytics.</li>\nWork closely with the brand & visuals designer.</li>\nPen our monthly newsletter, keeping our audience updated on our latest developments.</li>\nDefine our social media strategy, with a focus on Twitter and other relevant platforms.</li>\nCollaborate with our Customer Success team to enhance user testimonials and onboarding processes.</li>\nRegularly experiment with diverse marketing strategies to optimize outreach and engagement.</li>\n</ul>\n📊 Example Metrics</h3>\n\nOrganic website traffic</li>\nReferral traffic from social media, particularly Twitter</li>\nNewsletter subscription rates</li>\nInbound leads and conversion rate</li>\n</ul>\nRequirements</h3>\n\n3+ years of experience in product marketing, growth marketing, or content creation.</li>\nPrior experience at an early-stage B2B SaaS company.</li>\nA strong understanding of the web3 ecosystem, key projects, topical narratives, and emerging trends.</li>\nA proactive “doer” with a keen eye for exceptional marketing strategies.</li>\nExcellent writing and editing skills (samples required).</li>\nKnowledgeable or interested in go-to-market technology, startups, and growth strategies.</li>\nProven experience in establishing and leading marketing teams and strategies.</li>\n</ul>\nNice-to-Haves</h3>\n\nExperience as the first marketing hire.</li>\nPrior experience in the web3/cryptocurrency space.</li>\n2+ years experience in product development related to fintech, payments, or financial reporting.</li>\n</ul>\nPerks & Benefits</h3>\n💻 Equipment Stipend</b></p>\nUnleash your productivity and creativity with our unbeatable remote office setup package – a generous equipment stipend to ensure you have everything you need to work comfortably and effectively.</p>\n </p>\n⌛ Flexible Time Off</b></p>\nAt Coinshift, we believe in the power of taking time to recharge and rejuvenate. That’s why we offer unlimited time off to all team members, with the average taking a refreshing 4-6 weeks.</p>\n </p>\n💰Get Paid in Real Time, in Crypto</b></p>\nWant to be at the forefront of the Web3 revolution? Join our team and get the option to be paid in Crypto – with our partnership with SuperFluid, you’ll have access to real-time salary streaming.</p>\n </p>\n💼 Coworking Space Coverage</b></p>\nWe’ll cover the expenses if you choose to work at a coworking space. Allowing you to work in a professional and productive environment while keeping your work-life balance intact.</p>\n </p>\n🏄Annual Retreats</b></p>\nAnd, once a year, we’ll whisk you away to an amazing destination for our annual team retreat, where you’ll collaborate, bond, and make unforgettable memories!</p>\nOur Interview Process</h3>\nInitial Screen (30 mins): We’ll assess your qualifications to ensure they align with the job requirements.</p>\n </p>\nCulture Fit Call (60 minutes): We’ll assess your fit with our company culture and values to ensure you’ll thrive in our environment.</p>\n </p>\nTake-Home Assessment (3-5 hours): You’ll have the chance to showcase your skills and experience in a tangible way.</p>\n </p>\nAssessment Deep Dive (60 Minutes): The hiring manager will guide you through a detailed review of your assessment.</p>\n </p>\nWe look forward to your application!</p>\n",
    "createdOn": "2023-08-16T19:09:03",
    "companyId": 71
}