{
    "id": 3263,
    "title": "Senior Backend Engineer, Trading Desk Engineering",
    "slug": "senior-backend-engineer-trading-desk-engineering",
    "jobType": "full-time",
    "role": "back-end",
    "tags": [
        "back-end",
        "blockchain",
        "engineering",
        "golang",
        "python",
        "senior"
    ],
    "compensationMin": "70000",
    "compensationMax": "180000",
    "location": "Singapore",
    "applyLink": "https://boards.greenhouse.io/coinhako/jobs/4280959005?ref=myweb3jobs.com",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "Coinhako</b> is a market-leading platform for access to digital assets like Bitcoin from Singapore.</p>\n </p>\nFounded in 2014, Coinhako has established a reputation as being one of the most secure and trusted digital asset wallet service providers and trading platforms in the APAC market. Our team is deeply passionate about building the crypto economy in the APAC region. Through the launch of our innovative suite of products and services, Coinhako aims to empower individuals and businesses by allowing them to take ownership and control of how they build and manage their assets in the new digital finance world.</p>\n </p>\nWe are looking for a Senior Backend Engineer</b> to join our Engineering Team to support our Trading Desk Team!</p>\nWhat you’ll be doing:</h3>\n\nDesign, build and maintain our backend services</li>\nEnsure the quality and performance of applications to specifications</li>\nCollaborate with cross-functional teams to define, design, and implement new features</li>\nOptimize build and runtime performance of our services and application</li>\nActively participate in team discussions to drive problem-solving</li>\nParticipate in all phases of the development life cycle such as developing, code review, testing, and debugging</li>\n</ul>\nWhat we’re looking for:</h3>\n\nMinimum 5 years of professional work experience as a Software Engineer in designing and building distributed systems</li>\nStrong background in Python  or Go</li>\nStrong communication and interpersonal skills</li>\nExperience building and improving trading systems</li>\nExperience with REST APIs and WebSocket</li>\nExperience with Amazon Web Services, Docker, and Terraform</li>\nExperience building systems using SQL and NoSQL databases</li>\nComfortable working in a fast-paced work environment</li>\nDemonstrate an collaborative attitude with a bias toward action</li>\nExperience working in Cryptocurrency/Blockchain/Fintech/Finance Trading domain is a plus</li>\n</ul>\nWhat’s in it for you:</h3>\n\nFriendly and fun start-up work culture</li>\nConvenient work location located in the heart of CBD area</li>\nGenerous annual leaves on top of national holidays</li>\nMedical coverage including GP, Specialist, TCM, and more</li>\nSelf-care benefits and exciting fitness workshops/webinars</li>\nVibrant office with a well-stocked pantry</li>\nAnimal-friendly environment, with a fluff ball in the office</li>\n</ul>\nFind out more about Coinhako here</a> and don’t forget to visit our Careers Page</a>!</p>\n",
    "createdOn": "2023-08-16T17:09:02",
    "companyId": 72
}