{
    "id": 3294,
    "title": "Senior Product Marketing Manager",
    "slug": "senior-product-marketing-manager",
    "jobType": "full-time",
    "role": "blockchain",
    "tags": [
        "blockchain",
        "manager",
        "marketing",
        "product manager",
        "senior"
    ],
    "compensationMin": "80000",
    "compensationMax": "180000",
    "location": "New York, NY",
    "applyLink": "https://jobs.lever.co/spectral/eddd28df-375d-426c-96dd-617f32f5fc31/",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "In the rapidly-evolving world of web3 protocols, infrastructure projects, and dApp communities, the increasing complexity of discerning valuable signals from raw on-chain data is a pressing concern. These entities, rooted in the ethos of decentralization, recognize the paramount importance of crowd-sourced solutions.</p>\n </p>\nTransitioning to the broader landscape, traditional businesses across diverse verticals face similar challenges. For smaller entities, the barrier to entry is high, often leading to prolonged trial-and-error phases and the daunting task of attracting top-tier data scientists and ML engineers. Similarly, more established entities may be restricted to a single ML approach, limiting their perspective. Conversely, there’s a worldwide global community of data scientists and ML engineers (who we call ‘modelers’) seeking to refine their ML expertise, engage with compelling real-world problems, network and collaborate with similar-minded individuals, and ultimately, receive a fair and sustainable compensation for their intellectual contributions.</p>\n </p>\nAt Spectral, we are building a platform that can connect modelers and creators. Our mission is to pioneer ML-powered insights’ initiation, protection, dissemination, and consumption within an ownership economy. We believe in credible neutrality, ensuring that all interactions, even between unfamiliar actors, are rooted in trust and security. Our platform is designed to empower businesses and innovators to collaboratively transform challenges into opportunities, reshaping the future of collaborative problem-solving.</p>\n </p>\nWe are seeking a Senior Product Marketing Manager (PMM) to join our team and lead our go-to-market strategy and product activation initiatives for this new phase of our product. You will play a key role in translating intricate technical functionalities into core product benefits and ensuring our messaging resonates with our modelers and creators’ pain points. This position reports directly to the CMO.</p>\nKey Responsibilities</h3>\n\nPartner with product, engineering, and data science teams to distill key technical functionalities into core product benefits. Translate these benefits into compelling narratives that elevate and differentiate Spectral solutions.</li>\nCollaborate on creating high-quality external product collateral, including demos, webinars, presentations, case studies, web content, blog posts, and other assets to maximize the effectiveness of product launches and releases.</li>\nTake charge of product positioning and develop messaging strategies that set our solutions apart, ensuring these resonate with our key target audience across channels based on ongoing research and analysis.</li>\nDevelop an in-depth technical understanding of Spectral’s products and features, acting as the subject matter expert at community and in-person events.</li>\nPlan and execute user research programs and complete user journeys to distill insights and refine our profile target personas.</li>\nConduct ongoing market research to identify trends, customer segments, and competitive intelligence reports. Stay updated on new Web3 and ML trends to inform Spectral’s product roadmap and positioning.</li>\n</ul>\nKey Requirements</h3>\n\nMinimum of 5 years of experience launching products and managing complex projects in fast-paced tech or web3 companies, ideally in product marketing or product management. Past work experience in data science or ML is preferred.</li>\nProven track record of conducting meticulous market research and mapping the competitive landscape to drive successful go-to-market strategies and product launches.</li>\nExceptional storytelling skills with an innate ability to simplify intricate technical concepts. Outstanding written and oral communication is a must.</li>\nDeep empathy for users, a robust understanding of user pain points, and the ability to translate these into unbiased product requirements based on market insights.</li>\nProven expertise in product messaging, product positioning, and competitive strategy. Bonus points for technical evangelism.</li>\nComfortable working with data and possessing sharp analytical skills.</li>\nOutstanding organizational and prioritization skills. Ability to manage multiple projects with tight deadlines effectively. You are a self-starter who enjoys working in a fast-paced, innovative start-up environment.</li>\nSolid understanding of the blockchain industry and a passion for data science to change the world. Prior experience in the competitive ML platform landscape is a plus, along with alignment with the vision of a decentralized AI platform.</li>\n</ul>\nThis role is location agnostic anywhere in the world, but we ask that you overlap some working hours with Eastern Standard Time (EST). We are a fully distributed team and have the tools and benefits to support you in your remote work environment.</p>\n",
    "createdOn": "2023-08-20T18:38:15",
    "companyId": 61
}