{
    "id": 3272,
    "title": "Senior Software Engineer, Backend",
    "slug": "senior-software-engineer-backend-4",
    "jobType": "full-time",
    "role": "back-end",
    "tags": [
        "back-end",
        "defi",
        "engineering",
        "ethereum",
        "nft",
        "node",
        "senior",
        "solana"
    ],
    "compensationMin": "180000",
    "compensationMax": "220000",
    "location": "",
    "applyLink": "https://boards.greenhouse.io/phantom45/jobs/4001425005?gh_jid=4001425005?ref=myweb3jobs.com",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "Our crypto wallet is used by millions of people and provides a single, convenient solution for managing all your accounts and tokens across Solana, Ethereum, and Polygon. As a backend engineer at Phantom you’ll be creating APIs, data pipelines and services that bridge the gap between the blockchain and the delightful experience our users have come to expect. Join us on our mission to make the digital economy safe and easy to use for everyone.</p>\n </p>\nThis role is fully remote; however, we’re only open to candidates based in US and EU time zones. Currently, Phantom cannot support employees from the following countries and continents: Russia, Pakistan, Ukraine, Asia, Oceania, and Africa.</p>\nResponsibilities</h3>\n\nInfrastructure: You will help define how Phantom runs and deploys backend services to our millions of users.</li>\nFeature development: You will be owning backend features that support all our platforms (extension, mobile and desktop).</li>\nInterfacing with users: You will be interfacing directly with end-users and developers building on Phantom – supporting them and collecting feedback to inform the direction of the product.</li>\nTeam building: You will be working with the team to create and foster a culture of raising the bar with each new hire.</li>\n</ul>\nQualifications</h3>\n\nBachelors degree in Computer Science or related technical field or equivalent practical experience</li>\n5+ years full-time software engineering experience with some of the following technologies:</li>\nTypescript / NodeJS / Express</li>\nDocker / Terraform</li>\nAWS Lambda / Cloudflare Workers / Serverless</li>\nDynamoDB / SQS / Kinesis / Redshift</li>\nAWS / Cloudflare</li>\nDemonstrated interest in open and community-driven platforms</li>\nNice-To-Have: experience in a blockchain based project</li>\nEnglish language proficiency</li>\n</ul>\nWhy Work with Us</h3>\nOpportunity</h4>\nWe are a team of experienced builders with a ton of traction in a big and growing market – our users are so passionate they were hacking their way into our private beta. Only months after launching we’ve acquired millions of users, and are adding hundreds of thousands every week. We are by far the leading wallet on Solana, and have expanded to Ethereum and Polygon.</p>\n </p>\nOn top of that, there has never been a better time to work in crypto and on wallets in particular.</p>\n </p>\n\nWallets play a pivotal role: Wallets are responsible for on-boarding new users into crypto, and can make or break the user experience.</li>\nWe are moving to a multi-chain world: New blockchains and scaling solutions are coming online and gaining traction, but are lacking decent wallets and bridges.</li>\nDeFi & NFTs are exploding : Interest in DeFi and NFTs has exploded, yet they are still an after-thought in existing wallets.</li>\n</ul>\nBenefits</h4>\n\nCompetitive salary and equity.</li>\nComprehensive insurance (medical/dental/vision) — 100% covered.</li>\nStipend for your ideal remote / WFH set-up: laptop, headphones, and any other work gear you may need.</li>\nFlexible hours and a long-standing, supportive remote environment.</li>\nMonthly co-working space and mobile phone expense.</li>\nUnlimited vacation: Take time when you need it (and we really mean it).</li>\n401(k) retirement plan (although we are not matching at this time)</li>\nWellness benefit</li>\nDaily lunch benefit</li>\n</ul>\n </p>\nThe target base salary for this role will range between $180,000 to $220,000 with the addition of equity and benefits. This is determined by a few factors including your skillset, prior relevant experience, quality of interviews and market factors (such as location) at the point in time of offer.</p>\n",
    "createdOn": "2023-08-17T14:55:56",
    "companyId": 69
}