{
    "id": 3247,
    "title": "Senior Network Engineer",
    "slug": "senior-network-engineer",
    "jobType": "full-time",
    "role": "crypto",
    "tags": [
        "crypto",
        "dao",
        "engineering",
        "golang",
        "nft",
        "python",
        "ruby",
        "senior"
    ],
    "compensationMin": "170000",
    "compensationMax": "210000",
    "location": "",
    "applyLink": "https://www.coinbase.com/careers/positions/5165806?gh_jid=5165806&ref=myweb3jobs.com",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "At Coinbase, our mission is to increase economic freedom around the world, and we couldn’t do this without hiring the best people. We’re a group of hard-working overachievers who are deeply focused on building the future of finance and Web3 for our users across the globe, whether they’re trading, storing, staking or using crypto. Know those people who always lead the group project? That’s us.</p>\n </p>\nThere are a few things we look for across all hires we make at Coinbase, regardless of role or team. First, we look for candidates who will thrive in a culture like ours, where we default to trust, embrace feedback, and disrupt ourselves. Second, we expect all employees to commit to our mission-focused approach to our work. Finally, we seek people who are excited to learn about and live crypto, because those are the folks who enjoy the intense moments in our sprint and recharge work culture. We’re a remote-first company looking to hire the absolute best talent all over the world.</p>\nReady to #LiveCrypto? Who you are:</h3>\n\nYou’ve got positive energy. You’re optimistic about the future and determined to get there.</li>\nYou’re never tired of learning. You want to be a pro in bleeding edge tech like DeFi, NFTs, DAOs, and Web 3.0.</li>\nYou appreciate direct communication. You’re both an active communicator and an eager listener – because let’s face it, you can’t have one without the other. You’re cool with candid feedback and see every setback as an opportunity to grow.</li>\nYou can pivot on the fly. Crypto is constantly evolving, so our priorities do, too. What you worked on last month may not be what you work on today, and that excites you. You’re not looking for a boring job.</li>\nYou have a “can do” attitude. Our teams create high-quality work on quick timelines. Owning a problem doesn’t scare you, but rather empowers you to take 100% responsibility for achieving our mission.</li>\nYou want to be part of a winning team. We’re stronger together, and you’re a person who embraces being pushed out of your comfort zone.</li>\n</ul>\nThe IT Operations Network Engineering team is part of the IT Operations Engineering organization. This group manages shared infrastructure and systems used by all of Coinbase. The Network Engineering team manages internal Coinbase networks (LAN,WAN, Firewalls and Wireless) and provides a stable and high-performance experience for our employees. This engineer will work closely with product engineering groups in the management and design of cloud infrastructure.</p>\nWhat you’ll be doing:</h3>\n\nMaintain a highly available and performant set of local networks across our business offices. This includes driving improvements in observability, metrics and monitoring, paving the way for automated network response.</li>\nManage the security posture of our VPN gateways and office firewalls with our internal security teams and external partners. Contribute to the long-term zero-trust plan.</li>\nWork with our Product Infrastructure team to align on policy and strategy across networks and cloud infrastructure.</li>\nStandardize configuration templates, management and incident response. Improve the ability of the Help Desk or end users to diagnose issues without escalation to Networking teams.</li>\nBuild relationships with our network vendors, drive vendor selection and business review cadence.</li>\nDrive internet telephony service improvements, knowledge of WebRTC and SIP. Amazon Connect is a plus.</li>\nFacilitate incident response, conduct root cause analysis and blameless retrospectives. Participate in Network on-call.</li>\n</ul>\nWhat we look for in you:</h3>\n\nStrong network knowledge across multiple vendors (Cisco, Juniper/Mist, Palo Alto, Aruba).</li>\nTechnology knowledge spanning network verticals (Lan, WAN, Wireless, Security). Demonstrated expertise in at least two areas.</li>\nProficiency with code, and the ability to do scripting or coding in at least one popular language (Bash, python, Ruby, Go, etc).</li>\nGreat team player, willing to collaborate with others to create the best outcome for the business.</li>\nAt least five years supporting network and cloud infrastructure.</li>\nExperience with automation across at least one platform.</li>\nFamiliarity with version control using CI/CD (Git).</li>\n</ul>\nNice to haves:</h3>\n\nThe ability to write strong technical and business-facing documents.</li>\nExperience with automation across multiple platforms.</li>\nPast experience working in a regulated industry.</li>\nExperience in a remote-first environment.</li>\nKnowledge of Crypto and Web3 technologies.</li>\n</ul>\nPay Transparency Notice</b>: Depending on your work location, the target annual salary for this position can range as detailed below. Full time offers from Coinbase also include target bonus + target equity + benefits (including medical, dental, vision and 401(k)).</p>\nPay Range:</p>\n$175,100—$206,000 USD</b></p>\n",
    "createdOn": "2023-08-14T19:09:07",
    "companyId": 65
}