{
    "id": 3274,
    "title": "User Researcher",
    "slug": "user-researcher",
    "jobType": "full-time",
    "role": "analyst",
    "tags": [
        "analyst",
        "blockchain"
    ],
    "compensationMin": "60000",
    "compensationMax": "130000",
    "location": "London, England, United Kingdom",
    "applyLink": "https://apply.workable.com/tokenweb3/j/2121BAC19D/",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": true,
    "description": "Hi, we’re token.com. Our goal is to create a world where money can flow effortlessly into the things people truly care about. token.com is the fun, simple and social platform to discover and invest in the game-changing ventures of tomorrow. At token.com we recognise the positive value of diversity, we promote equality and challenge discrimination. We actively encourage job applications from people of all backgrounds.</p>\n </p>\nWe’re a high-performance team of around 65 people. We have freedom and responsibility, a culture that encourages innovation, offers ownership and embraces knowledge sharing. We are now working as a team first, remote friendly company, arranging monthly get-togethers and regular team retreats. We also have a co-working space in London for collaboration and socialising.</p>\n </p>\nWe are looking for a User Researcher to join our awesome Product team! You’ll be playing a crucial role in understanding and addressing the challenges faced by our users within the token space. Through the application of various research methods such as interviews, surveys, and usability tests, you will collect and analyse relevant information to extract valuable insights. Collaborating closely with the product team, you will translate these insights into actionable recommendations, bridging the gap between user needs and product development. Your expertise will contribute to the improvement of our product, ensuring that it effectively addresses the identified user problems and maintains the needs and expectations of our users.</p>\n </p>\nTo help you best prepare, we’ve outlined the interview process for this role, we aim to have this process completed within 3 weeks:</p>\n </p>\n\n30 minute google meet with someone from our Talent Team</li>\n1 hour google meet for a portfolio review with our CPO</li>\n1 hour google meet call to meet some of the team</li>\nFinal 1 hour google meet with our CPO to answer any final questions</li>\n</ul>\nRequirements</h3>\nAbout you:</p>\nWhat we’re looking for:</p>\n </p>\n\nYou’ll have 3 + years experience within User Research, preferably in a customer facing product.</li>\nYou’ll have the ability to identify key problems users face in the relevant space, translating insights into actionable tasks.</li>\nYou’ll be excited to get involved in all areas of the Product life cycle.</li>\nYou’ll have hands-on experience conducting exploratory and evaluative research projects, including deep usability research.</li>\nPrevious experience working in a cross-functional team.</li>\nYou have solid proficiency in qualitative methodologies.</li>\nYou can be flexible in the way that you work!</li>\nYou have experience in emerging markets</li>\nYou’ve got experience studying users’ interactions, feedback, and challenges, and provide valuable data that helps improve the overall user experience and ensure that products are designed with users in mind.</li>\n</ul>\nWhat you’ll be doing:</h3>\n\nConduct research using various methods (interviews, surveys, usability tests, ethnographic studies) to gather user insights and feedback.</li>\nAnalyse research data to identify patterns, trends, and user preferences, extracting actionable insights for product improvements.</li>\nCreate user personas and map user journeys to understand the user experience and identify areas for enhancement.</li>\nOrganise and conduct usability testing sessions, gathering user feedback and recommending improvements.</li>\nCollaborate with cross-functional teams to incorporate user needs into product decisions and align research findings with business goals.</li>\nPresent research findings to stakeholders through reports, presentations, and visualisations, and maintain documentation.</li>\nStay updated with research techniques, industry trends, and user behaviours for ongoing improvement efforts.</li>\n</ol>\nBenefits</h3>\nWhat we offer you!</p>\n </p>\nOur team members are rewarded well! UK employees are offered the below, and we will aim for similar elsewhere:</p>\n </p>\n\nPrivate health insurance with all the fun extras (with options for your family too!)</li>\nA training & development budget that helps you to grow with token.com</li>\n25 days holiday plus local public holidays</li>\nFlexible working hours (we care about your output, not when you rock up or clock out)</li>\nExcellent paid maternity and paternity leave</li>\n</ul>\n",
    "createdOn": "2023-08-17T16:55:30",
    "companyId": 68
}