{
    "id": 3249,
    "title": "Video Editor (Contractor)",
    "slug": "video-editor-contractor",
    "jobType": "contractor",
    "role": "crypto",
    "tags": [
        "crypto",
        "marketing"
    ],
    "compensationMin": "20000",
    "compensationMax": "80000",
    "location": "New York, United States",
    "applyLink": "https://apply.workable.com/everyrealm/j/FA987C39A2/",
    "sticky": "boolean",
    "highlight": "boolean",
    "remote": false,
    "description": "Everyrealm is currently seeking a talented and creative Video Editor. As a Video Editor, you will be responsible for editing and producing high-quality videos for our social media platforms. You will collaborate with the social media team to create engaging and compelling video content that aligns with our brand image and resonates with our target audience.</p>\nAbout Everyrealm:</h3>\nEveryrealm is an immersive media company, specializing in technology and infrastructure that drives social, community-driven gaming experiences and platforms. Our mission is to build virtual communities that foster authentic human connection through imaginative, gamified experiences.</p>\nRequirements</h3>\n\nProven experience as a Video Editor, with a strong portfolio showcasing your work</li>\nProficient in video editing and graphic software including Adobe Premiere Pro, AfterEffects, Photoshop, Illustrator, and InDesign</li>\nSolid understanding of video production techniques, including editing, color grading, audio mixing, and motion graphics</li>\nStrong creative and storytelling skills, with an eye for detail and aesthetics</li>\nFamiliarity with social media platforms and their video requirements, specifically TikTok and YouTube</li>\nAbility to work independently and meet deadlines</li>\nStrong communication and collaboration skills</li>\nKnowledge of current trends in social media and digital content creation</li>\nFamiliarity with video game marketing and the video game culture</li>\n</ul>\nWhat you’ll do</h3>\n\nEdit and produce engaging video content for social media platforms, including but not limited to TikTok, YouTube, and Instagram</li>\nCollaborate with the social media team to develop video concepts and strategies that align with our brand objectives and target audience</li>\nTrim, crop, and enhance video footage, ensuring high-quality output</li>\nIncorporate motion graphics, text overlays, and visual effects to enhance the videos</li>\nEdit and synchronize audio tracks, including background music and voice overs</li>\nOptimize videos for different social media platforms, ensuring they meet the required specifications and guidelines</li>\nStay up to date with the latest trends and best practices in video editing for social media</li>\n</ul>\n",
    "createdOn": "2023-08-14T21:08:47",
    "companyId": 73
}